Repository: UiPath/Community.Activities
Catalog: Activities/FTP/UiPath.FTP.Activities/Properties/UiPath.FTP.Activities.*.resx
Languages: de, es, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

source: Accept all certificates
de: Alle Zertifikate akzeptieren
es: Aceptar todos los certificados
fr: Accepter tous les certificats
ja: すべての証明書を受け入れる
ko: 모든 인증서 수락
pt: Aceitar todos os certificados
pt_br: Aceitar todos os certificados
ru: Принять все сертификаты
tr: Tüm sertifikaları kabul et
zh_cn: 接受所有证书
zh_tw: 接受所有憑證

source: Client certificate password
de: Clientzertifikat-Kennwort
es: Contraseña del certificado de cliente
fr: Mot de passe du certificat client
ja: クライアント証明書のパスワード
ko: 클라이언트 인증서 암호
pt: Palavra-passe de certificado de cliente
pt_br: Senha do certificado do cliente
ru: Пароль сертификата клиента
tr: İstemci Sertifikası Parolası
zh_cn: 客户端证书密码
zh_tw: 用戶端憑證密碼

source: Client certificate path
de: Pfad des Clientzertifikats
es: Ruta del certificado del cliente
fr: Chemin d’accès du certificat client
ja: クライアント証明書のパス
ko: 클라이언트 인증서 경로
pt: Caminho de certificado de cliente
pt_br: Caminho do certificado do cliente
ru: Путь к сертификату клиента
tr: İstemci sertifika yolu
zh_cn: 客户端证书路径
zh_tw: 用戶端憑證路徑

source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
ko: 만들기
pt: Criar
pt_br: Criar
ru: Создание
tr: Oluştur
zh_cn: 创建
zh_tw: 建立

source: Credentials
de: Anmeldeinformationen
es: Credenciales
fr: Identifiants
ja: 資格情報
ko: 자격 증명
pt: Credenciais
pt_br: Credenciais
ru: Учетные данные
tr: Kimlik Bilgileri
zh_cn: 凭据
zh_tw: 憑證

# DefaultBodyName
source: Do
es: Hacer
ja: 実行
pt_br: Fazer
zh_cn: 执行
zh_tw: 執行

# PathNotFoundException
source: Path "{0}" not found.
de: Pfad „{0}“ nicht gefunden.
es: No se encontró la ruta "{0}".
fr: Chemin d’accès « {0} » introuvable.
ja: パス "{0}" が見つかりません。
ko: "{0}" 경로를 찾을 수 없습니다.
pt: O caminho "{0}" não foi encontrado.
pt_br: Caminho "{0}" não encontrado.
ru: Путь "{0}" не найден.
tr: "{0}" yolu bulunamadı.
zh_cn: 未找到路径“{0}”。
zh_tw: 找不到路徑 “{0}”。

# ExtensionNotFoundException
source: A required extension could not be found.
de: Eine erforderliche Erweiterung wurde nicht gefunden.
es: No se ha podido encontrar la extensión necesaria.
fr: Une extension nécessaire est introuvable.
ja: 必要な拡張子が見つかりませんでした。
ko: 필수 확장을 찾을 수 없습니다.
pt: Não foi possível encontrar uma extensão necessária.
pt_br: Não foi possível encontrar uma extensão solicitada.
ru: Не удалось найти требуемое расширение.
tr: Gerekli bir uzantı bulunamadı.
zh_cn: 找不到所需的扩展名。
zh_tw: 找不到所需的副檔名。

# FTPSessionNotFoundException
source: No FTP session found.
de: Keine FTP-Sitzung gefunden.
es: No se ha encontrado ninguna sesión FTP.
fr: Aucune session FTP n’a été détectée.
ja: FTP セッションが見つかりません。
ko: FTP 세션을 찾을 수 없습니다.
pt: Nenhuma sessão FTP encontrada.
pt_br: Nenhuma sessão FTP encontrada.
ru: Сеанс FTP не найден.
tr: FTP oturumu bulunamadı.
zh_cn: 未找到 FTP 会话。
zh_tw: 找不到 FTP 工作階段。

source: FTPS mode
de: FTPS-Modus
es: Modo FTPS
fr: Mode FTPS
ja: FTPS モード
ko: FTPS 모드
pt: Modo FTPS
pt_br: Modo FTPS
ru: Режим FTPS
tr: FTPS modu
zh_cn: FTPS 模式
zh_tw: FTPS 模式

source: Host
fr: Hôte
ja: ホスト
ko: 호스트
pt: Anfitrião
ru: Хост
tr: Ana Bilgisayar
zh_cn: 主机
zh_tw: 主機

# IncompatiblePathsException
source: The source path points to a directory but the destination path points to a file.
de: Der Quellpfad zeigt auf ein Verzeichnis, aber der Zielpfad zeigt auf eine Datei.
es: Los puntos de la ruta de almacenamiento señalan a un directorio, pero los puntos de la ruta de destino señalan a un archivo.
fr: Le chemin d’accès source renvoie vers un répertoire, mais le chemin d’accès de destination achemine renvoie vers un fichier.
ja: ソース パスはディレクトリを指していますが、宛先パスはファイルを指しています。
ko: 소스 경로가 디렉터리를 가리키지만 대상 경로가 파일을 가리킵니다.
pt: O caminho da origem aponta para um diretório, mas o caminho de destino aponta para um ficheiro.
pt_br: O caminho de origem aponta para um diretório, mas o caminho de destino aponta para um arquivo.
ru: Путь источника указывает на каталог, но путь назначения указывает на файл.
tr: Kaynak yol bir dizini işaret ediyor, ancak hedef yol bir dosyayı işaret ediyor.
zh_cn: 源路径指向目录，而目标路径指向文件。
zh_tw: 來源路徑指向目錄，但目的地路徑指向檔案。

source: Input
de: Eingabe
es: Entrada
fr: Entrée
ja: 入力
ko: 입력
pt: Entrada
pt_br: Entrada
ru: Ввод
tr: Giriş
zh_cn: 输入
zh_tw: 輸入

source: Local path
de: Lokaler Pfad
es: Ruta local
fr: Chemin d’accès local
ja: ローカル パス
ko: 로컬 경로
pt: Caminho local
pt_br: Caminho local
ru: Локальный путь
tr: Yerel Yol
zh_cn: 本地路径
zh_tw: 本機路徑

# OneFTPSessionPerContextException
source: An FTP session was already provided for the current context.
de: Für den aktuellen Kontext wurde bereits eine FTP-Sitzung bereitgestellt.
es: Ya se ha proporcionado una sesión FTP para el contexto actual.
fr: Une session FTP était déjà fournie pour le contexte actuel.
ja: FTP セッションは現在のコンテキストに既に提供されています。
ko: 현재 컨텍스트에 대한 FTP 세션이 이미 제공되었습니다.
pt: Já foi fornecida uma sessão FTP para o contexto atual.
pt_br: Uma sessão de FTP já foi fornecida para o contexto atual.
ru: Сеанс FTP уже предоставлен для текущего контекста.
tr: Geçerli bağlam için bir FTP oturumu zaten sağlandı.
zh_cn: 已为当前的上下文提供 FTP 会话。
zh_tw: 已為目前的上下文提供 FTP 工作階段。

source: Options
de: Optionen
es: Opciones
ja: オプション
ko: 옵션
pt: Opções
pt_br: Opções
ru: Параметры
tr: Seçenekler
zh_cn: 选项
zh_tw: 選項

source: Output
de: Ausgabe
es: Salida
fr: Sortie
ja: 出力
ko: 출력
pt: Saída
pt_br: Saída
ru: Вывод
tr: Çıkış
zh_cn: 输出
zh_tw: 輸出

source: Overwrite
de: Überschreiben
es: Sobrescribir
ja: 上書き
pt_br: Substituir
tr: Üzerine yaz
zh_cn: 覆盖
zh_tw: 覆寫

source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt: Palavra-passe
pt_br: Senha
ru: Пароль
tr: Parola
zh_cn: 密码
zh_tw: 密碼

source: Port
es: Puerto
ja: ポート
ko: 포트
pt: Porta
pt_br: Porta
ru: Порт
tr: Bağlantı Noktası
zh_cn: 端口
zh_tw: 連接埠

# Recursive
source: Include subfolders
de: Unterordner einbinden
es: Incluir subcarpetas
fr: Inclure les sous-dossiers
ja: サブフォルダーを含む
ko: 하위 폴더 포함
pt: Incluir subpastas
pt_br: Incluir subpastas
ru: Включить вложенные папки
tr: Alt klasörleri dahil et
zh_cn: 包括子文件夹
zh_tw: 包括子資料夾

source: Remote path
de: Remotepfad
es: Ruta remota
fr: Chemin d’accès distant
ja: リモート パス
ko: 원격 경로
pt: Caminho remoto
pt_br: Caminho remoto
ru: Удаленный путь
tr: Uzak yol
zh_cn: 远程路径
zh_tw: 遠端路徑

source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
ja: セキュリティ
ko: 보안
pt: Segurança
pt_br: Segurança
ru: Безопасность
tr: Güvenlik
zh_cn: 安全性
zh_tw: 安全性

source: Server
es: Servidor
ja: サーバー
zh_cn: 服务器
zh_tw: 伺服器

source: Use anonymous login
de: Anonyme Anmeldung verwenden
es: Usar el inicio de sesión anónimo
fr: Utiliser la connexion anonyme
ja: 匿名ログインを使用
ko: 익명 로그인 사용
pt: Utilizar início de sessão anónimo
pt_br: Usar login anônimo
ru: Использовать анонимный вход
tr: Anonim oturum açma kullan
zh_cn: 使用匿名登录
zh_tw: 使用匿名登入

source: Username
de: Nutzername
es: Nombre de usuario
fr: Nom d'utilisateur
ja: ユーザー名
pt_br: Nome de Usuário
tr: Kullanıcı adı
zh_cn: 用户名
zh_tw: 使用者名稱

source: Use SFTP
de: SFTP verwenden
es: Usar SFTP
fr: Utiliser SFTP
ja: SFTP を使用
ko: SFTP 사용
pt: Utilizar SFTP
pt_br: Usar SFTP
ru: Использовать SFTP
tr: SFTP kullan
zh_cn: 使用 SFTP
zh_tw: 使用 SFTP

# UnsupportedObjectTypeException
source: Unsupported object type encountered.
de: Nicht unterstützter Objekttyp gefunden.
es: Se ha encontrado un tipo de objeto no compatible.
fr: Type d’objet non pris en charge rencontré.
ja: サポートされていないオブジェクトの種類が検出されました。
ko: 지원되지 않는 개체 유형이 발견되었습니다.
pt: Foi encontrado um tipo de objeto não suportado.
pt_br: Tipo de objeto não compatível encontrado.
ru: Обнаружен неподдерживаемый тип объекта.
tr: Desteklenmeyen nesne türüyle karşılaşıldı.
zh_cn: 遇到了不支持的对象类型。
zh_tw: 遇到不支援的物件類型。

source: Exists
de: IstVorhanden
es: Existente
fr: Existe
ja: 存在の有無
pt_br: Existe
tr: Var
zh_cn: 存在
zh_tw: 存在

source: Files
de: Dateien
es: Archivos
fr: Fichiers
ja: ファイル
ko: 파일
pt: Ficheiros
pt_br: Arquivos
ru: Файлы
tr: Dosyalar
zh_cn: 文件
zh_tw: 檔案

# EmptyUsernameException
source: Username cannot be empty.
de: Der Benutzername darf nicht leer sein.
es: El nombre de usuario no puede estar vacío.
fr: Le nom dʹutilisateur ne peut pas être vide.
ja: ユーザー名を入力してください。
ko: 사용자 이름은 비워 둘 수 없습니다.
pt: O nome de utilizador não pode estar vazio.
pt_br: O nome de usuário não pode estar vazio.
ru: Имя пользователя не может быть пустым.
tr: Kullanıcı adı boş olamaz.
zh_cn: 用户名不得为空。
zh_tw: 使用者名稱不得為空。

source: SSL protocols
de: SSL-Protokolle
es: Protocolos SSL
fr: Protocoles SSL
ja: SSL プロトコル
ko: SSL 프로토콜
pt: Protocolos SSL
pt_br: Protocolos SSL
ru: Протоколы SSL
tr: SSL protokolleri
zh_cn: SSL 协议
zh_tw: SSL 通訊協定

# ClientCertificatePathDesc
source: Path to the Private key in PKCS #1 PEM format
de: Pfad zum privaten Schlüssel im PKCS #1 PEM-Format
es: Ruta a la clave privada en formato PKCS #1 PEM
fr: Chemin d’accès vers une clé privée au format #1 PEM
ja: PKCS #1 PEM 形式の秘密キーへのパスです。
ko: PKCS #1 PEM 형식의 개인 키 경로
pt: Caminho para a Chave privada no formato PEM PKCS #1
pt_br: Caminho para a Chave privada no formato PKCS #1 PEM
ru: Путь к закрытому ключу в формате PKCS #1 PEM
tr: PKCS #1 PEM biçimindeki Özel anahtarın yolu
zh_cn: PKCS #1 PEM 格式的私钥路径
zh_tw: PKCS #1 PEM 格式的私密金鑰路徑

# NoValidAuthenticationMethod
source: No valid authentication method found: You need to supply either Private Key file (and optionally passphare) or Password
de: Keine gültige Authentifizierungsmethode gefunden: Sie müssen entweder eine private Schlüsseldatei (und optional eine Passphrase) oder ein Kennwort angeben.
es: No se ha encontrado ningún método de autenticación válido: debe proporcionar un archivo de clave privada (y, de forma opcional, una frase de contraseña) o una contraseña
fr: Aucune méthode d’authentification valide trouvée : vous devez fournir un fichier de clé privée (et éventuellement une phrase secrète) ou mot de passe
ja: 有効な認証方法が見つかりません: 秘密キー ファイル (必要に応じてパスフレーズも含む) またはパスワードのいずれかを入力する必要があります。
ko: 유효한 인증 방법을 찾을 수 없음: 개인 키 파일(및 선택 사항으로 암호) 또는 암호를 입력해야 합니다.
pt: Nenhum método de autenticação válido encontrado: tem de fornecer um ficheiro de Chave Privada (e, opcionalmente, uma frase de acesso) ou uma Palavra-passe
pt_br: Nenhum método de autenticação válido encontrado: você precisa fornecer o arquivo de Chave Privada (e opcionalmente passphare) ou Senha
ru: Не найдено допустимого метода проверки подлинности. Необходимо предоставить файл закрытого ключа и кодовую фразу (необязательно) или пароль
tr: Geçerli kimlik doğrulama yöntemi bulunamadı: Özel Anahtar dosyası (ve isteğe bağlı olarak parola) veya Parola sağlamanız gerekir
zh_cn: 未找到有效的身份验证方法: 您需要提供私钥文件 (可选择提供密码) 或密码
zh_tw: 找不到有效的驗證方法: 您必須提供私密金鑰檔案 (可選擇提供密碼) 或密碼

# NewPath
source: New remote path
de: Neuer Remotepfad
es: Nueva ruta remota
fr: Nouveau nom du chemin d’accès distant
ja: 新しいリモート パス
ko: 새 원격 경로
pt: Novo caminho remoto
pt_br: Novo caminho remoto
ru: Новый удаленный путь
tr: Yeni uzak yol
zh_cn: 新建远程路径
zh_tw: 新遠端路徑

# DeleteDescription
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除を行います。(Delete)
ko: 삭제
pt: Eliminar
pt_br: Exclui
ru: Удалить
tr: Sil
zh_cn: 删除
zh_tw: 刪除

# DeleteDisplayName
source: Delete
es: Eliminar
ja: 削除
zh_cn: 删除
zh_tw: 刪除

# DirectoryExistsDescription
source: Directory Exists
de: Verzeichnis vorhanden
es: El directorio existe
ja: ディレクトリの存在を確認します。(Directory Exists)
ko: 디렉터리 있음
pt: O Diretório Existe
pt_br: O diretório existe
ru: Каталог существует
tr: Dizin Var
zh_cn: 目录存在
zh_tw: 目錄存在

# DirectoryExistsDisplayName
source: Directory Exists
es: El directorio existe
ja: ディレクトリの存在を確認
zh_cn: 目录存在
zh_tw: 目錄存在

# DownloadFilesDescription
source: Download Files
de: Dateien herunterladen
es: Descargar archivos
ja: ファイルをダウンロードします。(Download Files)
ko: 파일 다운로드
pt: Transferir Ficheiros
pt_br: Faz o download de arquivos
ru: Скачать файлы
tr: Dosyaları İndir
zh_cn: 下载文件
zh_tw: 下載檔案

# DownloadFilesDisplayName
source: Download Files
es: Descargar archivos
ja: ファイルをダウンロード
zh_cn: 下载文件
zh_tw: 下載檔案

# EnumerateObjectsDescription
source: Enumerate Objects
de: Objekte aufzählen
es: Enumerar objetos
ja: オブジェクトを列挙します。(Enumerate Objects)
ko: 개체 열거
pt: Enumerar Objetos
pt_br: Enumera objetos
ru: Пронумеровать объекты Object
tr: Nesneleri Numaralandır
zh_cn: 枚举对象
zh_tw: 列舉對象

# EnumerateObjectsDisplayName
source: Enumerate Objects
es: Enumerar objetos
ja: オブジェクトを列挙
zh_cn: 枚举对象
zh_tw: 列舉對象

# FileExistsDescription
source: File Exists
de: Datei vorhanden
es: El archivo existe
fr: Fichier existant
ja: ファイルの存在の有無を確認します。(File Exists)
ko: 파일 있음
pt: O Ficheiro Existe
pt_br: O arquivo existe
ru: Файл существует
tr: Dosya Var
zh_cn: 文件存在
zh_tw: 檔案存在

# FileExistsDisplayName
source: File Exists
es: El archivo existe
ja: ファイルの存在を確認
zh_cn: 文件存在
zh_tw: 檔案存在

# MoveItemDescription
source: Move Item
es: Mover elemento
ja: アイテムを移動します。(Move Item)
ko: 항목 이동
pt: Mover Item
pt_br: Move itens
ru: Переместить элемент
tr: Öğeyi Taşı
zh_cn: 移动项目
zh_tw: 移動項目

# MoveItemDisplayName
source: Move Item
es: Mover elemento
ja: アイテムを移動
zh_cn: 移动项目
zh_tw: 移動項目

# UploadFilesDescription
source: Upload Files
de: Dateien hochladen
es: Cargar archivos
ja: ファイルをアップロードします。(Upload Files)
ko: 파일 업로드
pt: Carregar Ficheiros
pt_br: Faz upload de arquivos
ru: Загрузить файлы
tr: Uygulamaları Yükle
zh_cn: 上传文件
zh_tw: 上傳檔案

# UploadFilesDisplayName
source: Upload Files
es: Cargar archivos
ja: ファイルをアップロード
zh_cn: 上传文件
zh_tw: 上傳檔案

# WithFtpSessionDescription
source: With Ftp Session
de: Mit FTP-Sitzung
es: Con sesión Ftp
fr: Avec session FTP
ja: FTP セッションを使用します。(With FTP Session)
ko: FTP 세션 포함
pt: Com Sessão Ftp
pt_br: Com a sessão do FTP
ru: С FTP-сеансом
tr: Ftp Oturumuyla
zh_cn: 启用 FTP 会话
zh_tw: 啟用 FTP 工作階段

# WithFtpSessionDisplayName
source: With Ftp Session
de: Mit FTP-Sitzung
es: Con sesión Ftp
fr: Avec session FTP
ja: FTP セッションを使用
ko: FTP 세션 포함
pt: Com Sessão Ftp
pt_br: Com a sessão do FTP
ru: С FTP-сеансом
tr: Ftp Oturumuyla
zh_cn: 启用 FTP 会话
zh_tw: 啟用 FTP 工作階段

# ClientCertificatePasswordDescription
source: ClientCertificatePassword
de: Clientzertifikatpasswort
es: ContraseñaDelCertificadoDelCliente
ja: クライアント証明書パスワードです。
pt_br: SenhadoCertificadodoCliente
tr: İstemciSertifikasıParolası
zh_cn: 客户端证书密码
zh_tw: 用戶端憑證密碼

source: ContinueOnError
de: BeiFehlerFortsetzen
es: ContinuarEnCasoDeError
fr: ContinuerSurErreur
ja: エラー発生時に実行を継続
pt_br: ContinuarComErro
tr: HataOlduğundaDevamEt
zh_cn: 出错时继续
zh_tw: 錯誤時繼續

# FilesDescription
source: Files
de: Dateien
es: Archivos
fr: Fichiers
ja: ファイルです。
ko: 파일
pt: Ficheiros
pt_br: Arquivos
ru: Файлы
tr: Dosyalar
zh_cn: 文件
zh_tw: 檔案

# HostDescription
source: Host
fr: Hôte
ja: ホストです。
ko: 호스트
pt: Anfitrião
ru: Хост
tr: Ana Bilgisayar
zh_cn: 主机
zh_tw: 主機

# LocalPathDescription
source: LocalPath
de: LokalerPfad
es: RutaLocal
fr: Chemin local
ja: ローカル パスです。
pt_br: CaminhoLocal
zh_cn: 本地路径
zh_tw: 本機路徑

# NewPathDescription
source: NewPath
es: NuevaRuta
ja: 新しいパスです。
ru: Новый путь
zh_cn: 新路径
zh_tw: 新路徑

# PasswordDescription
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 암호
pt: Palavra-passe
pt_br: Senha
ru: Пароль
tr: Parola
zh_cn: 密码
zh_tw: 密碼

# PortDescription
source: Port
es: Puerto
ja: ポート
ko: 포트
pt: Porta
pt_br: Porta
ru: Порт
tr: Bağlantı Noktası
zh_cn: 端口
zh_tw: 連接埠

# RemotePathDescription
source: Remote Path
de: Remotepfad
es: Ruta remota
fr: Chemin distant
ja: リモート パスです。
ko: 원격 경로
pt: Caminho Remoto
pt_br: Caminho remoto
ru: Удаленный путь
tr: Uzak Yol
zh_cn: 远程路径
zh_tw: 遠端路徑

# UseAnonymousLoginDescription
source: When this box is checked, the username and password fields are ignored, and a standard anonymous user is used instead.
de: Wenn dieses Kontrollkästchen aktiviert ist, werden die Felder „Benutzername“ und „Kennwort“ ignoriert, und stattdessen wird ein anonymer Standardbenutzer verwendet.
es: Cuando se marca esta casilla, se omiten los campos de nombre de usuario y contraseña y se utiliza un usuario anónimo estándar en su lugar.
fr: Lorsque cette case est cochée, les champs nom d’utilisateur et mot de passe sont ignorés, et un utilisateur anonyme standard est utilisé à la place.
ja: このチェックボックスをオンにすると、ユーザー名とパスワード フィールドが無視され、代わりに標準の匿名ユーザーが使用されます。
ko: 이 상자를 선택하면, 사용자 이름 및 암호 필드가 무시되고 표준 익명 사용자가 대신 사용됩니다.
pt: Quando esta caixa está selecionada, os campos de nome de utilizador e palavra-passe são ignorados e, em alternativa, é utilizado um utilizador anónimo padrão.
pt_br: Quando esta caixa está marcada, os campos de nome de usuário e senha são ignorados, e um usuário anônimo padrão é usado.
ru: Если установлен этот флажок, поля с именем пользователя и паролем игнорируются, а вместо этого используется стандартный анонимный пользователь.
tr: Bu kutu işaretlendiğinde kullanıcı adı ve parola alanları yok sayılır ve bunun yerine standart bir anonim kullanıcı kullanılır.
zh_cn: 选中此复选框时，将忽略用户名和密码字段，并改用标准匿名用户。
zh_tw: 勾選此方塊時，將忽略使用者名稱和密碼欄位，並改用標準匿名使用者。

# UsernameDescription
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
ja: ユーザー名です
ko: 사용자 이름
pt: Nome de utilizador
pt_br: Nome de Usuário
ru: Пользователь
tr: Kullanıcı adı
zh_cn: 用户名
zh_tw: 使用者名稱

# ValidationError_ValidateParentError
source: Activity is valid only inside {0}
de: Aktivität ist nur innerhalb von {0} gültig.
es: La actividad es válida solo dentro de {0}
fr: L’activité est uniquement valide à l’intérieur de {0}
ja: アクティビティは、[{0}] の内部でのみ有効です。
ko: 액티비티는 {0} 내에서만 유효합니다.
pt: A atividade só é válida dentro de {0}
pt_br: A atividade só é válida em {0}
ru: Действие допустимо только внутри {0}
tr: Etkinlik sadece {0} içinde geçerlidir
zh_cn: 活动仅在“{0}”内有效
zh_tw: 活動僅在 {0} 內有效

source: Common
de: Allgemein
es: Común
fr: Courant
ja: 共通
ko: 공통
pt: Comum
pt_br: Comum
ru: Общие
tr: Ortak
zh_cn: 常见
zh_tw: 常見

# Activity_WithFtpSession_Property_DisplayName_Name
source: FTP Session Scope
de: Scope der FTP-Sitzung
es: Alcance de la sesión FTP
fr: Portée de la session FTP
ja: FTP セッション スコープ
ko: FTP 세션 범위
pt: Âmbito da Sessão de FTP
pt_br: Escopo da sessão do FTP
ru: Область действия сеанса FTP
tr: FTP Oturum Kapsamı
zh_cn: FTP 会话作用域
zh_tw: FTP 工作階段範圍

# Activity_Delete_Description
source: Removes a specified file from an FTP server. This activity only works if it is placed inside a With FTP Session scope activity.
de: Entfernt eine angegebene Datei von einem FTP-Server. Diese Aktivität funktioniert nur, wenn sie innerhalb einer Scope-Aktivität vom Typ „With FTP Session“ platziert wird.
es: Elimina un archivo especificado de un servidor FTP. Esta actividad solo funciona si se coloca dentro de una actividad en el ámbito de una sesión FTP.
fr: Supprime un fichier spécifié d’un serveur FTP. Cette activité ne fonctionne que si elle est placée à l’intérieur d’une activité d’étendue With FTP Session (Session avec FTP).
ja: 指定したファイルを FTP サーバーから削除します。このアクティビティは、[FTP セッションを使用] スコープ アクティビティ内に配置した場合にのみ動作します。(Delete)
ko: 지정된 파일을 FTP 서버에서 제거합니다. 이 액티비티는 With FTP Session 범위 액티비티 내에 있는 경우에만 작동합니다.
pt: Remove um ficheiro especificado de um servidor FTP. Esta atividade só funciona se for colocada dentro de uma atividade de âmbito With FTP Session.
pt_br: Remove um arquivo especificado de um servidor FTP. A atividade só funciona se for colocada em uma atividade do escopo With FTP Session.
ru: Удаляет указанный файл с FTP-сервера. Это действие работает только в том случае, если оно помещено в действие области With FTP Session.
tr: Bir FTP sunucusundan belirtilen bir dosyayı kaldırır. Bu etkinlik yalnızca bir FTP Oturumu kapsam etkinliğinin içine yerleştirilmişse çalışır.
zh_cn: 从 FTP 服务器中删除指定文件。仅当此活动置于“使用 FTP 会话”作用域活动中时才能正常工作。
zh_tw: 從 FTP 伺服器中移除指定檔案。僅當此活動置於「使用 FTP 工作階段」範圍活動中時才能正常工作。

# Activity_Delete_Name
source: Delete
de: Delete file or folder
es: Eliminar
fr: Supprimer le fichier/dossier
ja: 削除
pt: Delete file or folder
pt_br: Delete file or folder
tr: Delete file or folder
zh_cn: 删除
zh_tw: 刪除檔案或資料夾

# Activity_Delete_Property_RemotePath_Description
source: The path of the file that is to be removed from the FTP server.
de: Remotepfad zur Datei oder zum Ordner
es: La ruta del archivo que se eliminará del servidor FTP.
fr: Chemin d'accès distant au fichier ou dossier
ja: FTP サーバーから削除するファイルのパスです。
ko: FTP 서버에서 제거할 파일의 경로입니다.
pt: Remover o caminho para o ficheiro ou pasta
pt_br: Caminho remoto para o arquivo ou pasta
ru: Путь к файлу, который должен быть удален с FTP-сервера.
tr: Dosya veya klasörün uzak yolu
zh_cn: 要从 FTP 服务器中删除的文件的路径。
zh_tw: 檔案或資料夾的遠端路徑

# Activity_Delete_Property_RemotePath_Name
source: Remote Path
de: Zu löschende(r) Datei oder Ordner
es: Ruta remota
fr: Fichier ou dossier à supprimer
ja: リモート パス
pt: File or folder to delete
pt_br: Arquivo ou pasta a excluir
tr: Silinecek dosya veya klasör
zh_cn: 远程路径
zh_tw: 要刪除的檔案或資料夾

# Activity_DirectoryExists_Description
source: Checks whether a certain directory exists on an FTP server. This activity only works if it is placed inside a With FTP Session scope activity.
de: Prüft, ob ein bestimmtes Verzeichnis auf einem FTP-Server vorhanden ist. Diese Aktivität funktioniert nur, wenn sie innerhalb einer Scope-Aktivität vom Typ „With FTP Session“ platziert wird.
es: Comprueba si un directorio determinado existe en un servidor FTP. Esta actividad solo funciona si se coloca dentro de una actividad en el ámbito de una sesión FTP.
fr: Vérifie si un certain répertoire existe sur un serveur FTP. Cette activité ne fonctionne que si elle est placée à l’intérieur d’une activité d’étendue With FTP Session (Session avec FTP).
ja: FTP サーバーに特定のディレクトリが存在するかどうかを確認します。このアクティビティは、[FTP セッションを使用] スコープ アクティビティ内に配置した場合にのみ動作します。(Directory Exists)
ko: FTP 서버에 특정 디렉터리가 있는지 확인합니다. 이 액티비티는 With FTP Session 범위 액티비티 내에 있는 경우에만 작동합니다.
pt: Verifica se um determinado diretório existe num servidor FTP. Esta atividade só funciona se for colocada dentro de uma atividade de âmbito With FTP Session.
pt_br: Verifica se um determinado diretório existe em um servidor FTP. A atividade só funciona se for colocada em uma atividade do escopo With FTP Session.
ru: Проверяет, существует ли определенный каталог на FTP-сервере. Это действие работает только в том случае, если оно помещено в действие области With FTP Session.
tr: Bir FTP sunucusunda belirli bir dizinin var olup olmadığını denetler. Bu etkinlik yalnızca bir FTP Oturumu kapsam etkinliğinin içine yerleştirilmişse çalışır.
zh_cn: 检查 FTP 服务器上是否存在某个目录。仅当此活动置于“使用 FTP 会话”作用域活动中时才能正常工作。
zh_tw: 檢查 FTP 伺服器上是否存在某個目錄。僅當此活動置於「使用 FTP 工作階段」範圍活動中時才能正常工作。

# Activity_DirectoryExists_Name
source: Directory Exists
es: El directorio existe
fr: Répertoire existant
ja: ディレクトリの存在を確認
zh_cn: 目录存在
zh_tw: 目錄存在

# Activity_DirectoryExists_Property_Exists_Description
source: A boolean variable that states whether the indicated directory was found or not.
de: Eine boolesche Variable, die angibt, ob das angegebene Verzeichnis gefunden wurde oder nicht.
es: Una variable booleana que indica si se ha encontrado o no el directorio indicado.
fr: Variable booléenne indiquant si le répertoire indiqué a été trouvé ou non.
ja: 指定したディレクトリが検出されたかどうかを示す Boolean 型変数です。
ko: 표시된 디렉터리를 찾았는지 여부를 나타내는 부울 변수입니다.
pt: Uma variável booleana que declara se o diretório indicado foi ou não encontrado.
pt_br: Uma variável booleana que indica se o diretório apontado foi encontrado ou não.
ru: Логическая переменная, показывающая, найден указанный каталог или нет.
tr: Belirtilen dizinin bulunup bulunmadığını belirten bir boole değişkeni.
zh_cn: 此为“布尔值”变量，用于表明是否已找到指定目录。
zh_tw: 此為「布林值」變數，用於表示是否已找到指定目錄。

# Activity_DirectoryExists_Property_Exists_Name
source: Exists
de: IstVorhanden
es: Existente
fr: Existe
ja: 存在の有無
pt_br: Existe
tr: Var
zh_cn: 存在
zh_tw: 存在
