Repository: UiPath/Community.Activities
Catalog: Activities/FTP/UiPath.FTP.Activities/Properties/UiPath.FTP.Activities.*.resx
Languages: de, es, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# Activity_DirectoryExists_Property_RemotePath_Description
source: The path of the FTP directory in which to check whether the indicated directory exists.
de: Der zu prüfende Remoteordnerpfad.
es: La ruta del directorio FTP donde se va a comprobar si existe el directorio indicado.
fr: Chemin d'accès distant au dossier à vérifier
ja: 指定したディレクトリが存在するかどうかを確認する FTP ディレクトリのパスです。
ko: 표시된 디렉터리가 있는지 확인할 FTP 디렉터리의 경로입니다.
pt: Caminho para a pasta remota a verificar
pt_br: A pasta remota a ser verificada
ru: Путь к каталогу FTP, для которого нужно проверить, существует ли указанный каталог.
tr: Kontrol edilecek uzak klasör yolu
zh_cn: 要在其中查看是否存在指定目录的 FTP 目录路径。
zh_tw: 要檢查的遠端資料夾路徑

# Activity_DirectoryExists_Property_RemotePath_Name
source: Remote Path
de: Ordnerpfad
es: Ruta remota
fr: Chemin d'accès au dossier
ja: リモート パス
pt: Folder Path
pt_br: Caminho da Pasta
tr: Klasör Yolu
zh_cn: 远程路径
zh_tw: 資料夾路徑

# Activity_EnumerateObjects_Description
source: Generates a DataTable variable that contains a list comprising the files found at the specified FTP server path. Subfolders can also be included in the search by checking the Includes subfolders box. This activity only works if it is placed inside a With FTP Session scope activity.
de: Generiert eine Sammlung von Dateien, die auf dem angegebenen FTP-Server gefunden wurden. Unterordner können durch Aktivieren des Kontrollkästchens „Unterordner einschließen“ in die Suche einbezogen werden. Diese Aktivität funktioniert nur, wenn sie innerhalb einer Scope-Aktivität vom Typ „With FTP Session“ platziert wird.
es: Genera una variable TablaDeDatos que contiene una lista que abarca los archivos encontrados en la ruta del servidor FTP especificada. Las subcarpetas también se pueden incluir en la búsqueda marcando la casilla Incluir subcarpetas. Esta actividad solo funciona si se coloca dentro de una actividad en el ámbito de una sesión FTP.
fr: Generates a collection of files that have been found on the FTP server. Subfolders can also be included in the search by checking the Includes subfolders box. This activity only works if it is placed inside a With FTP Session scope activity.
ja: FTP サーバー上で見つかったファイルのコレクションを生成します。[サブフォルダーを含む] チェックボックスをオンにして、検索対象にサブフォルダーを含めることもできます。このアクティビティは、[FTP セッションを使用] スコープ アクティビティ内に配置した場合にのみ動作します。(Enumerate Objects)
ko: 지정된 FTP 서버 경로에서 발견된 파일로 구성된 목록을 포함하는 DataTable 변수를 생성합니다. 하위 폴더 포함 확인란을 선택하여 하위 폴더를 검색에 포함할 수도 있습니다. 이 액티비티는 With FTP Session 범위 액티비티 내에 있는 경우에만 작동합니다.
pt: Gera uma coleção dos ficheiros que foram encontrados no servidor FTP. As subpastas podem ser também incluídas na pesquisa, marcando a caixa Incluir subpastas. Esta atividade só funciona se for colocada dentro de uma atividade de âmbito With FTP Session.
pt_br: Gera um conjunto de arquivos que foram encontrados no servidor FTP. Para também incluir subpastas na pesquisa, marque a caixa "Inclui subpastas". Esta atividade só funciona se for colocada em uma atividade do escopo "Com a Sessão do FTP".
ru: Создает переменную DataTable, содержащую список файлов, найденных по указанному пути на FTP-сервере. Вложенные папки также можно включить в поиск, установив флажок для включения вложенных папок. Это действие работает только в том случае, если оно помещено в действие области With FTP Session.
tr: FTP sunucusunda bulunan bir dosya koleksiyonu oluşturur. Alt klasörleri dahil et kutusu işaretlenerek alt klasörler de aramaya dahil edilebilir. Bu etkinlik yalnızca bir FTP Oturumu kapsam etkinliğinin içine yerleştirilmişse çalışır.
zh_cn: 生成一个文件集合，其中的文件是在 FTP 服务器上找到的文件。选中“包括子文件夹”复选框后，搜索结果中也会包含子文件夹。仅当此活动置于“使用 FTP 会话”作用域活动中时才能正常工作。
zh_tw: 產生一個檔案集合，其中的檔案是在 FTP 伺服器上找到的檔案。勾選「包括子資料夾」方塊後，搜尋結果中也會包含子資料夾。僅當此活動置於「使用 FTP 工作階段」範圍活動中時才能正常工作。

# Activity_EnumerateObjects_Name
source: Enumerate Objects
es: Enumerar objetos
ja: オブジェクトを列挙
zh_cn: 枚举对象
zh_tw: 列舉對象

# Activity_EnumerateObjects_Property_Files_Description
source: A collection of files that have been found on the FTP server.
de: Eine Sammlung von Dateien, die auf dem FTP-Server gefunden wurden.
es: Una colección de archivos que se han encontrado en el servidor FTP.
fr: Une collection de fichiers qui ont été trouvés sur le serveur FTP.
ja: FTP サーバー上で見つかったファイルのコレクションです。
ko: FTP 서버에서 발견된 파일의 컬렉션입니다.
pt: Uma coleção dos ficheiros que foram encontrados no servidor FTP.
pt_br: Uma coleção de arquivos que foram encontrados no servidor FTP.
ru: Коллекция файлов, найденных на FTP-сервере.
tr: FTP sunucusunda bulunan dosya koleksiyonu.
zh_cn: 已在 FTP 服务器上找到文件的集合。
zh_tw: 已在 FTP 伺服器上找到檔案的集合。

# Activity_EnumerateObjects_Property_Files_Name
source: Files
de: Dateien
es: Archivos
fr: Fichiers
ja: ファイル
pt_br: Arquivos
tr: Dosyalar
zh_cn: 文件
zh_tw: 檔案

# Activity_EnumerateObjects_Property_Recursive_Description
source: If this check box is selected, the subfolders are also included in the enumeration of the files on the FTP server.
de: Wenn dieses Kontrollkästchen aktiviert ist, werden auch die Unterordner in die Aufzählung der Dateien auf dem FTP-Server aufgenommen.
es: Si esta casilla está seleccionada, también se incluirán las subcarpetas en la enumeración de los archivos en el servidor FTP.
fr: Si cette case est cochée, les sous-dossiers sont également inclus dans l’énumération des fichiers sur le serveur FTP.
ja: このチェック ボックスがオンの場合、FTP サーバー上のファイルの列挙にサブフォルダーも含まれます。
ko: 이 확인란을 선택하면 하위 폴더도 FTP 서버에 있는 파일의 열거에 포함됩니다.
pt: Se esta caixa de verificação estiver selecionada, as subpastas também são incluídas na enumeração dos ficheiros no servidor FTP.
pt_br: Se esta caixa for marcada, as subpastas também serão incluídas na enumeração de arquivos em um servidor FTP.
ru: Если этот флажок установлен, вложенные папки также включаются в перечисление файлов на FTP-сервере.
tr: Bu onay kutusu seçilirse alt klasörler de FTP sunucusundaki dosya numaralandırılma işlemine dahil edilir.
zh_cn: 如果选中此复选框，FTP 服务器上的文件枚举也将包含子文件夹。
zh_tw: 如果勾選此方塊，FTP 伺服器上的檔案列舉也將包含子資料夾。

# Activity_EnumerateObjects_Property_Recursive_Name
source: Include subfolders
de: Unterordner einbeziehen
es: Incluir subcarpetas
fr: Inclure les sous-dossiers
ja: サブフォルダーを含む
pt_br: Incluir subpastas
tr: Alt klasörleri dahil et
zh_cn: 包括子文件夹
zh_tw: 包括子資料夾

# Activity_EnumerateObjects_Property_RemotePath_Description
source: The path of the directory on the FTP server whose files are to be enumerated.
de: Der Pfad des Verzeichnisses auf dem FTP-Server, dessen Dateien aufgelistet werden sollen.
es: La ruta del directorio en el servidor FTP cuyos archivos van a enumerarse.
fr: Le chemin du répertoire du serveur FTP dont les fichiers doivent être énumérés.
ja: FTP サーバー上で列挙するファイルのディレクトリのパスです。
ko: 파일을 열거할 FTP 서버의 디렉터리 경로입니다.
pt: O caminho do diretório no servidor FTP cujos ficheiros serão enumerados.
pt_br: O caminho do diretório no servidor FTP cujos arquivos devem ser enumerados.
ru: Путь к каталогу на FTP-сервере, файлы из которого необходимо пронумеровать.
tr: Dosyaların numaralandırılacağı FTP sunucusundaki dizinin yolu.
zh_cn: FTP 服务器上要对其文件进行枚举的目录的路径。
zh_tw: FTP 伺服器上要對其檔案進行列舉的目錄的路徑。

# Activity_EnumerateObjects_Property_RemotePath_Name
source: Remote Path
de: Remotepfad
es: Ruta remota
fr: Chemin distant
ja: リモート パス
pt_br: Caminho Remoto
tr: Uzak Yol
zh_cn: 远程路径
zh_tw: 遠端路徑

# Activity_FileExists_Description
source: Checks whether a certain file exists in the specified FTP directory. This activity only works if it is placed inside a With FTP Session scope activity.
de: Prüft, ob eine bestimmte Datei im angegebenen FTP-Verzeichnis vorhanden ist. Diese Aktivität funktioniert nur, wenn sie innerhalb einer Scope-Aktivität vom Typ „With FTP Session“ platziert wird.
es: Comprueba si un archivo determinado existe en el directorio FTP especificado. Esta actividad solo funciona si se coloca dentro de una actividad en el ámbito de una sesión FTP.
fr: Vérifie si un certain fichier existe dans le répertoire FTP spécifié. Cette activité ne fonctionne que si elle est placée à l’intérieur d’une activité d’étendue With FTP Session (Session avec FTP).
ja: 指定した FTP ディレクトリ内に特定のファイルが存在するかどうかを確認します。このアクティビティは、[FTP セッションを使用] スコープ アクティビティ内に配置した場合にのみ動作します。(File Exists)
ko: 지정된 FTP 디렉터리에 특정 파일이 있는지 확인합니다. 이 액티비티는 With FTP Session 범위 액티비티 내에 있는 경우에만 작동합니다.
pt: Verifica se um determinado ficheiro existe no diretório FTP especificado. Esta atividade só funciona se for colocada dentro de uma atividade de âmbito With FTP Session.
pt_br: Verifica se um determinado arquivo existe em um diretório FTP especificado. A atividade só funciona se for colocada em uma atividade do escopo With FTP Session.
ru: Проверяет, существует ли определенный файл в указанном каталоге FTP. Это действие работает только в том случае, если оно помещено в действие области With FTP Session.
tr: Belirtilen FTP dizininde belirli bir dosyanın var olup olmadığını denetler. Bu etkinlik yalnızca bir FTP Oturumu kapsam etkinliğinin içine yerleştirilmişse çalışır.
zh_cn: 检查指定 FTP 目录中是否存在特定文件。仅当此活动置于“使用 FTP 会话”作用域活动中时才能正常工作。
zh_tw: 檢查指定 FTP 目錄中是否存在特定檔案。僅當此活動置於「使用 FTP 工作階段」範圍活動中時才能正常工作。

# Activity_FileExists_Name
source: File Exists
es: El archivo existe
fr: Fichier existant
ja: ファイルの存在を確認
zh_cn: 文件存在
zh_tw: 檔案存在

# Activity_FileExists_Property_Exists_Description
source: A boolean variable that states whether the indicated file was found or not.
de: Eine boolesche Variable, die angibt, ob die angegebene Datei gefunden wurde oder nicht.
es: Una variable booleana que indica si se ha encontrado o no el archivo indicado.
fr: Variable booléenne indiquant si le fichier indiqué a été trouvé ou non.
ja: 指定したファイルが検出されたかどうかを示す Boolean 型変数です。
ko: 표시된 파일을 찾았는지 여부를 나타내는 부울 변수입니다.
pt: Uma variável booleana que declara se o ficheiro indicado foi ou não encontrado.
pt_br: Uma variável booleana que indica se o arquivo apontado foi encontrado ou não.
ru: Логическая переменная, показывающая, найден указанный файл или нет.
tr: Belirtilen dosyanın bulunup bulunmadığını belirten bir boole değişkeni.
zh_cn: 此为“布尔值”变量，用于表明是否已找到指定文件。
zh_tw: 此為「布林值」變數，用於表示是否已找到指定檔案。

# Activity_FileExists_Property_Exists_Name
source: Exists
de: IstVorhanden
es: Existente
fr: Existe
ja: 存在の有無
pt_br: Existe
tr: Var
zh_cn: 存在
zh_tw: 存在

# Activity_FileExists_Property_RemotePath_Description
source: The path of the FTP directory in which to check whether the indicated file exists.
de: Der zu prüfende Remotedateipfad.
es: La ruta del directorio FTP en el se va a comprobar si existe el archivo indicado.
fr: Chemin d'accès au fichier à vérifier
ja: 指定したファイルが存在するかどうかを確認する FTP ディレクトリのパスです。
ko: 표시된 파일이 있는지 확인할 FTP 디렉터리의 경로입니다.
pt: Caminho para o ficheiro remoto a verificar
pt_br: O caminho do arquivo remoto a ser verificado
ru: Путь к каталогу FTP, для которого нужно проверить, существует ли указанный файл.
tr: Kontrol edilecek uzak dosya yolu
zh_cn: 此为要在其中查看是否存在指定文件的 FTP 目录路径。
zh_tw: 要檢查的遠端檔案路徑

# Activity_FileExists_Property_RemotePath_Name
source: Remote Path
de: Dateipfad
es: Ruta remota
fr: Chemin du fichier
ja: リモート パス
pt: File Path
pt_br: Caminho do Arquivo
tr: Dosya Yolu
zh_cn: 远程路径
zh_tw: 檔案路徑

# Activity_UploadFiles_Description
source: Uploads a file to an FTP server. This activity only works if it is placed inside a With FTP Session scope activity.
de: Lädt eine Datei auf einen FTP-Server hoch. Diese Aktivität funktioniert nur, wenn sie innerhalb einer Scope-Aktivität vom Typ „With FTP Session scope“ platziert wird.
es: Carga un archivo a un servidor FTP. Esta actividad solo funciona si se coloca dentro de una actividad en el ámbito de una sesión FTP.
fr: Permet de charger un fichier vers un serveur FTP. Cette activité ne fonctionne que si elle est placée à l’intérieur d’une activité d’étendue With FTP Session (Session avec FTP).
ja: FTP サーバーにファイルをアップロードします。このアクティビティは、[FTP セッションを使用] スコープ アクティビティ内に配置した場合にのみ動作します。(Upload Files)
ko: FTP 서버에 파일을 업로드합니다. 이 액티비티는 With FTP Session 범위 액티비티 내에 있는 경우에만 작동합니다.
pt: Carrega um ficheiro para um servidor FTP. Esta atividade só funciona se for colocada dentro de uma atividade de âmbito With FTP Session.
pt_br: Carrega um arquivo em um servidor FTP. A atividade só funciona se for colocada em uma atividade do escopo With FTP Session.
ru: Загружает файл на FTP-сервер. Это действие работает только в том случае, если оно помещено в действие области With FTP Session.
tr: Bir FTP sunucusuna dosya yükler. Bu etkinlik yalnızca bir FTP Oturumu kapsam etkinliğinin içine yerleştirilmişse çalışır.
zh_cn: 上传文件至 FTP 服务器。仅当此活动置于“使用 FTP 会话”作用域活动中时才能正常工作。
zh_tw: 上傳檔案至 FTP 伺服器。僅當此活動置於「使用 FTP 工作階段」範圍活動中時才能正常工作。

# Activity_UploadFiles_Name
source: Upload Files
es: Cargar archivos
ja: ファイルをアップロード
zh_cn: 上传文件
zh_tw: 上傳檔案

# Activity_UploadFiles_Property_Create_Description
source: If this box is checked, the folder path will be created on the FTP server in case it does not already exist.
de: Wenn dieses Feld aktiviert ist, wird der Ordnerpfad auf dem FTP-Server erstellt, sofern er noch nicht vorhanden ist.
es: Si esta casilla está marcada, la ruta de la carpeta se creará en el servidor FTP si aún no existe.
fr: Si cette case est cochée, le chemin du dossier sera créé sur le serveur FTP s’il n’existe pas déjà.
ja: このチェックボックスをオンにすると、指定したフォルダー パスがまだ存在しない場合に、そのパスが FTP サーバー上に作成されます。
ko: 이 확인란을 선택하면 아직 없는 경우 폴더 경로가 FTP 서버에 생성됩니다.
pt: Se esta caixa for marcada, o caminho da pasta será criado no servidor FTP, se ainda não existir.
pt_br: Se a caixa estiver marcada, o caminho da pasta será criado no servidor FTP caso ele ainda não exista.
ru: Если этот флажок установлен, путь к папке будет создан на FTP-сервере, если он еще не существует.
tr: Bu kutu işaretlenirse, FTP sunucusunda klasör yolu yoksa oluşturulur.
zh_cn: 如果选中此复选框，则会在文件夹路径尚不存在的情况下在 FTP 服务器上加以创建。
zh_tw: 如果勾選此方塊，則會在資料夾路徑尚不存在的情況下在 FTP 伺服器上加以建立。

# Activity_UploadFiles_Property_Create_Name
source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
pt_br: Criar
tr: Oluştur
zh_cn: 创建
zh_tw: 建立

# Activity_UploadFiles_Property_LocalPath_Description
source: The local path of the files that are to be uploaded.
de: Lokaler Pfad
es: La ruta local de los archivos que se van a cargar.
fr: Chemin d’accès local
ja: アップロードするファイルのローカル パスです。
ko: 업로드할 파일의 로컬 경로입니다.
pt: Caminho local
pt_br: Caminho local
ru: Локальный путь к файлам, которые должны быть загружены.
tr: Yerel yol
zh_cn: 要上传的文件的本地路径。
zh_tw: 本機路徑

# Activity_UploadFiles_Property_LocalPath_Name
source: Local Path
de: Hochzuladende Dateien
es: Ruta local
fr: Fichiers à télécharger
ja: ローカル パス
pt: Files to upload
pt_br: Arquivos a carregar
tr: Yüklenecek dosyalar
zh_cn: 本地路径
zh_tw: 要上傳的檔案

# Activity_UploadFiles_Property_Overwrite_Description
source: If this box is checked, the files will be overwritten on the FTP server if they're already stored there.
de: Wenn dieses Feld aktiviert ist, werden die Dateien auf dem FTP-Server überschrieben, wenn sie bereits dort gespeichert sind.
es: Si esta casilla está marcada, los archivos se sobrescribirán en el servidor FTP si están almacenados allí.
fr: Si cette case est cochée, les fichiers seront écrasés sur le serveur FTP s’ils sont déjà stockés à cet endroit.
ja: このチェックボックスをオンにすると、指定したファイルが既に FTP サーバー上に保存されている場合は上書きされます。
ko: 이 확인란을 선택하면 FTP 서버에 이미 저장되어 있는 파일을 덮어씁니다.
pt: Se esta caixa for marcada, os ficheiros serão substituídos no servidor FTP se já estiverem armazenados nesse local.
pt_br: Se esta caixa for marcada, os arquivos serão sobrescritos no servidor FTP caso já tenham sido salvos lá.
ru: Если этот флажок установлен, файлы будут перезаписаны на FTP-сервере, если они уже там хранятся.
tr: Bu kutu işaretlenirse FTP sunucusunda depolanan dosyaların üzerine yazılır.
zh_cn: 如果选中此复选框，则 FTP 服务器上已存储的文件将被覆盖。
zh_tw: 如果勾選此方塊，則 FTP 伺服器上已儲存的檔案將被覆寫。

# Activity_UploadFiles_Property_Overwrite_Name
source: Overwrite
de: Überschreiben
es: Sobrescribir
ja: 上書き
pt_br: Substituir
tr: Üzerine yaz
zh_cn: 覆盖
zh_tw: 覆寫

# Activity_UploadFiles_Property_Recursive_Description
source: If this box is checked, the folders will be uploaded with their respective subfolders.
de: Wenn dieses Feld aktiviert ist, werden die Ordner mit ihren jeweiligen Unterordnern hochgeladen.
es: Si esta casilla está marcada, se cargarán las subcarpetas a sus respectivas carpetas.
fr: Si cette case est cochée, les dossiers seront chargés avec leurs sous-dossiers respectifs.
ja: このチェックボックスをオンにすると、フォルダーがそれぞれのサブフォルダーとともにアップロードされます。
ko: 이 확인란을 선택하면 폴더가 해당 하위 폴더와 함께 업로드됩니다.
pt: Se esta caixa for marcada, as pastas serão carregadas com as respetivas subpastas.
pt_br: Se esta caixa for marcada, as pastas serão carregadas com as respectivas subpastas.
ru: Если этот флажок установлен, папки будут загружены вместе с соответствующими вложенными папками.
tr: Bu kutu işaretlenirse klasörler ilgili alt klasörleriyle birlikte yüklenir.
zh_cn: 如果选中此复选框，则系统将上传文件夹及其各自的子文件夹。
zh_tw: 如果勾選此核取方塊，則系統將上傳資料夾及其各自的子資料夾。

# Activity_UploadFiles_Property_Recursive_Name
source: Include subfolders
de: Unterordner einbeziehen
es: Incluir subcarpetas
fr: Inclure les sous-dossiers
ja: サブフォルダーを含む
pt_br: Incluir subpastas
tr: Alt klasörleri dahil et
zh_cn: 包括子文件夹
zh_tw: 包括子資料夾

# Activity_UploadFiles_Property_RemotePath_Description
source: The path on the FTP server where the file is to be uploaded.
de: Remotepfad
es: La ruta del servidor FTP en el que se cargará el archivo.
fr: Chemin d’accès distant
ja: FTP サーバー上の、ファイルのアップロード先のパスです。
ko: 파일을 업로드할 FTP 서버의 경로입니다.
pt: Caminho remoto
pt_br: Caminho remoto
ru: Путь на FTP-сервере к местоположению, куда должен быть загружен файл.
tr: Uzak yol
zh_cn: 此为要上传的文件在 FTP 服务器上的路径。
zh_tw: 遠端路徑

# Activity_UploadFiles_Property_RemotePath_Name
source: Remote Path
de: Uploadziel
es: Ruta remota
fr: Emplacement de téléchargement
ja: リモート パス
pt: Where to upload
pt_br: Onde carregar
tr: Yüklenecek yer
zh_cn: 远程路径
zh_tw: 上傳位置

# Activity_WithFtpSession_Description
source: Connects to FTP server and provides a scope for other FTP activities.
de: Stellt eine Verbindung mit dem FTP-Server her und bietet einen Scope für andere FTP-Aktivitäten.
es: Un contenedor que administra la conexión al servidor FTP y proporciona un ámbito para todas las actividades FTP.
fr: Se connecte au serveur FTP et fournit une étendue pour d’autres activités FTP.
ja: FTP サーバーに接続し、他の FTP アクティビティのためのスコープを設定します。(FTP Scope)
ko: FTP 서버로의 연결을 처리하고 모든 FTP 액티비티에 대한 범위를 제공하는 컨테이너입니다.
pt: Estabelece a ligação ao servidor FTP e fornece um âmbito para outras atividades no FTP.
pt_br: Conecta-se ao servidor FTP e fornece um escopo para outras atividades do FTP.
ru: Подключается к серверу FTP и предоставляет область для других действий FTP.
tr: FTP sunucusuna bağlanır ve diğer FTP etkinlikleri için bir kapsam sağlar.
zh_cn: 连接到 FTP 服务器，并为其他 FTP 活动提供作用域。
zh_tw: 連接到 FTP 伺服器，並為其他 FTP 活動提供範圍。

# Activity_WithFtpSession_Name
source: FTP Scope
de: Use FTP connection
es: Con sesión Ftp
fr: Use FTP connection
ja: FTP スコープ
ko: With Ftp Session
pt: Use FTP connection
pt_br: Use FTP connection
ru: Область FTP
tr: Use FTP connection
zh_cn: FTP 作用域
zh_tw: 使用 FTP 連線

# Activity_WithFtpSession_Property_AcceptAllCertificates_Description
source: If this box is checked, all certificates will be accepted, including the ones that are expired or not verified.
de: Wenn dieses Feld aktiviert ist, werden alle Zertifikate akzeptiert, einschließlich derer, die abgelaufen oder nicht verifiziert sind.
es: Si esta casilla está marcada, se aceptarán todos los certificados, incluidos aquellos caducados o no verificados.
fr: Si cette case est cochée, tous les certificats seront acceptés, y compris ceux qui sont expirés ou non vérifiés.
ja: このチェックボックスをオンにすると、期限切れの証明書や検証されていない証明書を含め、すべての証明書が受け入れられます。
ko: 이 확인란을 선택하면 만료되거나 확인되지 않은 인증서를 포함한 모든 인증서가 수락됩니다.
pt: Se esta caixa for marcada, serão aceites todos os certificados, incluindo os expirados ou não verificados.
pt_br: Se esta caixa for marcada, todos os certificados serão aceitos, incluindo os expirados ou não verificados.
ru: Если этот флажок установлен, все сертификаты будут приняты, включая непроверенные и с истекшим сроком действия.
tr: Bu kutu işaretlenirse, süresi dolmuş veya doğrulanmamış olanlar da dahil olmak üzere tüm sertifikalar kabul edilir.
zh_cn: 如果选中此复选框，则系统将接受所有证书，包括过期或未经验证的证书。
zh_tw: 如果勾選此方塊，則系統將接受所有憑證，包括過期或未經驗證的憑證。

# Activity_WithFtpSession_Property_AcceptAllCertificates_Name
source: Accept All Certificates
de: Alle Zertifikate akzeptieren
es: Aceptar todos los certificados
fr: Accepter tous les certificats
ja: すべての証明書を受け入れる
pt_br: Aceitar Todos os Certificados
tr: Tüm Sertifikaları Kabul Et
zh_cn: 接受所有证书
zh_tw: 接受所有憑證

# Activity_WithFtpSession_Property_ClientCertificatePassword_Description
source: The password for the client certificate.
de: Das Kennwort für das Clientzertifikat.
es: La contraseña del certificado del cliente.
fr: Le mot de passe pour le certificat du client.
ja: クライアント証明書のパスワードです。
ko: 클라이언트 인증서의 암호입니다.
pt: A palavra-passe para o certificado de cliente.
pt_br: A senha do certificado do cliente.
ru: Пароль для сертификата клиента.
tr: İstemci sertifikasının parolası.
zh_cn: 客户端证书的密码。
zh_tw: 用戶端憑證的密碼。

# Activity_WithFtpSession_Property_ClientCertificatePassword_Name
source: Client Certificate Password
de: ClientzertifikatKennwort
es: Contraseña del certificado de cliente
fr: Mot de passe du certificat client
ja: クライアント証明書パスワード
pt_br: Senha do Certificado do Cliente
tr: İstemci Sertifikası Parolası
zh_cn: 客户端证书密码
zh_tw: 用戶端憑證密碼

# Activity_WithFtpSession_Property_ClientCertificatePath_Description
source: The path to the certificate used to verify the identity of the client.
de: Der Pfad zum Zertifikat, das zum Überprüfen der Identität des Clients verwendet wird.
es: La ruta al certificado utilizado para verificar la identidad del cliente.
fr: Le chemin vers le certificat utilisé pour vérifier l’identité du client.
ja: クライアントの ID を確認するために使用される証明書のパスです。
ko: 클라이언트의 ID를 확인하기 위해 사용되는 인증서의 경로입니다.
pt: O caminho para o certificado utilizado para verificar a identidade do cliente.
pt_br: O caminho do certificado usado para verificar a identidade do cliente.
ru: Путь к сертификату, используемому для проверки удостоверения клиента.
tr: İstemcinin kimliğini doğrulamak için kullanılan sertifikanın yolu.
zh_cn: 用于对客户端进行身份验证的证书的路径。
zh_tw: 用於對用戶端進行驗證的憑證的路徑。

# Activity_WithFtpSession_Property_ClientCertificatePath_Name
source: Client Certificate File
de: Clientzertifikatdatei
es: Ruta del certificado del cliente
fr: Fichier de certificat client
ja: クライアント証明書ファイル
ko: Client Certificate Path
pt_br: Arquivo do Certificado do Cliente
ru: Файл сертификата клиента
tr: İstemci Sertifikası Dosyası
zh_cn: 客户端证书文件
zh_tw: 用戶端憑證檔案

# Activity_WithFtpSession_Property_ContinueOnError_Description
source: Specifies if the automation should continue even when the activity throws an error.
de: Gibt an, ob die Automatisierung auch dann fortgesetzt werden soll, wenn die Aktivität einen Fehler auslöst.
es: Especifique si la automatización debe continuar aunque la actividad arroje un error.
fr: Précise si l’automatisation doit se poursuivre même si l’activité génère une erreur.
ja: アクティビティが例外をスローしてもオートメーションの実行を継続するかどうかを指定します。
ko: 액티비티에서 오류가 발생한 경우에도 자동화를 계속 진행해야 할지 지정합니다.
pt: Especifica se a automatização deve continuar, mesmo quando a atividade gerar um erro.
pt_br: Especifica se a automação deve continuar mesmo quando a atividade gera um erro.
ru: Указывает, должна ли автоматизация продолжаться, даже если действие вызывает ошибку.
tr: Etkinlik bir hata oluştursa bile otomasyonun devam edip etmeyeceğini belirtir.
zh_cn: 指定如果活动引发错误，是否仍应继续自动化。
zh_tw: 指定如果活動擲回錯誤，是否仍應繼續自動化。

# Activity_WithFtpSession_Property_ContinueOnError_Name
source: Continue On Error
de: Bei Fehler fortsetzen
es: Continuar en caso de error
fr: Continuer sur erreur
ja: エラー発生時に実行を継続
pt_br: Continuar com Erro
tr: Hata Olduğunda Devam Et
zh_cn: 出错时继续
zh_tw: 錯誤時繼續
