Repository: UiPath/Community.Activities
Catalog: Activities/FTP/UiPath.FTP.Activities/Properties/UiPath.FTP.Activities.*.resx
Languages: de, es, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# Activity_WithFtpSession_Property_FtpsMode_Description
source: Switches to the FTPS protocol. Choose one of the two available options: Explicit or Implicit.
de: Wechselt zum FTPS-Protokoll. Wählen Sie eine der beiden verfügbaren Optionen: Explizit oder Implizit.
es: Cambia al protocolo FTPS. Elija una de las dos opciones disponibles: explícita o implícita.
fr: Permet de passer au protocole FTPS. Choisissez l’une des deux options disponibles : Explicit (Explicite) ou Implicit (Implicite).
ja: FTPS プロトコルに切り替えます。[Explicit] または [Implicit] の 2 つのオプションのいずれかを選びます。
ko: FTPS 프로토콜로 전환합니다. 사용 가능한 두 가지 옵션인 명시적 또는 암시적 중 하나를 선택합니다.
pt: Muda para o protocolo FTPS. Escolha uma das duas opções disponíveis: Explícito ou Implícito.
pt_br: Muda para o protocolo FTPS. Escolha uma das duas opções disponíveis: Explícito ou Implícito.
ru: Переключается на протокол FTPS. Выберите один из двух доступных вариантов: Explicit или Implicit.
tr: FTPS protokolüne geçer. Var olan iki seçenekten birini seçin: Açık veya Örtük.
zh_cn: 切换至 FTPS 协议。从两个可用的选项中选择一个: 显式或隐式。
zh_tw: 切換至 FTPS 通訊協定。從兩個可用的選項中選擇一個: 明確或隱含。

# Activity_WithFtpSession_Property_FtpsMode_Name
source: FTPS Mode
de: FTPS-Modus
es: Modo FTPS
fr: Mode FTPS
ja: FTPS モード
pt_br: Modo FTPS
ru: Режим FTPS
tr: FTPS Modu
zh_cn: FTPS 模式
zh_tw: FTPS 模式

# Activity_WithFtpSession_Property_Host_Description
source: The URL of the FTP server that you want to connect to.
de: Die URL des FTP-Servers, mit dem Sie eine Verbindung herstellen möchten.
es: La URL del servidor FTP al que desea conectarse.
fr: L’URL du serveur FTP auquel vous souhaitez vous connecter.
ja: 接続先の FTP サーバーの URL です。
ko: 연결할 FTP 서버의 URL입니다.
pt: O URL do servidor FTP ao qual pretende ligar.
pt_br: A URL do servidor FTP ao qual você quer se conectar.
ru: URL-адрес FTP-сервера, к которому необходимо подключиться.
tr: Bağlanmak istediğiniz FTP sunucusunun URL'si.
zh_cn: 要连接的 FTP 服务器的 URL。
zh_tw: 要連接的 FTP 伺服器的 URL。

# Activity_WithFtpSession_Property_Host_Name
source: Host
fr: Hôte
ja: ホスト
tr: Ana Bilgisayar
zh_cn: 主机
zh_tw: 主機

# Activity_WithFtpSession_Property_Password_Description
source: The password that will be used to connect to the FTP server.
de: Das Kennwort, das zum Herstellen einer Verbindung mit dem FTP-Server verwendet wird.
es: La contraseña que se utilizará para conectarse al servidor FTP.
fr: Le mot de passe qui sera utilisé pour se connecter au serveur FTP.
ja: FTP サーバーへの接続に使用するパスワードです。
ko: FTP 서버에 연결하기 위해 사용할 암호입니다.
pt: A palavra-passe que será utilizada para ligar ao servidor FTP.
pt_br: A senha que será usada para se conectar ao servidor FTP.
ru: Пароль, который будет использоваться для подключения к FTP-серверу.
tr: FTP sunucusuna bağlanmak için kullanılacak parola.
zh_cn: 用于连接 FTP 服务器的密码。
zh_tw: 用於連接 FTP 伺服器的密碼。

# Activity_WithFtpSession_Property_Password_Name
source: Password
de: Kennwort
es: Contraseña
fr: Mot de passe
ja: パスワード
pt: Palavra-passe
pt_br: Senha
tr: Parola
zh_cn: 密码
zh_tw: 密碼

# Activity_WithFtpSession_Property_Port_Description
source: The port of the FTP server that you want to connect to.
de: Der Port des FTP-Servers, mit dem Sie eine Verbindung herstellen möchten.
es: El puerto del servidor FTP al que desea conectarse.
fr: Le port du serveur FTP auquel vous souhaitez vous connecter.
ja: 接続先の FTP サーバーのポートです。
ko: 연결할 FTP 서버의 포트입니다.
pt: A porta do servidor FTP ao qual pretende ligar.
pt_br: A porta do servidor FTP a que você quer se conectar.
ru: Порт FTP-сервера, к которому необходимо подключиться.
tr: Bağlanmak istediğiniz FTP sunucusunun bağlantı noktası.
zh_cn: 要连接的 FTP 服务器的端口。
zh_tw: 要連接的 FTP 伺服器的連接埠。

# Activity_WithFtpSession_Property_Port_Name
source: Port
es: Puerto
ja: ポート
pt: Porta
pt_br: Porta
tr: Bağlantı Noktası
zh_cn: 端口
zh_tw: 連接埠

# Activity_WithFtpSession_Property_SslProtocols_Description
source: Select the SSL protocol to be used for the FTPS connection
de: Auswählen des SSL-Protokolls, das für die FTPS-Verbindung verwendet werden soll.
es: Seleccione el protocolo SSL que se utilizará para la conexión FTPS
fr: Sélectionnez le protocole SSL à utiliser pour la connexion FTPS.
ja: FTPS 接続に使用する SSL プロトコルを選択します。
ko: FTPS 연결에 사용할 SSL 프로토콜을 선택합니다.
pt: Selecione o protocolo SSL a utilizar para a ligação FTPS
pt_br: Seleciona o protocolo SSL a ser usado para a conexão FTPS
ru: Выберите протокол SSL, который будет использоваться для подключения к FTPS
tr: FTPS bağlantısı için kullanılacak SSL protokolünü seçin
zh_cn: 选择用于 FTPS 连接的 SSL 协议
zh_tw: 選擇用於 FTPS 連線的 SSL 通訊協定

# Activity_WithFtpSession_Property_SslProtocols_Name
source: SSL Protocols
de: SSL-Protokolle
es: Protocolos SSL
fr: Protocoles SSL
ja: SSL プロトコル
pt_br: Protocolos SSL
ru: Протоколы SSL
tr: SSL Protokolleri
zh_cn: SSL 协议
zh_tw: SSL 通訊協定

# Activity_WithFtpSession_Property_UseAnonymousLogin_Description
source: When this box is checked, the username and password fields are ignored, and a standard anonymous user is used instead.
de: Wenn dieses Kontrollkästchen aktiviert ist, werden die Felder „Benutzername“ und „Kennwort“ ignoriert, und stattdessen wird ein anonymer Standardbenutzer verwendet.
es: Cuando se marca esta casilla, se omiten los campos de nombre de usuario y contraseña y se utiliza un usuario anónimo estándar en su lugar.
fr: Lorsque cette case est cochée, les champs nom d’utilisateur et mot de passe sont ignorés, et un utilisateur anonyme standard est utilisé à la place.
ja: このチェックボックスをオンにすると、[ユーザー名] と [パスワード] フィールドが無視され、代わりに標準の匿名ユーザーが使用されます。
ko: 이 상자를 선택하면, 사용자 이름 및 암호 필드가 무시되고 표준 익명 사용자가 대신 사용됩니다.
pt: Quando esta caixa está marcada, os campos de nome de utilizador e palavra-passe são ignorados e, em alternativa, é utilizado um utilizador anónimo padrão.
pt_br: Quando esta caixa está marcada, os campos de nome de usuário e senha são ignorados, e um usuário anônimo padrão é usado.
ru: Если установлен этот флажок, поля с именем пользователя и паролем игнорируются, а вместо этого используется стандартный анонимный пользователь.
tr: Bu kutu işaretlendiğinde kullanıcı adı ve parola alanları yok sayılır ve bunun yerine standart bir anonim kullanıcı kullanılır.
zh_cn: 选中此复选框时，将忽略用户名和密码字段，并改用标准匿名用户。
zh_tw: 勾選此方塊時，將忽略使用者名稱和密碼欄位，並改用標準匿名使用者。

# Activity_WithFtpSession_Property_UseAnonymousLogin_Name
source: Use Anonymous Login
de: Anonyme Anmeldung verwenden
es: Usar el inicio de sesión anónimo
fr: Utiliser la connexion anonyme
ja: 匿名ログインを使用
pt_br: Usar Login Anônimo
tr: Anonim Oturum Açmayı Kullan
zh_cn: 使用匿名登录
zh_tw: 使用匿名登入

# Activity_WithFtpSession_Property_Username_Description
source: The username that will be used to connect to the FTP server.
de: Der Benutzername, der zum Herstellen einer Verbindung mit dem FTP-Server verwendet wird.
es: El nombre de usuario que se utilizará para conectarse al servidor FTP.
fr: Le nom d’utilisateur qui sera utilisé pour se connecter au serveur FTP.
ja: FTP サーバーへの接続に使用するユーザー名です。
ko: FTP 서버에 연결하기 위해 사용할 사용자 이름입니다.
pt: O nome de utilizador que será utilizado para ligar ao servidor FTP.
pt_br: O nome de usuário que será usado para se conectar ao servidor FTP.
ru: Имя пользователя, которое будет использоваться для подключения к FTP-серверу.
tr: FTP sunucusuna bağlanmak için kullanılacak kullanıcı adı.
zh_cn: 用于连接 FTP 服务器的用户名。
zh_tw: 用於連接 FTP 伺服器的使用者名稱。

# Activity_WithFtpSession_Property_Username_Name
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
ja: ユーザー名
pt_br: Nome de Usuário
tr: Kullanıcı adı
zh_cn: 用户名
zh_tw: 使用者名稱

# Activity_WithFtpSession_Property_UseSftp_Description
source: Check this box if you want to use the SFTP transfer protocol.
de: Aktivieren Sie dieses Kontrollkästchen, wenn Sie das SFTP-Transferprotokoll verwenden möchten.
es: Marque esta casilla si desea utilizar el protocolo de transferencia SFTP.
fr: Cochez cette case si vous souhaitez utiliser le protocole de transfert SFTP.
ja: SFTP 転送プロトコルを使用する場合は、このチェックボックスをオンにします。
ko: SFTP 전송 프로토콜을 사용하려면 이 확인란을 선택합니다.
pt: Marque esta caixa se pretender utilizar o protocolo de transferência SFTP.
pt_br: Marque esta caixa se você quiser usar o protocolo de transferência SFTP.
ru: Установите этот флажок, если хотите использовать протокол передачи SFTP.
tr: SFTP aktarım protokolünü kullanmak istiyorsanız bu kutuyu işaretleyin.
zh_cn: 如果要使用 SFTP 传输协议，请选中此复选框。
zh_tw: 如果要使用 SFTP 傳輸通訊協定，請勾選此方塊。

# Activity_WithFtpSession_Property_UseSftp_Name
source: Use SFTP
de: SFTP verwenden
es: Usar SFTP
fr: Utiliser SFTP
ja: SFTP を使用
pt_br: Usar SFTP
tr: SFTP kullan
zh_cn: 使用 SFTP
zh_tw: 使用 SFTP

# Activity_DownloadFiles_Description
source: Downloads the specified files from an FTP server to the specified local folder. This activity only works if it is placed inside a With FTP Session scope activity.
de: Lädt die angegebenen Dateien von einem FTP-Server in den angegebenen lokalen Ordner herunter. Diese Aktivität funktioniert nur, wenn sie innerhalb einer Scope-Aktivität vom Typ „With FTP Session“ platziert wird.
es: Descarga los archivos especificados desde un servidor FTP a la carpeta local especificada. Esta actividad solo funciona si se coloca dentro de una actividad en el ámbito de una sesión FTP.
fr: Télécharge les fichiers spécifiés depuis un serveur FTP vers le dossier local spécifié. Cette activité ne fonctionne que si elle est placée à l’intérieur d’une activité d’étendue With FTP Session (Session avec FTP).
ja: 指定したファイルを、FTP サーバーから、指定したローカル フォルダーにダウンロードします。このアクティビティは、[FTP セッションを使用] スコープ アクティビティ内に配置した場合にのみ動作します。(Download files)
ko: 지정된 파일을 FTP 서버에서 지정된 로컬 폴더로 다운로드합니다. 이 액티비티는 With FTP Session 범위 액티비티 내에 있는 경우에만 작동합니다.
pt: Transfere os ficheiros especificados de um servidor FTP para a pasta local especificada. Esta atividade só funciona se for colocada dentro de uma atividade de âmbito With FTP Session.
pt_br: Baixa os arquivos especificados de um servidor FTP para a pasta local especificada. A atividade só funciona se for colocada em uma atividade do escopo With FTP Session.
ru: Загружает указанные файлы с FTP-сервера в указанную локальную папку. Это действие работает только в том случае, если оно помещено в действие области With FTP Session.
tr: Belirtilen dosyaları bir FTP sunucusundan belirtilen yerel klasöre indirir. Bu etkinlik yalnızca bir FTP Oturumu kapsam etkinliğinin içine yerleştirilmişse çalışır.
zh_cn: 将来自 FTP 服务器的指定文件下载至指定的本地文件夹。仅当此活动置于“使用 FTP 会话”作用域活动中时才能正常工作。
zh_tw: 將來自 FTP 伺服器的指定檔案下載至指定的本機資料夾。僅當此活動置於「使用 FTP 工作階段」範圍活動中時才能正常工作。

# Activity_DownloadFiles_Name
source: Download files
es: Descargar archivos
ja: ファイルをダウンロード
zh_cn: 下载文件
zh_tw: 下載檔案

# Activity_DownloadFiles_Property_Create_Description
source: If this box is checked, the folder path will be created locally in case it does not already exist.
de: Wenn dieses Feld aktiviert ist, wird der Ordnerpfad lokal erstellt, sofern er noch nicht vorhanden ist.
es: Si esta casilla está marcada, la ruta de la carpeta se creará de forma local si aún no existe.
fr: Si cette case est cochée, le chemin du dossier sera créé localement s’il n’existe pas déjà.
ja: このチェックボックスをオンにすると、指定したフォルダー パスがまだ存在しない場合に、そのパスがローカルに作成されます。
ko: 이 확인란을 선택하면 아직 없는 경우 폴더 경로가 로컬에 생성됩니다.
pt: Se esta caixa for marcada, o caminho da pasta será criado localmente, se ainda não existir.
pt_br: Se a caixa estiver marcada, o caminho da pasta será criado localmente caso ele ainda não exista.
ru: Если этот флажок установлен, путь к папке будет создан локально, если он еще не существует.
tr: Bu kutu işaretlendiğinde, klasör yolu yoksa yerel olarak oluşturulur.
zh_cn: 如果选中此复选框，则系统会在文件夹路径尚不存在的情况下在本地加以创建。
zh_tw: 如果勾選此方塊，則系統會在資料夾路徑尚不存在的情況下在本機加以建立。

# Activity_DownloadFiles_Property_Create_Name
source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
pt_br: Criar
tr: Oluştur
zh_cn: 创建
zh_tw: 建立

# Activity_DownloadFiles_Property_LocalPath_Description
source: The local path for the files that are to be downloaded.
de: Der lokale Pfad für die herunterzuladenden Dateien.
es: La ruta local para los archivos que van a descargarse.
fr: Le chemin d’accès local pour les fichiers qui doivent être téléchargés.
ja: ファイルのダウンロード先のローカル パスです。
ko: 다운로드할 파일의 로컬 경로입니다.
pt: O caminho local para os ficheiros a transferir.
pt_br: O caminho local dos arquivos que devem ser baixados.
ru: Локальный путь к файлам, которые необходимо загрузить.
tr: İndirilecek dosyaların yerel yolu.
zh_cn: 要下载的文件的本地路径。
zh_tw: 要下載的檔案的本機路徑。

# Activity_DownloadFiles_Property_LocalPath_Name
source: Local Path
de: Downloadziel
es: Ruta local
fr: Emplacement où télécharger
ja: ローカル パス
pt: Where to download
pt_br: Onde fazer download
tr: İndirme yeri
zh_cn: 本地路径
zh_tw: 下載位置

# Activity_DownloadFiles_Property_Overwrite_Description
source: If this box is checked, the files will be overwritten locally if they're already stored there.
de: Wenn dieses Feld aktiviert ist, werden die lokalen Dateien überschrieben, wenn sie bereits gespeichert sind.
es: Si esta casilla está marcada, los archivos se sobrescribirán de forma local si están almacenados allí.
fr: Si cette case est cochée, les fichiers seront écrasés localement s’ils sont déjà stockés à cet endroit.
ja: このチェックボックスをオンにすると、指定したファイルが既にローカルに保存されている場合は上書きされます。
ko: 이 확인란을 선택하면 로컬에 이미 저장되어 있는 파일을 덮어씁니다.
pt: Se esta caixa for marcada, os ficheiros serão substituídos localmente se já estiverem armazenados nesse local.
pt_br: Se esta caixa for marcada, os arquivos serão sobrescritos localmente caso já tenham sido salvos.
ru: Если этот флажок установлен, файлы будут перезаписаны локально, если они уже там хранятся.
tr: Bu kutu işaretlenirse yerel olarak depolanmış dosyaların üzerine yazılır.
zh_cn: 如果选中此复选框，则系统会覆盖已存储在本地的文件。
zh_tw: 如果勾選此方塊，則系統會覆寫已儲存在本機的檔案。

# Activity_DownloadFiles_Property_Overwrite_Name
source: Overwrite
de: Überschreiben
es: Sobrescribir
fr: Écraser
ja: 上書き
pt_br: Substituir
tr: Üzerine yaz
zh_cn: 覆盖
zh_tw: 覆寫

# Activity_DownloadFiles_Property_Recursive_Description
source: If this box is checked, the folders will be downloaded with their respective subfolders.
de: Wenn dieses Feld aktiviert ist, werden die Ordner mit ihren jeweiligen Unterordnern heruntergeladen.
es: Si esta casilla está marcada, se descargarán las carpetas con sus respectivas subcarpetas.
fr: Si cette case est cochée, les dossiers seront téléchargés avec leurs sous-dossiers respectifs.
ja: このチェックボックスをオンにすると、フォルダーがそれぞれのサブフォルダーとともにダウンロードされます。
ko: 이 확인란을 선택하면 폴더가 해당 하위 폴더와 함께 다운로드됩니다.
pt: Se esta caixa for marcada, as pastas serão transferidas com as respetivas subpastas.
pt_br: Se esta caixa for marcada, as pastas serão baixadas com as respectivas subpastas.
ru: Если этот флажок установлен, папки будут скачаны вместе с соответствующими вложенными папками.
tr: Bu kutu işaretlenirse klasörler ilgili alt klasörleriyle birlikte indirilir.
zh_cn: 如果选中此复选框，则系统将下载文件夹及其各自的子文件夹。
zh_tw: 如果勾選此方塊，則系統將下載資料夾及其各自的子資料夾。

# Activity_DownloadFiles_Property_Recursive_Name
source: Include subfolders
de: Unterordner einbeziehen
es: Incluir subcarpetas
fr: Inclure les sous-dossiers
ja: サブフォルダーを含む
pt_br: Incluir subpastas
tr: Alt klasörleri dahil et
zh_cn: 包括子文件夹
zh_tw: 包括子資料夾

# Activity_DownloadFiles_Property_RemotePath_Description
source: The path of the files on the FTP server that are to be downloaded.
de: Der Pfad der herunterzuladenden Dateien auf dem FTP-Server.
es: La ruta de los archivos en el servidor FTP que van a descargarse.
fr: Le chemin d’accès des fichiers sur le serveur FTP qui doivent être téléchargés.
ja: ダウンロードするファイルの FTP サーバー上のパスです。
ko: 다운로드할 FTP 서버의 파일 경로입니다.
pt: O caminho dos ficheiros no servidor FTP que serão transferidos.
pt_br: O caminho dos arquivos no servidor FTP que devem ser baixados.
ru: Путь к файлам на FTP-сервере, которые необходимо скачать.
tr: FTP sunucusunda indirilecek dosyaların yolu.
zh_cn: FTP 服务器上待下载的文件的路径。
zh_tw: FTP 伺服器上要下載的檔案的路徑。

# Activity_DownloadFiles_Property_RemotePath_Name
source: Remote Path
de: Pfad zu herunterzuladenden Dateien
es: Ruta remota
fr: Chemin des fichiers à télécharger
ja: リモート パス
pt: Path to files to download
pt_br: Caminho dos arquivos para download
tr: İndirilecek dosyaların yolu
zh_cn: 远程路径
zh_tw: 要下載的檔案的路徑

# Activity_MoveItem_Description
source: Moves an item on an FTP server to a different remote path. This activity only works if it is placed inside a With FTP
de: Verschiebt ein Element auf einem FTP-Server in einen anderen Remotepfad. Diese Aktivität funktioniert nur, wenn sie innerhalb einer „With FTP“-Aktivität platziert wird.
es: Mueve un elemento de un servidor FTP a una ruta remota diferente. Esta actividad solo funciona si se coloca dentro de un Con FTP
fr: Déplace un élément sur un serveur FTP vers un chemin distant différent. Cette activité ne fonctionne que si elle est placée à l’intérieur d’une activité With FTP (Avec FTP)
ja: FTP サーバー上の項目を別のリモート パスに移動します。このアクティビティは、[FTP セッションを使用] スコープ アクティビティ内に配置した場合にのみ動作します。(Move Item)
ko: FTP 서버의 항목을 다른 원격 경로로 이동합니다. 이 액티비티는 With FTP 내에 있는 경우에만 작동합니다.
pt: Move um item num servidor FTP para um caminho remoto diferente. Esta atividade só funciona se for colocada dentro de uma atividade With FTP Session
pt_br: Move um item em um servidor FTP para um caminho remoto diferente. Esta atividade só funciona se for colocada em uma atividade With FTP Session.
ru: Перемещает элемент на FTP-сервере по другому удаленному пути. Это действие работает только в том случае, если оно помещено в область With FTP
tr: Bir FTP sunucusundaki öğeyi farklı bir uzak yola taşır. Bu etkinlik yalnızca With bir FTP içine yerleştirildiğinde çalışır
zh_cn: 将 FTP 服务器上的项目移动到其他远程路径。This activity only works if it is placed inside a With FTP
zh_tw: 將 FTP 伺服器上的項目移動到其他遠端路徑。僅當此活動置於「使用 FTP」中時才能正常工作

# Activity_MoveItem_Name
source: Move Item
de: Move file or folder
es: Mover elemento
fr: Déplacer le fichier ou le dossier
ja: 項目を移動
pt: Move file or folder
pt_br: Move file or folder
tr: Move File/Folder
zh_cn: 移动项目
zh_tw: 移動檔案或資料夾

# Activity_MoveItem_Property_ContinueOnError_Description
source: Specifies if the automation should continue even when the activity throws an error.
de: Gibt an, ob die Automatisierung auch dann fortgesetzt werden soll, wenn die Aktivität einen Fehler auslöst.
es: Especifique si la automatización debe continuar aunque la actividad arroje un error.
fr: Précise si l’automatisation doit se poursuivre même si l’activité génère une erreur.
ja: アクティビティが例外をスローしてもオートメーションの実行を継続するかどうかを指定します。
ko: 액티비티에서 오류가 발생한 경우에도 자동화를 계속 진행해야 할지 지정합니다.
pt: Especifica se a automatização deve continuar, mesmo quando a atividade gerar um erro.
pt_br: Especifica se a automação deve continuar mesmo quando a atividade gera um erro.
ru: Указывает, должна ли автоматизация продолжаться, даже если действие вызывает ошибку.
tr: Etkinlik bir hata oluştursa bile otomasyonun devam edip etmeyeceğini belirtir.
zh_cn: 指定如果活动引发错误，是否仍应继续自动化。
zh_tw: 指定如果活動擲回錯誤，是否仍應繼續自動化。

# Activity_MoveItem_Property_ContinueOnError_Name
source: Continue On Error
de: Bei Fehler fortsetzen
es: Continuar en caso de error
fr: Continuer sur erreur
ja: エラー発生時に実行を継続
pt_br: Continuar com Erro
tr: Hata Olduğunda Devam Et
zh_cn: 出错时继续
zh_tw: 錯誤時繼續

# Activity_MoveItem_Property_NewPath_Description
source: The remote path on the FTP server where the file will be moved.
de: Der neue Pfad, zu dem das Element verschoben werden soll
es: La ruta remota del servidor FTP a la que se moverá el archivo.
fr: Le nouveau chemin vers où déplacer l'élément
ja: FTP サーバー上の、ファイルの移動先のリモート パスです。
ko: 파일을 이동할 FTP 서버의 원격 경로입니다.
pt: O novo caminho para mover o item
pt_br: O novo caminho para onde mover o item
ru: Удаленный путь на FTP-сервере к местоположению, куда должен быть перемещен файл.
tr: Öğenin taşınacağı yeni yol
zh_cn: 此为要移动的文件在 FTP 服务器上的远程路径。
zh_tw: 要將項目移動到的新路徑

# Activity_MoveItem_Property_NewPath_Name
source: New Remote Path
de: Wohin verschoben werden soll
es: Nueva ruta remota
fr: Où déplacer
ja: 新しいリモート パス
pt: Where to move
pt_br: Para onde mover
tr: Taşınacağı yer
zh_cn: 新建远程路径
zh_tw: 要移動到的位置

# Activity_MoveItem_Property_Overwrite_Description
source: If this box is checked, the files will be overwritten in the new remote directory if they're already stored there.
de: Wenn dieses Feld aktiviert ist, werden die Dateien im neuen Remote-Verzeichnis überschrieben, wenn sie bereits dort gespeichert sind.
es: Si esta casilla está marcada, los archivos se sobrescribirán en el nuevo directorio remoto si están almacenados allí.
fr: Si cette case est cochée, les fichiers seront écrasés dans le nouveau répertoire distant s’ils sont déjà stockés à cet endroit.
ja: このチェックボックスをオンにすると、指定したファイルが既に新しいリモート ディレクトリ上に保存されている場合は上書きされます。
ko: 이 확인란을 선택하면 새 원격 디렉터리에 파일이 이미 저장되어 있는 경우 해당 파일을 덮어씁니다.
pt: Se esta caixa for marcada, os ficheiros serão substituídos no novo diretório remoto se já estiverem armazenados no mesmo.
pt_br: Se esta caixa for marcada, os arquivos serão sobrescritos no servidor FTP caso já tenham sido salvos lá.
ru: Если этот флажок установлен, файлы будут перезаписаны в новом удаленном каталоге, если они уже там хранятся.
tr: Bu kutu işaretlenirse yeni uzak dizinde depolanmış dosyaların üzerine yazılır.
zh_cn: 如果选中此复选框，则新远程目录上已存储的文件将被覆盖。
zh_tw: 如果勾選此方塊，則新遠端目錄上已儲存的檔案將被覆寫。

# Activity_MoveItem_Property_Overwrite_Name
source: Overwrite
de: Überschreiben
es: Sobrescribir
fr: Écraser
ja: 上書き
pt_br: Substituir
tr: Üzerine yaz
zh_cn: 覆盖
zh_tw: 覆寫

# Activity_MoveItem_Property_RemotePath_Description
source: The remote path on the FTP server where the file is currently located.
de: Remotepfad
es: La ruta remota del servidor FTP en la que se encuentra el archivo actualmente.
fr: Chemin d’accès distant
ja: ファイルが現在存在する FTP サーバー上のリモート パスです。
ko: 파일이 현재 위치한 FTP 서버의 원격 경로입니다.
pt: Caminho remoto
pt_br: Caminho remoto
ru: Удаленный путь на FTP-сервере к текущему местоположению файла.
tr: Uzak yol
zh_cn: 此为文件当前所在的 FTP 服务器上的远程路径。
zh_tw: 遠端路徑

# Activity_MoveItem_Property_RemotePath_Name
source: Remote Path
de: Zu verschiebende(r) Datei oder Ordner
es: Ruta remota
fr: Fichier ou dossier à déplacer
ja: リモート パス
pt: File or folder to move
pt_br: Arquivo ou pasta a mover
tr: Taşınacak dosya veya klasör
zh_cn: 远程路径
zh_tw: 要移動的檔案或資料夾

# Category_Credentials_Name
source: Credentials
de: Anmeldeinformationen
es: Credenciales
fr: Identifiants
ja: 資格情報
ko: 자격 증명
pt: Credenciais
pt_br: Credenciais
tr: Kimlik Bilgileri
zh_cn: 凭据
zh_tw: 憑證

# Category_Misc_Name
source: Misc
de: Verschiedenes
es: Otros
fr: Divers
ja: その他
ko: 기타
pt: Diversos
pt_br: Diversos
tr: Çeşitli
zh_cn: 其他
zh_tw: 其他

# Category_Others_Name
source: Others
de: Sonstige
es: Otros
fr: Autres
ja: その他
ko: 기타
pt: Outros
pt_br: Outros
tr: Diğerleri
zh_cn: 其他
zh_tw: 其他

# Category_Principal_Name
source: Principal
de: Prinzipal
ja: プリンシパル
ko: 사용자
tr: Birincil
zh_cn: 主体
zh_tw: 主體

# Category_Security_Name
source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité
ja: セキュリティ
ko: 보안
pt: Segurança
pt_br: Segurança
tr: Güvenlik
zh_cn: 安全性
zh_tw: 安全性

# Category_Server_Name
source: Server
es: Servidor
ja: サーバー
ko: 서버
pt: Servidor
pt_br: Servidor
tr: Sunucu
zh_cn: 服务器
zh_tw: 伺服器
