Repository: UiPath/Community.Activities
Catalog: Activities/Cryptography/UiPath.Cryptography.Activities/Properties/UiPath.Cryptography.Activities.*.resx
Languages: de, es, fr, ja, pt_br, ru, tr, zh_cn, zh_tw

# FipsComplianceWarning
source: The selected algorithm does not have a FIPS compliant implementation. This might not work on some machines.
de: Der ausgewählte Algorithmus verfügt nicht über eine FIPS-konforme Implementierung. Auf einigen Maschinen funktioniert dies möglicherweise nicht.
es: El algoritmo seleccionado no tiene una implementación compatible con FIPS. Es posible que esto no funcione en algunas máquinas.
fr: L’algorithme sélectionné n’est pas compatible pour une implémentation FIPS. Il est possible qu’il ne fonctionne pas sur certaines machines.
ja: 選択したアルゴリズムは FIPS に準拠していません。これは、一部のマシン上では動作しない可能性があります。
pt_br: O algoritmo selecionado não possui uma implementação compatível com FIPS. Isso pode não funcionar em algumas máquinas.
ru: Выбранный алгоритм не имеет реализации соответствия требованиям FIPS. На некоторых компьютерах это может не работать.
tr: Seçili algoritmanın FIPS uyumlu bir uygulaması yok. Bu, bazı makinelerde çalışmayabilir.
zh_cn: 所选算法不具有符合 FIPS 的实现。可能无法在某些计算机上工作。
zh_tw: 所選演算法沒有符合 FIPS 的實作。這可能無法在某些電腦上運作。

source: Input
de: Eingabe
es: Entrada
fr: Entrée
ja: 入力
pt_br: Entrada
ru: Ввод
tr: Giriş
zh_cn: 输入
zh_tw: 輸入

# InputStringDisplayName
source: Text
es: Texto
fr: Texte
ja: テキスト
pt_br: Texto
ru: Текст
zh_cn: 文本
zh_tw: 文字

# FileDoesNotExistsException
source: The file does not exist.
de: Die Datei ist nicht vorhanden.
es: El archivo no existe.
fr: Le fichier n’existe pas.
ja: ファイルが存在しません。
pt_br: O arquivo não existe.
ru: Файл не существует.
tr: Dosya yok.
zh_cn: 文件不存在。
zh_tw: 此檔案不存在。

# FilePathDisplayName
source: FilePath
de: Dateipfad
es: RutaDelArchivo
fr: CheminFichier
ja: ファイル パス
pt_br: CaminhoDoArquivo
ru: ПутьКФайлу
zh_cn: 文件路径
zh_tw: 檔案路徑

# InputFilePathDisplayName
source: InputPath
de: Eingabepfad
es: RutaDeEntrada
fr: CheminEntrée
ja: 入力パス
pt_br: CaminhoDeEntrada
ru: ПутьКФайлуСВходнымиДанными
zh_cn: 输入路径
zh_tw: 輸入路徑

# OutputFilePathDisplayName
source: OutputPath
de: Ausgabepfad
es: RutaDeSalida
fr: CheminSortie
ja: 出力パス
pt_br: CaminhoDeSaída
ru: ПутьКФайлуСВыходнымиДанными
zh_cn: 输出路径
zh_tw: 輸出路徑

# FileAlreadyExistsException
source: The file already exists.
de: Datei ist bereits vorhanden.
es: El archivo ya existe.
fr: Le fichier existe déjà.
ja: ファイルが既に存在します。
pt_br: O arquivo já existe.
ru: Файл уже существует.
tr: Dosya zaten var.
zh_cn: 文件已存在。
zh_tw: 此檔案已存在。

# GenericCryptographicException
source: A cryptographic operation has failed. Please make sure you use the same algorithm and key for both encryption and decryption operations.
de: Ein kryptografischer Vorgang ist fehlgeschlagen. Stellen Sie sicher, dass Sie denselben Algorithmus und Schlüssel für Verschlüsselungs- und Entschlüsselungsvorgänge verwenden.
es: La operación criptográfica ha fallado. Asegúrese de utilizar el mismo algoritmo y clave para las operaciones de cifrado y descifrado.
fr: Une opération cryptographique a échoué. Veuillez vérifier que vous utilisez un algorithme et une clé similaires pour le chiffrement et le déchiffrement.
ja: 暗号化操作に失敗しました。暗号化と復号の両方の操作に同じアルゴリズムとキーを使用してください。
pt_br: Uma operação criptográfica falhou. Verifique se você usou o mesmo algoritmo e chave para as operações de criptografia e descriptografia.
ru: Не удалось выполнить криптографическую операцию. Обязательно используйте тот же алгоритм и ключ для операций шифрования и расшифровки.
tr: Şifreleme işlemi başarısız oldu. Lütfen hem şifreleme hem de şifre çözme işlemleri için aynı algoritmayı ve anahtarı kullandığınızdan emin olun.
zh_cn: 加密操作失败。请确保您在加密和解密操作中使用的算法和密钥相同。
zh_tw: 加密作業失敗。請確保您在加密和解密作業中使用相同的演算法和金鑰。

source: Encoding
de: Codierung
es: Codificación
fr: Encodage
ja: エンコード
pt_br: Codificação
ru: Кодировка
zh_cn: 编码
zh_tw: 編碼中

source: Key
de: Taste
es: Clave
fr: Clé
ja: キー
pt_br: Chave
ru: Ключ
tr: Anahtar
zh_cn: 键值
zh_tw: 金鑰

source: Output
de: Ausgabe
es: Salida
fr: Sortie
ja: 出力
pt_br: Saída
ru: Вывод
tr: Çıkış
zh_cn: 输出
zh_tw: 輸出

source: Common
de: Allgemein
es: Común
fr: Courant
ja: 共通
pt_br: Comum
ru: Общие
tr: Ortak
zh_cn: 常见
zh_tw: 常見

# ContinueOnErrorDisplayName
source: ContinueOnError
es: ContinuarEnCasoDeError
fr: ContinuerSurErreur
ja: エラー発生時に実行を継続
pt_br: ContinuarComErro
ru: ПродолжитьПриОшибке
zh_cn: 出错时继续
zh_tw: 錯誤時繼續

# MacTripleDesKeySizeWarning
source: MACTripleDES uses a key that is 16 or 24 bytes long. The length of your key depends on the Encoding.
de: MACTripleDES verwendet einen Schlüssel, der 16 oder 24 Byte lang ist. Die Länge Ihres Schlüssels hängt von der Codierung ab.
es: MACTripleDES utiliza una clave de 16 o 24 bytes de longitud. La longitud de la clave depende de la codificación.
fr: MACTripleDES utilise une clé d’une longueur de 16 ou 24 octets. La longueur de votre clé dépend de l’encodage.
ja: MACTripleDES は長さが 16 または 24 バイトのキーを使用します。キーの長さは、エンコードによって異なります。
pt_br: MACTripleDES usa uma chave de 16 ou 24 bytes. O tamanho da sua chave depende da Codificação.
ru: MACTripleDES использует ключ длиной 16 байт или 24 байта. Длина вашего ключа зависит от кодировки.
tr: MACTripleDES, 16 veya 24 bayt uzunluğunda bir anahtar kullanır. Anahtarınızın uzunluğu Kodlama'ya bağlıdır.
zh_cn: MACTripleDES 使用的密钥长度为 16 或 24 字节。密钥长度取决于编码。
zh_tw: MACTripleDES 使用的金鑰長度為 16 或 24 位元組。金鑰長度取決於編碼。

source: KeySecureString
es: Clave SecureString
ja: キー (SecureString)
zh_cn: 密钥安全字符串
zh_tw: 金鑰安全字串

# KeySecureStringDisplayName
source: Key Secure String
de: Sichere Schlüsselzeichenfolge
es: Clave SecureString
ja: キー (SecureString)
pt_br: String de Chave Segura
ru: Ключ защищенной строки
tr: Güvenli Dize Anahtarı
zh_cn: 密钥安全字符串
zh_tw: 金鑰安全字串

# Activity_DecryptFile_Description
source: Decrypts a file based on a specified key encoding and algorithm.
de: Entschlüsselt Dateien basierend auf einer angegebenen Schlüsselverschlüsselung und einem Algorithmus.
es: Descifra un archivo basándose en una codificación de clave y un algoritmo especificados.
fr: Déchiffre un fichier, selon un algorithme et un encodage de clé spécifiés.
ja: 指定したキーのエンコードとアルゴリズムに基づき、ファイルを復号します。(Decrypt File)
pt_br: Descriptografa um arquivo com base em um algoritmo e uma codificação de chave especificada.
ru: Дешифрует файл, основываясь на указанном кодировании ключа и алгоритме.
tr: Belirtilen bir anahtar kodlamasına ve algoritmaya göre bir dosyanın şifresini çözer.
zh_cn: 根据指定的密钥编码和算法解密文件。
zh_tw: 根據指定的金鑰編碼和演算法解密檔案。

# Activity_DecryptFile_Name
source: Decrypt File
es: Descifrar archivo
ja: ファイルを復号
zh_cn: 解密文件
zh_tw: 解密檔案

# Activity_DecryptFile_Property_Algorithm_Description
source: A drop-down which enables you to select the decryption algorithm you want to use.
de: Eine Dropdownliste, mit der Sie den Entschlüsselungsalgorithmus auswählen können, den Sie verwenden möchten.
es: Un menú desplegable que le permite seleccionar el algoritmo de descifrado que desea utilizar.
fr: Une liste déroulante qui permet de sélectionner l'algorithme de déchiffrement que vous souhaitez utiliser.
ja: 使用する復号アルゴリズムをドロップダウン リストから選択します。
pt_br: Um menu suspenso que permite selecionar o algoritmo de descriptografia que você quer usar.
ru: Раскрывающийся список, позволяющий выбрать алгоритм расшифровки для использования.
tr: Kullanmak istediğiniz şifre çözme algoritmasını seçmenize olanak veren bir açılır menü.
zh_cn: 下拉菜单，用于选择要使用的解密算法。
zh_tw: 下拉式功能表，用於選取要使用的解密演算法。

# Activity_DecryptFile_Property_Algorithm_Name
source: Algorithm
de: Algorithmus
es: Algoritmo
fr: Algorithme
ja: アルゴリズム
pt_br: Algoritmo
ru: Алгоритм
tr: Algoritma
zh_cn: 算法
zh_tw: 演算法

# Activity_DecryptFile_Property_ContinueOnError_Description
source: Specifies if the automation should continue even when the activity throws an error.
de: Gibt an, ob die Automatisierung auch dann fortgesetzt werden soll, wenn die Aktivität einen Fehler auslöst.
es: Especifique si la automatización debe continuar aunque la actividad arroje un error.
fr: Précise si l’automatisation doit se poursuivre même si l’activité génère une erreur.
ja: アクティビティが例外をスローしてもオートメーションの実行を継続するかどうかを指定します。
pt_br: Especifica se a automação deve continuar mesmo quando a atividade gera um erro.
ru: Указывает, должна ли автоматизация продолжаться, даже если действие вызывает ошибку.
tr: Etkinlik bir hata oluştursa bile otomasyonun devam edip etmeyeceğini belirtir.
zh_cn: 指定如果活动引发错误，是否仍应继续自动化。
zh_tw: 指定即使活動擲回錯誤，是否仍應繼續進行自動化。

# Activity_DecryptFile_Property_ContinueOnError_Name
source: Continue On Error
de: Bei Fehler fortsetzen
es: Continuar en caso de error
fr: Continuer sur erreur
ja: エラー発生時に実行を継続
pt_br: Continuar com Erro
ru: Продолжить при ошибке
zh_cn: 出错时继续
zh_tw: 錯誤時繼續

# Activity_DecryptFile_Property_InputFilePath_Description
source: The path to the file that you want to decrypt.
de: Der Pfad zur Datei, die Sie entschlüsseln möchten.
es: La ruta al archivo que desea descifrar.
fr: Le chemin d'accès au fichier que vous souhaitez déchiffrer.
ja: 復号するファイルのパスです。
pt_br: O caminho do arquivo que você quer descriptografar.
ru: Путь к файлу, который необходимо расшифровать.
tr: Şifresini çözmek istediğiniz dosyanın yolu.
zh_cn: 您要解密的文件路径。
zh_tw: 您要解密的檔案的路徑。

# Activity_DecryptFile_Property_InputFilePath_Name
source: Input Path
de: Eingabepfad
es: Ruta de entrada
fr: Chemin d'entrée
ja: 入力パス
pt_br: Caminho de Entrada
ru: File path
zh_cn: 输入路径
zh_tw: 輸入路徑

# Activity_DecryptFile_Property_KeyEncoding_Description
source: The encoding used to interpret the key specified in the Key property.
de: Die Codierung, die zum Interpretieren des in der Eigenschaft „Key“ angegebenen Schlüssels verwendet wird.
es: La codificación utilizada para interpretar la clave especificada en la propiedad Key.
fr: L'encodage utilisé pour l'interprétation de la clé spécifiée dans la propriété Key.
ja: [キー] プロパティで指定したキーの解釈に使用するエンコードです。
pt_br: A codificação usada para interpretar a chave especificada na propriedade Key.
ru: Кодировка, используемая для интерпретации ключа, указанного в свойстве Key.
tr: Key özelliğinde belirtilen anahtarı yorumlamak için kullanılan kodlama.
zh_cn: 用于解释在“密钥”属性中指定密钥的编码。
zh_tw: 用於解譯在「金鑰」屬性中指定的金鑰的編碼。

# Activity_DecryptFile_Property_KeyEncoding_Name
source: Key Encoding
de: Schlüsselcodierung
es: Codificación de clave
fr: Encodage de clé
ja: キーのエンコード
pt_br: Codificação de Chave
ru: Кодировка ключей
zh_cn: 密钥编码
zh_tw: 金鑰編碼

# Activity_DecryptFile_Property_Key_Description
source: The key that you want to use to decrypt the specified file.
de: Der Schlüssel, den Sie zum Entschlüsseln der angegebenen Datei verwenden möchten.
es: La clave que desea utilizar para descifrar el archivo especificado.
fr: La clé que vous souhaitez utiliser pour le déchiffrement du fichier spécifié.
ja: 指定したファイルの復号に使用するキーです。
pt_br: A chave que você quer usar para descriptografar o arquivo especificado.
ru: Ключ, который необходимо использовать для расшифровки указанного файла.
tr: Belirtilen dosyanın şifresini çözmek için kullanmak istediğiniz anahtar.
zh_cn: 您想用于解密指定文件的密钥。
zh_tw: 您想用於解密指定檔案的金鑰。

# Activity_DecryptFile_Property_Key_Name
source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: キー
pt_br: Chave
ru: Ключ
zh_cn: 密钥
zh_tw: 金鑰

# Activity_DecryptFile_Property_OutputFilePath_Description
source: The path where you want to save the decrypted file.
de: Der Pfad, unter dem Sie die entschlüsselte Datei speichern möchten.
es: La ruta donde desea guardar el archivo descifrado.
fr: Le chemin d'accès où vous souhaitez enregistrer le fichier déchiffré.
ja: 復号するファイルの保存先のパスです。
pt_br: O caminho onde você quer salvar o arquivo descriptografado.
ru: Расположение, в котором следует сохранить расшифрованный файл.
tr: Şifresi çözülen dosyayı kaydetmek istediğiniz yol.
zh_cn: 您要保存已解密文件的路径。
zh_tw: 您要儲存解密檔案的路徑。

# Activity_DecryptFile_Property_OutputFilePath_Name
source: Output file name and location
de: Name und Speicherort der Ausgabedatei
es: Nombre y ubicación del archivo de salida
fr: Nom et emplacement du fichier de sortie
ja: 出力ファイル名と場所
pt_br: Nome e local do arquivo de saída
ru: Имя и расположение файла с выходными данными
zh_cn: 输出文件的名称和位置
zh_tw: 輸出檔的名稱和位置

# Activity_DecryptFile_Property_Overwrite_Description
source: If a file already exists at the path specified in the Output path field, selecting this check box overwrites it. If unchecked, a new file is created.
de: Wenn an dem im Feld „Ausgabepfad“ angegebenen Pfad bereits eine Datei vorhanden ist, wird sie durch Aktivieren dieses Kontrollkästchens überschrieben. Wenn diese Option deaktiviert ist, wird eine neue Datei erstellt.
es: Si ya existe un archivo en la ruta especificada en el campo Ruta de salida, al marcar esta casilla de verificación se sobrescribe. Si no se marca, se crea un nuevo archivo.
fr: Si un fichier existe déjà au chemin d'accès spécifié dans le champ Output path, cocher cette case le remplacera. Si cette case est décochée, un fichier est créé.
ja: [出力パス] フィールドで指定したパスにファイルが既に存在する場合、このチェック ボックスをオンにすると、既存のファイルが上書きされます。オフにすると、新しいファイルが作成されます。
pt_br: Se um arquivo já existe no caminho especificado no campo Caminho de saída, marcar esta caixa de seleção o substituirá. Se desmarcada, um novo arquivo será criado.
ru: Если файл уже существует в расположении, указанном в поле "Путь выходных данных", установка этого флажка перезаписывает его. Если флажок не установлен, создается новый файл.
tr: Çıkış yolu alanında belirtilen yolda bir dosya zaten varsa bu onay kutusu seçildiğinde dosyanın üzerine yazılır. İşaretlenmezse yeni bir dosya oluşturulur.
zh_cn: 如果文件已存在于“输出路径”字段所指定的路径中，选中此复选框便会覆盖该文件。如取消勾选，系统便会新建文件。
zh_tw: 如果檔案已存在於「輸出路徑」欄位中所指定的路徑，選取此核取方塊便會覆寫該檔案。若已取消勾選，則會建立新檔案。

# Activity_DecryptFile_Property_Overwrite_Name
source: Overwrite
de: Überschreiben
es: Sobrescribir
fr: Écraser
ja: 上書き
pt_br: Substituir
ru: Перезаписать
zh_cn: 覆盖
zh_tw: 覆寫

# Activity_DecryptText_Name
source: Decrypt Text
es: Descifrar texto
ja: テキストを復号
zh_cn: 解密文本
zh_tw: 解密文字

# Activity_DecryptText_Description
source: Decrypts text based on a specified key encoding and algorithm.
de: Entschlüsselt Text basierend auf einer angegebenen Schlüsselverschlüsselung und einem Algorithmus.
es: Descifra texto basándose en un algoritmo y una codificación de clave especificados.
fr: Déchiffre le texte, selon un algorithme et un encodage de clé spécifiés.
ja: 指定したキーのエンコードとアルゴリズムに基づき、テキストを復号します。(Decrypt Text)
pt_br: Descriptografa o texto com base em um algoritmo e uma codificação de chave especificada.
ru: Дешифрует текст, основываясь на указанной кодировке ключа и алгоритме.
tr: Belirtilen bir anahtar kodlamasına ve algoritmaya göre metnin şifresini çözer.
zh_cn: 根据指定的密钥编码和算法解密文本。
zh_tw: 根據指定的金鑰編碼和演算法解密文字。

# Activity_DecryptText_Property_Algorithm_Description
source: A drop-down which enables you to select the decryption algorithm you want to use.
de: Eine Dropdownliste, mit der Sie den Entschlüsselungsalgorithmus auswählen können, den Sie verwenden möchten.
es: Un menú desplegable que le permite seleccionar el algoritmo de descifrado que desea utilizar.
fr: Une liste déroulante qui permet de sélectionner l'algorithme de déchiffrement que vous souhaitez utiliser.
ja: 使用する復号アルゴリズムをドロップダウン リストから選択します。
pt_br: Um menu suspenso que permite selecionar o algoritmo de descriptografia que você quer usar.
ru: Раскрывающийся список, позволяющий выбрать алгоритм расшифровки для использования.
tr: Kullanmak istediğiniz şifre çözme algoritmasını seçmenize olanak veren bir açılır menü.
zh_cn: 下拉菜单，用于选择要使用的解密算法。
zh_tw: 下拉式功能表，用於選取要使用的解密演算法。

# Activity_DecryptText_Property_Algorithm_Name
source: Algorithm
de: Algorithmus
es: Algoritmo
fr: Algorithme
ja: アルゴリズム
pt_br: Algoritmo
ru: Алгоритм
tr: Algoritma
zh_cn: 算法
zh_tw: 演算法

# Activity_DecryptText_Property_ContinueOnError_Description
source: Specifies if the automation should continue even if the activity throws an error.
de: Gibt an, ob die Automatisierung auch dann fortgesetzt werden soll, wenn die Aktivität einen Fehler auslöst.
es: Especifique si la automatización debe continuar incluso si la actividad arroja un error.
fr: Précise si l’automatisation doit se poursuivre même si l’activité génère une erreur.
ja: アクティビティが例外をスローしてもオートメーションの実行を継続するかどうかを指定します。
pt_br: Especifica se a automação deve continuar mesmo se a atividade gera um erro.
ru: Указывает, должна ли автоматизация продолжаться, даже если действие вызывает ошибку.
tr: Etkinlik bir hata oluştursa bile otomasyonun devam edip etmeyeceğini belirtir.
zh_cn: 指定如果活动引发错误，是否仍应继续自动化。
zh_tw: 指定即使活動擲回錯誤，是否仍應繼續進行自動化。

# Activity_DecryptText_Property_ContinueOnError_Name
source: Continue On Error
de: Bei Fehler fortsetzen
es: Continuar en caso de error
fr: Continuer sur erreur
ja: エラー発生時に実行を継続
pt_br: Continuar com Erro
ru: Продолжить при ошибке
zh_cn: 出错时继续
zh_tw: 錯誤時繼續

# Activity_DecryptText_Property_Encoding_Description
source: The encoding used to interpret the input text and the key specified in the Key property.
de: Die Codierung, die zum Interpretieren des Eingabetexts und des in der Eigenschaft „Key“ angegebenen Schlüssels verwendet wird.
es: La codificación utilizada para interpretar la entrada de texto y la clave especificada en la propiedad Key.
fr: L'encodage utilisé pour l'interprétation du texte d'entrée et de la clé spécifiée dans la propriété Key.
ja: 入力テキストおよび [キー] プロパティで指定したキーの解釈に使用するエンコードです。
pt_br: A codificação usada para interpretar o texto de entrada e a chave especificada na propriedade Key.
ru: Кодировка, используемая для интерпретации вводного текста и ключа, указанного в свойстве Key.
tr: Giriş metnini ve Key özelliğinde belirtilen anahtarı yorumlamak için kullanılan kodlama.
zh_cn: 用于解释在“密钥”属性中指定的输入文本和密钥的编码。
zh_tw: 用於解譯在「金鑰」屬性中指定的輸入文字和金鑰的編碼。

# Activity_DecryptText_Property_Encoding_Name
source: Encoding
de: Codierung
es: Codificación
fr: Encodage
ja: エンコード
pt_br: Codificação
ru: Кодировка
zh_cn: 编码
zh_tw: 編碼中

# Activity_DecryptText_Property_Input_Description
source: The text that you want to decrypt.
de: Der Text, den Sie entschlüsseln möchten.
es: El texto que desea descifrar.
fr: Le texte que vous souhaitez déchiffrer.
ja: 復号するテキストです。
pt_br: O texto que você quer descriptografar.
ru: Текст, который следует расшифровать.
tr: Şifresini çözmek istediğiniz metin.
zh_cn: 您要解密的文本。
zh_tw: 您要解密的文字。

# Activity_DecryptText_Property_Input_Name
source: Text
es: Texto
fr: Texte
ja: テキスト
pt_br: Texto
ru: Текст
tr: Metin
zh_cn: 文本
zh_tw: 文字

# Activity_DecryptText_Property_Key_Description
source: The key that you want to use to decrypt the specified file.
de: Der Schlüssel, den Sie zum Entschlüsseln der angegebenen Datei verwenden möchten.
es: La clave que desea utilizar para descifrar el archivo especificado.
fr: La clé que vous souhaitez utiliser pour le déchiffrement du fichier spécifié.
ja: 指定したファイルの復号に使用するキーです。
pt_br: A chave que você quer usar para descriptografar o arquivo especificado.
ru: Ключ, который необходимо использовать для расшифровки указанного файла.
tr: Belirtilen dosyanın şifresini çözmek için kullanmak istediğiniz anahtar.
zh_cn: 您想用于解密指定文件的密钥。
zh_tw: 您想用於解密指定檔案的金鑰。

# Activity_DecryptText_Property_Key_Name
source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: キー
pt_br: Chave
ru: Ключ
zh_cn: 密钥
zh_tw: 金鑰

# Activity_DecryptText_Property_Result_Description
source: The decrypted text, stored in a String variable.
de: Der entschlüsselte Text, gespeichert in einer String-Variablen.
es: El texto descifrado, almacenado en una variable String.
fr: Le texte déchiffré, stocké dans une variable String.
ja: 復号されるテキストです。String 変数に格納されます。
pt_br: O texto descriptografado, armazenado em uma variável String.
ru: Расшифрованный текст, хранящийся в переменной String.
tr: Bir Dize değişkeninde depolanan, şifresi çözülmüş metin.
zh_cn: 储存在字符串变量的已解密文本。
zh_tw: 儲存在字串變數中的解密文字。

# Activity_DecryptText_Property_Result_Name
source: Decrypted Text
de: Entschlüsselte Text
es: Texto descifrado
fr: Texte déchiffré
ja: 復号済みのテキスト
pt_br: Texto Descriptografado
ru: Расшифрованный текст
tr: Result
zh_cn: 解密的文本
zh_tw: 解密的文字

# Activity_EncryptFile_Description
source: Encrypts a file with a key based on a specified key encoding and algorithm.
de: Verschlüsselt eine Datei mit einem Schlüssel basierend auf einer angegebenen Schlüsselverschlüsselung und einem Algorithmus.
es: Cifra un archivo con una clave basándose en una codificación de clave y un algoritmo especificados.
fr: Chiffre un fichier avec une clé, selon un algorithme et un encodage de clé spécifiés.
ja: 指定したキーのエンコードとアルゴリズムに基づき、ファイルをキーで暗号化します。(Encrypt File)
pt_br: Criptografa um arquivo com uma chave baseada em um algoritmo e uma codificação de chave especificada.
ru: Шифрует файл с помощью ключа, основываясь на указанном кодировании ключа и алгоритме.
tr: Belirtilen anahtar kodlamasına ve algoritmaya göre bir dosyayı bir anahtarla şifreler.
zh_cn: 根据指定的密钥编码和算法使用密钥加密文件。
zh_tw: 根據指定的金鑰編碼和演算法，使用金鑰加密檔案。

# Activity_EncryptFile_Name
source: Encrypt File
es: Cifrar archivo
ja: ファイルを暗号化
zh_cn: 加密文件
zh_tw: 加密檔案

# Activity_EncryptFile_Property_Algorithm_Description
source: A drop-down which enables you to select the encryption algorithm you want to use.
de: Eine Dropdownliste, mit der Sie den Verschlüsselungsalgorithmus auswählen können, den Sie verwenden möchten.
es: Un menú desplegable que le permite seleccionar el algoritmo de cifrado que desea utilizar.
fr: Une liste déroulante qui permet de sélectionner l'algorithme de chiffrement que vous souhaitez utiliser.
ja: 使用する暗号化アルゴリズムをドロップダウン リストから選択します。
pt_br: Um menu suspenso que permite selecionar o algoritmo de criptografia que você quer usar.
ru: Раскрывающийся список, позволяющий выбрать алгоритм шифрования для использования.
tr: Kullanmak istediğiniz şifre çözme algoritmasını seçmenize olanak veren bir açılır menü.
zh_cn: 下拉菜单，用于选择要使用的加密算法。
zh_tw: 下拉式功能表，用於選取要使用的加密演算法。

# Activity_EncryptFile_Property_Algorithm_Name
source: Algorithm
de: Algorithmus
es: Algoritmo
fr: Algorithme
ja: アルゴリズム
pt_br: Algoritmo
ru: Алгоритм
tr: Algortitm
zh_cn: 算法
zh_tw: 演算法

# Activity_EncryptFile_Property_InputFilePath_Description
source: The path to the file that you want to encrypt.
de: Der Pfad zur Datei, die Sie verschlüsseln möchten.
es: La ruta al archivo que desea cifrar.
fr: Le chemin d'accès au fichier que vous souhaitez chiffrer.
ja: 暗号化するファイルのパスです。
pt_br: O caminho do arquivo que você quer criptografar.
ru: Путь к файлу, который необходимо зашифровать.
tr: Şifresini çözmek istediğiniz dosyanın yolu.
zh_cn: 您要加密的文件路径。
zh_tw: 您要加密的檔案的路徑。

# Activity_EncryptFile_Property_InputFilePath_Name
source: Input Path
de: Eingabepfad
es: Ruta de entrada
fr: Chemin d'entrée
ja: 入力パス
pt_br: Caminho de Entrada
ru: File path
zh_cn: 输入路径
zh_tw: 輸入路徑

# Activity_EncryptFile_Property_Key_Description
source: The key that you want to use to encrypt the specified file.
de: Der Schlüssel, den Sie zum Verschlüsseln der angegebenen Datei verwenden möchten.
es: La clave que desea utilizar para cifrar el archivo especificado.
fr: La clé que vous souhaitez utiliser pour le chiffrement du fichier spécifié.
ja: 指定したファイルの暗号化に使用するキーです。
pt_br: A chave que você quer usar para criptografar o arquivo especificado.
ru: Ключ, который необходимо использовать для шифрования указанного файла.
tr: Belirtilen dosyanın şifresini çözmek için kullanmak istediğiniz anahtar.
zh_cn: 您想用于加密指定文件的密钥。
zh_tw: 您想用於加密指定檔案的金鑰。

# Activity_EncryptFile_Property_Key_Name
source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: キー
pt_br: Chave
ru: Ключ
zh_cn: 密钥
zh_tw: 金鑰

# Activity_DecryptFile_Property_KeySecureString_Description
source: The secure string used to decrypt the input file.
de: Die zum Entschlüsseln der Eingabedatei verwendete sichere Zeichenfolge.
es: La cadena segura utilizada para descifrar el archivo de entrada.
fr: La chaîne sécurisée utilisée pour le déchiffrement du fichier d’entrée.
ja: 入力ファイルの復号に使用する、セキュリティで保護された文字列です。
pt_br: A string segura usada para descriptografar o arquivo de entrada.
ru: Защищенная строка, используемая для расшифровки входного файла.
tr: Giriş dizesini şifrelemek için kullanılan güvenli dize.
zh_cn: 用于解密输入文件的安全字符串。
zh_tw: 用於解密輸入檔案的安全字串。
