Repository: UiPath/Community.Activities
Catalog: Activities/Cryptography/UiPath.Cryptography.Activities/Properties/UiPath.Cryptography.Activities.*.resx
Languages: de, es, fr, ja, pt_br, ru, tr, zh_cn, zh_tw

# Exception_UseOnlyFilePathOrInputResource
source: Only one of {0] and {1} should have it's arguments configured.
de: Argumente dürfen nur entweder für {{0}} oder {1} konfiguriert sein.
es: Solo uno de {{0}} y {1} debe tener sus argumentos configurados.
fr: Les arguments de {{0}} ou de {1} doivent être configurés, mais pas les deux à la fois.
ja: {{0}} または {1} のいずれか 1 つのみに引数を設定する必要があります。
pt_br: Somente uma das {{0}} e {1} deve ter seus argumentos configurados.
ru: Необходимо настроить аргументы для {{0] или {1}.
tr: {{0}} ve {1} seçeneklerinden sadece birinin bağımsız değişkenleri yapılandırılmalıdır.
zh_cn: 应只为 {{0}} 和 {1} 中的各一项配置其参数。
zh_tw: 應只為 {{0}} 和 {1} 之一配置其引數。

# Exception_UseOnlyFilesNotFolders
source: The activity only supports files, not folders.
de: Die Aktivität unterstützt nur Dateien, keine Ordner.
es: La actividad solo admite archivos, no carpetas.
fr: L'activité prend en charge des fichiers uniquement, non des dossiers.
ja: このアクティビティではファイルのみがサポートされており、フォルダーはサポートされていません。
pt_br: A atividade tem suporte somente a arquivos, não a pastas.
ru: Действие поддерживает только файлы, а не папки.
tr: Etkinlik sadece dosyaları destekler, klasörleri desteklemez.
zh_cn: 活动仅支持文件 (而非文件夹)。
zh_tw: 活動僅支援檔案，而不支援資料夾。

# Activity_EncryptFile_Property_OutputFileName_Description
source: The file name you want to use to save the encrypted file.
de: Der Dateiname, den Sie zum Speichern der verschlüsselten Datei verwenden möchten.
es: El nombre de archivo que desea utilizar para guardar el archivo cifrado.
fr: Le nom de fichier que vous souhaitez utiliser pour enregistrer le fichier chiffré.
ja: 暗号化後のファイルを保存する際に使用するファイル名です。
pt_br: O nome do arquivo que você quer usar para salvar o arquivo criptografado.
ru: Имя файла, используемого для сохранения зашифрованного файла.
zh_cn: 要用于保存加密文件的文件名。
zh_tw: 要用於儲存加密檔案的檔案名稱。

# Activity_EncryptFile_Property_OutputFileName_Name
source: Encrypted Filename
de: Verschlüsselter Dateiname
es: Nombre de archivo cifrado
fr: Nom du fichier chiffré
ja: 暗号化後のファイル名
pt_br: Nome de Arquivo Criptografado
ru: Имя зашифрованного файла
zh_cn: 加密文件名
zh_tw: 加密的檔案名稱

# Activity_DecryptFile_Property_OutputFileName_Description
source: The file name you want to use to save the decrypted file.
de: Der Dateiname, den Sie zum Speichern der entschlüsselten Datei verwenden möchten.
es: El nombre de archivo que desea utilizar para guardar el archivo descifrado.
fr: Le nom de fichier que vous souhaitez utiliser pour enregistrer le fichier déchiffré.
ja: 復号後のファイルを保存する際に使用するファイル名です。
pt_br: O nome do arquivo que você quer usar para salvar o arquivo descriptografado.
ru: Имя файла, используемого для сохранения расшифрованного файла.
zh_cn: 要用于保存解密文件的文件名。
zh_tw: 要用於儲存解密檔案的檔案名抽。

# Activity_DecryptFile_Property_OutputFileName_Name
source: Decrypted Filename
de: Entschlüsselter Dateiname
es: Nombre de archivo descifrado
fr: Nom du fichier déchiffré
ja: 復号後のファイル名
pt_br: Nome de Arquivo Descriptografado
ru: Имя расшифрованного файла
zh_cn: 解密文件名
zh_tw: 解密檔案名稱

# KeyAndSecureStringNotNull
source: The key and the secure string must not be both not null.
de: Der Schlüssel und die sichere Zeichenfolge dürfen nicht beide nicht NULL sein.
es: La clave y la cadena segura no deben ser ambas nulas.
fr: La clé et la chaîne sécurisée ne doivent pas être toutes les deux la valeur pas nulle.
ja: キーとセキュリティで保護された文字列は、両方とも null 以外にしてはなりません。
pt_br: A chave e a string segura não podem ser nulas.
ru: Ключ и защищенная строка не должны одновременно иметь не нулевое значение.
tr: Anahtar ve güvenli dizenin her ikisi de null olmamalıdır.
zh_cn: 密钥和安全字符串不可同时为非空。
zh_tw: 金鑰和安全字串不得同時為非 null。

# KeyAndSecureStringNull
source: The key and the secure string must not be both null.
de: Der Schlüssel und die sichere Zeichenfolge dürfen nicht beide NULL sein.
es: La clave y la cadena segura no deben ser ambas nulas.
fr: La clé et la chaîne sécurisée ne doivent pas être toutes les deux la valeur nulle.
ja: キーとセキュリティで保護された文字列は、両方とも null にしてはなりません。
pt_br: A chave e a string segura não podem ser nulas ao mesmo tempo.
ru: Ключ и защищенная строка не должны одновременно иметь нулевое значение.
tr: Anahtar ve güvenli dizenin her ikisi de null olmamalıdır.
zh_cn: 密钥和安全字符串不可同时为空。
zh_tw: 金鑰和安全字串不得同時為 null。
