Repository: UiPath/Community.Activities
Catalog: Activities/Cryptography/UiPath.Cryptography.Activities/Properties/UiPath.Cryptography.Activities.*.resx
Languages: de, es, fr, ja, pt_br, ru, tr, zh_cn, zh_tw

# Activity_DecryptFile_Property_KeySecureString_Name
source: Key Secure String
de: Sichere Schlüsselzeichenfolge
es: Clave SecureString
fr: Chaîne sécurisée de clé
ja: キー (SecureString)
pt_br: String Segura da Chave
ru: Ключ защищенной строки
tr: Anahtar SecureString
zh_cn: 密钥安全字符串
zh_tw: 金鑰安全字串

# Activity_DecryptText_Property_KeySecureString_Description
source: The secure string used to decrypt the input string.
de: Die zum Entschlüsseln der Eingabezeichenfolge verwendete sichere Zeichenfolge.
es: La cadena segura utilizada para descifrar la cadena de entrada.
fr: La chaîne sécurisée utilisée pour le déchiffrement de la chaîne d’entrée.
ja: 入力文字列の復号に使用する、セキュリティで保護された文字列です。
pt_br: A string segura usada para descriptografar a string de entrada.
ru: Защищенная строка, используемая для дешифрования строки ввода.
tr: Giriş dizesinin şifresini çözmek için kullanılan güvenli dize.
zh_cn: 用于解密输入字符串的安全字符串。
zh_tw: 用於解密輸入字串的安全字串。

# Activity_DecryptText_Property_KeySecureString_Name
source: Key Secure String
de: Sichere Schlüsselzeichenfolge
es: Clave SecureString
fr: Chaîne sécurisée de clé
ja: キー (SecureString)
pt_br: String Segura da Chave
ru: Ключ защищенной строки
zh_cn: 密钥安全字符串
zh_tw: 金鑰安全字串

# Activity_EncryptFile_Property_ContinueOnError_Description
source: Specifies if the automation should continue even when the activity throws an error.
de: Gibt an, ob die Automatisierung auch dann fortgesetzt werden soll, wenn die Aktivität einen Fehler auslöst.
es: Especifique si la automatización debe continuar aunque la actividad arroje un error.
fr: Précise si l’automatisation doit se poursuivre même si l’activité génère une erreur.
ja: アクティビティが例外をスローしてもオートメーションの実行を継続するかどうかを指定します。
pt_br: Especifica se a automação deve continuar mesmo quando a atividade gera um erro.
ru: Указывает, должна ли автоматизация продолжаться, даже если действие вызывает ошибку.
tr: Etkinlik bir hata oluştursa bile otomasyonun devam edip etmeyeceğini belirtir.
zh_cn: 指定如果活动引发错误，是否仍应继续自动化。
zh_tw: 指定即使活動擲回錯誤，是否仍應繼續進行自動化。

# Activity_EncryptFile_Property_ContinueOnError_Name
source: Continue On Error
de: Bei Fehler fortsetzen
es: Continuar en caso de error
fr: Continuer sur erreur
ja: エラー発生時に実行を継続
pt_br: Continuar com Erro
ru: Продолжить при ошибке
zh_cn: 出错时继续
zh_tw: 錯誤時繼續

# Activity_EncryptFile_Property_KeyEncoding_Description
source: The encoding used to interpret the key specified in the Key property.
de: Die Codierung, die zum Interpretieren des in der Eigenschaft „Key“ angegebenen Schlüssels verwendet wird.
es: La codificación utilizada para interpretar la clave especificada en la propiedad Key.
fr: L'encodage utilisé pour l'interprétation de la clé spécifiée dans la propriété Key.
ja: [キー] プロパティで指定したキーの解釈に使用するエンコードです。
pt_br: A codificação usada para interpretar a chave especificada na propriedade Key.
ru: Кодировка, используемая для интерпретации ключа, указанного в свойстве Key.
tr: Key özelliğinde belirtilen anahtarı yorumlamak için kullanılan kodlama.
zh_cn: 用于解释在“密钥”属性中指定密钥的编码。
zh_tw: 用於解譯在「金鑰」屬性中指定的金鑰的編碼。

# Activity_EncryptFile_Property_KeyEncoding_Name
source: Key Encoding
de: Schlüsselcodierung
es: CodificaciónDeClave
fr: Encodage de clé
ja: キーのエンコード
pt_br: Codificação de Chave
ru: Кодировка ключей
zh_cn: 密钥编码
zh_tw: 金鑰編碼

# Activity_EncryptFile_Property_KeySecureString_Description
source: The secure string used to encrypt the input file.
de: Die zum Verschlüsseln der Eingabedatei sichere Zeichenfolge.
es: La cadena segura utilizada para cifrar el archivo de entrada.
fr: La chaîne sécurisée utilisée pour le chiffrement du fichier d’entrée.
ja: 入力ファイルの暗号化に使用する、セキュリティで保護された文字列です。
pt_br: A string segura usada para criptografar o arquivo de entrada.
ru: Защищенная строка, используемая для шифрования входного файла.
tr: Giriş dizesini şifrelemek için kullanılan güvenli dize.
zh_cn: 用于加密输入文件的安全字符串。
zh_tw: 用於加密輸入檔的安全字串。

# Activity_EncryptFile_Property_KeySecureString_Name
source: Key Secure String
de: Sichere Schlüsselzeichenfolge
es: Clave SecureString
fr: Chaîne sécurisée de clé
ja: キー (SecureString)
pt_br: String Segura da Chave
ru: Ключ защищенной строки
zh_cn: 密钥安全字符串
zh_tw: 金鑰安全字串

# Activity_EncryptFile_Property_OutputFilePath_Description
source: The path where you want to save the encrypted file.
de: Der Pfad, unter dem Sie die verschlüsselte Datei speichern möchten.
es: La ruta donde desea guardar el archivo cifrado.
fr: Le chemin d'accès où vous souhaitez enregistrer le fichier chiffré.
ja: 暗号化するファイルの保存先のパスです。
pt_br: O caminho onde você quer salvar o arquivo criptografado.
ru: Расположение, в котором следует сохранить зашифрованный файл.
tr: Şifresi çözülen dosyayı kaydetmek istediğiniz yol.
zh_cn: 您要保存已加密文件的路径。
zh_tw: 您要儲存加密檔案的路徑。

# Activity_EncryptFile_Property_OutputFilePath_Name
source: Output file name and location
de: Name und Speicherort der Ausgabedatei
es: Nombre y ubicación del archivo de salida
fr: Nom et emplacement du fichier de sortie
ja: 出力ファイル名と場所
pt_br: Nome e local do arquivo de saída
ru: Имя и расположение файла с выходными данными
zh_cn: 输出文件的名称和位置
zh_tw: 輸出檔的名稱和位置

# Activity_EncryptFile_Property_Overwrite_Description
source: If a file already exists at the path specified in the Output path field, selecting this check box overwrites it. If unchecked, a new file is created.
de: Wenn an dem im Feld „Ausgabepfad“ angegebenen Pfad bereits eine Datei vorhanden ist, wird sie durch Aktivieren dieses Kontrollkästchens überschrieben. Wenn diese Option deaktiviert ist, wird eine neue Datei erstellt.
es: Si ya existe un archivo en la ruta especificada en el campo Ruta de salida, al marcar esta casilla de verificación se sobrescribe. Si no se marca, se crea un nuevo archivo.
fr: Si un fichier existe déjà au chemin d'accès spécifié dans le champ Output path, cocher cette case le remplacera. Si cette case est décochée, un fichier est créé.
ja: [出力パス] フィールドで指定したパスにファイルが既に存在する場合、このチェック ボックスをオンにすると、既存のファイルが上書きされます。オフにすると、新しいファイルが作成されます。
pt_br: Se um arquivo já existe no caminho especificado no campo Caminho de saída, marcar esta caixa de seleção o substituirá. Se desmarcada, um novo arquivo será criado.
ru: Если файл уже существует в расположении, указанном в поле "Путь выходных данных", установка этого флажка перезаписывает его. Если флажок не установлен, создается новый файл.
tr: Çıkış yolu alanında belirtilen yolda bir dosya zaten varsa bu onay kutusu seçildiğinde dosyanın üzerine yazılır. İşaretlenmezse yeni bir dosya oluşturulur.
zh_cn: 如果文件已存在于“输出路径”字段所指定的路径中，选中此复选框便会覆盖该文件。如取消勾选，系统便会新建文件。
zh_tw: 如果檔案已存在於「輸出路徑」欄位中所指定的路徑，選取此核取方塊便會覆寫該檔案。若已取消勾選，則會建立新檔案。

# Activity_EncryptFile_Property_Overwrite_Name
source: Overwrite
de: Überschreiben
es: Sobrescribir
fr: Écraser
ja: 上書き
pt_br: Substituir
ru: Перезаписать
zh_cn: 覆盖
zh_tw: 覆寫

# Activity_EncryptText_Description
source: Encrypts a string with a key based on a specified key encoding and algorithm.
de: Verschlüsselt eine Zeichenfolge mit einem Schlüssel basierend auf einer angegebenen Schlüsselverschlüsselung und einem Algorithmus.
es: Cifra una cadena con una clave basándose en una codificación de clave y un algoritmo especificados.
fr: Chiffre une chaîne avec une clé, selon un algorithme et un encodage de clé spécifiés.
ja: 指定したキーのエンコードとアルゴリズムに基づき、文字列をキーで暗号化します。(Encrypt Text)
pt_br: Criptografa uma string com base em um algoritmo e uma codificação de chave especificada.
ru: Шифрует строку с помощью ключа, основываясь на указанном кодировании ключа и алгоритме.
tr: Belirtilen anahtar kodlamasına ve algoritmaya göre bir dizeyi bir anahtarla şifreler.
zh_cn: 根据指定的密钥编码和算法使用密钥加密字符串。
zh_tw: 根據指定的金鑰編碼和演算法，使用金鑰加密字串。

# Activity_EncryptText_Name
source: Encrypt Text
es: Cifrar texto
ja: テキストを暗号化
zh_cn: 加密文本
zh_tw: 加密文字

# Activity_EncryptText_Property_Algorithm_Description
source: A drop-down which enables you to select the encryption algorithm you want to use.
de: Eine Dropdownliste, mit der Sie den Verschlüsselungsalgorithmus auswählen können, den Sie verwenden möchten.
es: Un menú desplegable que le permite seleccionar el algoritmo de cifrado que desea utilizar.
fr: Une liste déroulante qui permet de sélectionner l'algorithme de chiffrement que vous souhaitez utiliser.
ja: 使用する暗号化アルゴリズムをドロップダウン リストから選択します。
pt_br: Um menu suspenso que permite selecionar o algoritmo de criptografia que você quer usar.
ru: Раскрывающийся список, позволяющий выбрать алгоритм шифрования для использования.
tr: Kullanmak istediğiniz şifreleme algoritmasını seçmenize olanak veren bir açılır menü.
zh_cn: 下拉菜单，用于选择要使用的加密算法。
zh_tw: 下拉式功能表，用於選取要使用的加密演算法。

# Activity_EncryptText_Property_Algorithm_Name
source: Algorithm
de: Algorithmus
es: Algoritmo
fr: Algorithme
ja: アルゴリズム
pt_br: Algoritmo
ru: Алгоритм
tr: Algoritma
zh_cn: 算法
zh_tw: 演算法

# Activity_EncryptText_Property_ContinueOnError_Description
source: Specifies if the automation should continue even when the activity throws an error.
de: Gibt an, ob die Automatisierung auch dann fortgesetzt werden soll, wenn die Aktivität einen Fehler auslöst.
es: Especifique si la automatización debe continuar aunque la actividad arroje un error.
fr: Précise si l’automatisation doit se poursuivre même si l’activité génère une erreur.
ja: アクティビティが例外をスローしてもオートメーションの実行を継続するかどうかを指定します。
pt_br: Especifica se a automação deve continuar mesmo quando a atividade gera um erro.
ru: Указывает, должна ли автоматизация продолжаться, даже если действие вызывает ошибку.
tr: Etkinlik bir hata oluştursa bile otomasyonun devam edip etmeyeceğini belirtir.
zh_cn: 指定如果活动引发错误，是否仍应继续自动化。
zh_tw: 指定即使活動擲回錯誤，是否仍應繼續進行自動化。

# Activity_EncryptText_Property_ContinueOnError_Name
source: Continue On Error
de: Bei Fehler fortsetzen
es: Continuar en caso de error
fr: Continuer sur erreur
ja: エラー発生時に実行を継続
pt_br: Continuar com Erro
ru: Продолжить при ошибке
zh_cn: 出错时继续
zh_tw: 錯誤時繼續

# Activity_EncryptText_Property_Encoding_Description
source: The encoding used to interpret the input text and the key specified in the Key property.
de: Die Codierung, die zum Interpretieren des Eingabetexts und des in der Eigenschaft „Key“ angegebenen Schlüssels verwendet wird.
es: La codificación utilizada para interpretar la entrada de texto y la clave especificada en la propiedad Key.
fr: L'encodage utilisé pour l'interprétation du texte d'entrée et de la clé spécifiée dans la propriété Key.
ja: 入力テキストおよび [キー] プロパティで指定したキーの解釈に使用するエンコードです。
pt_br: A codificação usada para interpretar o texto de entrada e a chave especificada na propriedade Key.
ru: Кодировка, используемая для интерпретации вводного текста и ключа, указанного в свойстве Key.
tr: Giriş metnini ve Key özelliğinde belirtilen anahtarı yorumlamak için kullanılan kodlama.
zh_cn: 用于解释在“密钥”属性中指定的输入文本和密钥的编码。
zh_tw: 用於解譯在「金鑰」屬性中指定的輸入文字和金鑰的編碼。

# Activity_EncryptText_Property_Encoding_Name
source: Encoding
de: Codierung
es: Codificación
fr: Encodage
ja: エンコード
pt_br: Codificação
ru: Кодировка
zh_cn: 编码
zh_tw: 編碼中

# Activity_EncryptText_Property_Input_Description
source: The text that you want to encrypt.
de: Der Text, den Sie verschlüsseln möchten.
es: El texto que desea cifrar.
fr: Le texte que vous souhaitez chiffrer.
ja: 暗号化するテキストです。
pt_br: O texto que você quer criptografar.
ru: Текст, который следует зашифровать.
tr: Şifresini çözmek istediğiniz metin.
zh_cn: 您要加密的文本。
zh_tw: 您要加密的文字。

# Activity_EncryptText_Property_Input_Name
source: Text
es: Texto
fr: Texte
ja: テキスト
pt_br: Texto
ru: Текст
tr: Metin
zh_cn: 文本
zh_tw: 文字

# Activity_EncryptText_Property_KeySecureString_Description
source: The secure string used to encrypt the input string.
de: Die zum Verschlüsseln der Eingabezeichenfolge verwendete sichere Zeichenfolge.
es: La cadena segura utilizada para cifrar la cadena de entrada.
fr: La chaîne sécurisée utilisée pour le chiffrement de la chaîne d’entrée.
ja: 入力文字列の暗号化に使用する、セキュリティで保護された文字列です。
pt_br: A string segura usada para criptografar a string de entrada.
ru: Защищенная строка, используемая для шифрования строки ввода.
tr: Giriş dizesini şifrelemek için kullanılan güvenli dize.
zh_cn: 用于加密输入字符串的安全字符串。
zh_tw: 用於加密輸入字串的安全字串。

# Activity_EncryptText_Property_KeySecureString_Name
source: Key Secure String
de: Sichere Schlüsselzeichenfolge
es: Clave SecureString
fr: Chaîne sécurisée de clé
ja: キー (SecureString)
pt_br: String Segura da Chave
ru: Ключ защищенной строки
zh_cn: 密钥安全字符串
zh_tw: 金鑰安全字串

# Activity_EncryptText_Property_Key_Description
source: The key that you want to use to encrypt the specified file.
de: Der Schlüssel, den Sie zum Verschlüsseln der angegebenen Datei verwenden möchten.
es: La clave que desea utilizar para cifrar el archivo especificado.
fr: La clé que vous souhaitez utiliser pour le chiffrement du fichier spécifié.
ja: 指定したファイルの暗号化に使用するキーです。
pt_br: A chave que você quer usar para criptografar o arquivo especificado.
ru: Ключ, который необходимо использовать для шифрования указанного файла.
tr: Belirtilen dosyanın şifresini çözmek için kullanmak istediğiniz anahtar.
zh_cn: 您想用于加密指定文件的密钥。
zh_tw: 您想用於加密指定檔案的金鑰。

# Activity_EncryptText_Property_Key_Name
source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: キー
pt_br: Chave
ru: Ключ
zh_cn: 密钥
zh_tw: 金鑰

# Activity_EncryptText_Property_Result_Description
source: The encrypted text, stored in a String variable.
de: Der verschlüsselte Text, gespeichert in einer String-Variablen.
es: El texto cifrado, almacenado en una variable String.
fr: Le texte chiffré, stocké dans une variable String.
ja: 暗号化するテキストです。String 変数に格納されます。
pt_br: O texto criptografado, armazenado em uma variável String.
ru: Зашифрованный текст, хранящийся в переменной String.
tr: Bir dize değişkeninde depolanan, şifresi çözülmüş metin.
zh_cn: 储存在字符串变量的加密文本。
zh_tw: 儲存在字串變數中的加密文字。

# Activity_EncryptText_Property_Result_Name
source: Encrypted Text
de: Verschlüsselter Text
es: Texto cifrado
fr: Texte chiffré
ja: 暗号化済みのテキスト
pt_br: Texto Criptografado
ru: Зашифрованный текст
tr: Result
zh_cn: 加密的文本
zh_tw: 加密的文字

# Activity_KeyedHashFile_Description
source: Hashes a file with a key using a specified algorithm and encoding format and returns the hexadecimal string representation of the resulting hash.
de: Hasht eine Datei mit einem Schlüssel mit einem angegebenen Algorithmus und einem Verschlüsselungsformat und gibt die hexadezimale Zeichenfolgendarstellung des resultierenden Hashs zurück.
es: Aplica hash a un archivo con una clave utilizando un algoritmo especificado y devuelve la representación de la cadena hexadecimal del hash resultante. Admite algoritmos hash con una clave y sin clave.
fr: Hache un fichier avec une clé à l'aide d'un algorithme spécifié et renvoie la représentation de la chaîne hexadécimale du hachage produit. Il prend en charge les algorithmes de hachage avec et sans clé.
ja: 指定したアルゴリズムを使用して、ファイルをキーでハッシュします。結果として生成されるハッシュを表す 16 進数文字列を返します。キーを使用したハッシュ アルゴリズムと、キーを使用しないハッシュ アルゴリズムの両方をサポートします。(Hash File)
pt_br: Faz o hash de um arquivo com uma chave usando um algoritmo especificado e retorna a representação da string hexadecimal do hash resultante. Ele suporta o hash de algoritmos com e sem uma chave.
ru: Hashes a file with a key using a specified algorithm and returns the hexadecimal string representation of the resulting hash. It supports hashing algorithms with a key and without a key.
tr: Belirtilen bir algoritma ve kodlama biçimini kullanarak anahtarla bir dosyayı karma hale getirir ve elde edilen karmanın on altılık dize gösterimini döndürür.
zh_cn: 通过指定算法和编码格式，使用密钥散列文件，并返回所生成散列结果的十六进制字符串表示。
zh_tw: 透過指定的演算法，使用金鑰對檔案進行雜湊處理，並傳回所產生雜湊的十六進位字串表示。它支援使用金鑰和不使用金鑰的雜湊演算法。

# Activity_KeyedHashFile_Name
source: Hash File
de: Hash File With Key
es: Aplicar hash al archivo
ja: ファイルをハッシュ
tr: Hash File With Key
zh_cn: 散列文件
zh_tw: 雜湊檔案

# Activity_KeyedHashFile_Property_Algorithm_Description
source: A drop-down which enables you to select the keyed hashing algorithm you want to use.
de: Eine Dropdownliste, mit der Sie den verschlüsselten Hashing-Algorithmus auswählen können, den Sie verwenden möchten.
es: Un menú desplegable que le permite seleccionar el algoritmo hash con clave que desea utilizar.
fr: Une liste déroulante qui permet de sélectionner l'algorithme de hachage à clé que vous souhaitez utiliser.
ja: 使用する、キー付きハッシュ アルゴリズムをドロップダウン リストから選択します。
pt_br: Um menu suspenso que permite selecionar o algorítimo de hash com chave que você quer usar.
ru: Раскрывающийся список, позволяющий выбрать алгоритм хэширования с ключом для использования.
tr: Kullanmak istediğiniz anahtarlı karma algoritmasını seçmenize olanak veren bir açılır menü.
zh_cn: 下拉菜单，用于选择要使用的加密散列算法。
zh_tw: 下拉式功能表，用於選取要使用的索引雜湊演算法。

# Activity_KeyedHashFile_Property_Algorithm_Name
source: Algorithm
de: Algorithmus
es: Algoritmo
fr: Algorithme
ja: アルゴリズム
pt_br: Algoritmo
ru: Алгоритм
tr: Algoritma
zh_cn: 算法
zh_tw: 演算法

# Activity_KeyedHashFile_Property_ContinueOnError_Description
source: Specifies if the automation should continue even when the activity throws an error.
de: Gibt an, ob die Automatisierung auch dann fortgesetzt werden soll, wenn die Aktivität einen Fehler auslöst.
es: Especifique si la automatización debe continuar aunque la actividad arroje un error.
fr: Précise si l’automatisation doit se poursuivre même si l’activité génère une erreur.
ja: アクティビティが例外をスローしてもオートメーションの実行を継続するかどうかを指定します。
pt_br: Especifica se a automação deve continuar mesmo quando a atividade gera um erro.
ru: Указывает, должна ли автоматизация продолжаться, даже если действие вызывает ошибку.
tr: Etkinlik bir hata oluştursa bile otomasyonun devam edip etmeyeceğini belirtir.
zh_cn: 指定如果活动引发错误，是否仍应继续自动化。
zh_tw: 指定即使活動擲回錯誤，是否仍應繼續進行自動化。

# Activity_KeyedHashFile_Property_ContinueOnError_Name
source: Continue On Error
de: Bei Fehler fortsetzen
es: Continuar en caso de error
fr: Continuer sur erreur
ja: エラー発生時に実行を継続
pt_br: Continuar com Erro
ru: Продолжить при ошибке
zh_cn: 出错时继续
zh_tw: 錯誤時繼續

# Activity_KeyedHashFile_Property_Encoding_Description
source: The encoding used to interpret the key specified in the Key property.
de: Die Codierung, die zum Interpretieren des in der Eigenschaft „Key“ angegebenen Schlüssels verwendet wird.
es: La codificación utilizada para interpretar la clave especificada en la propiedad Key.
fr: L'encodage utilisé pour l'interprétation de la clé spécifiée dans la propriété Key.
ja: [キー] プロパティで指定したキーの解釈に使用するエンコードです。
pt_br: A codificação usada para interpretar a chave especificada na propriedade Key.
ru: Кодировка, используемая для интерпретации ключа, указанного в свойстве Key.
tr: Key özelliğinde belirtilen anahtarı yorumlamak için kullanılan kodlama.
zh_cn: 用于解释在“密钥”属性中指定密钥的编码。
zh_tw: 用於解譯在「金鑰」屬性中指定的金鑰的編碼。

# Activity_KeyedHashFile_Property_Encoding_Name
source: Encoding
de: Codierung
es: Codificación
fr: Encodage
ja: エンコード
pt_br: Codificação
ru: Кодировка
zh_cn: 编码
zh_tw: 編碼中

# Activity_KeyedHashFile_Property_FilePath_Description
source: The path to the file you want to hash.
de: Der Pfad zur Datei, die Sie hashen möchten.
es: La ruta al archivo al que desea aplicar hash.
fr: Le chemin d'accès au fichier que vous souhaitez hacher.
ja: ハッシュするファイルのパスです。
pt_br: O caminho do arquivo que você quer fazer hash.
ru: Путь к файлу, для которого следует выполнить хэширование.
tr: Karma hale getirmek istediğiniz dosyanın yolu.
zh_cn: 您要散列的文件路径。
zh_tw: 您要進行雜湊處理的檔案的路徑。

# Activity_KeyedHashFile_Property_FilePath_Name
source: File path
de: Dateipfad
es: Ruta del archivo
fr: Chemin du fichier
ja: ファイル パス
pt_br: Caminho do arquivo
ru: Путь к файлу
zh_cn: 文件路径
zh_tw: 檔案路徑

# Activity_KeyedHashFile_Property_KeySecureString_Description
source: The secure string used to hash the provided file.
de: Die zum Hashen der bereitgestellten Datei verwendete sichere Zeichenfolge.
es: La cadena segura utilizada para aplicar un algoritmo hash al archivo proporcionado.
fr: La chaîne sécurisée utilisée pour hacher le fichier fourni.
ja: 指定したファイルのハッシュに使用する、セキュリティで保護された文字列です。
pt_br: A string segura usada para fazer o hash do arquivo fornecido.
ru: Защищенная строка, используемая для хэширования указанного файла.
tr: Sağlanan dosyayı karma haline getirmek için kullanılan güvenli dize.
zh_cn: 用于散列给定文件的安全字符串。
zh_tw: 用於雜湊處理提供的檔案的安全字串。

# Activity_KeyedHashFile_Property_KeySecureString_Name
source: Key Secure String
de: Sichere Schlüsselzeichenfolge
es: Clave SecureString
fr: Chaîne sécurisée de clé
ja: キー (SecureString)
pt_br: String Segura da Chave
ru: Ключ защищенной строки
zh_cn: 密钥安全字符串
zh_tw: 金鑰安全字串

# Activity_KeyedHashFile_Property_Key_Description
source: The key that you want to use to hash the specified file.
de: Der Schlüssel, den Sie zum Hashen der angegebenen Datei verwenden möchten.
es: La clave que desea utilizar para aplicar hash al archivo especificado.
fr: La clé que vous souhaitez utiliser pour le hachage du fichier spécifié.
ja: 指定したファイルのハッシュに使用するキーです。
pt_br: A chave que você quer usar para fazer hash do arquivo especificado.
ru: Ключ, который следует использовать для хэширования указанного файла.
tr: Belirtilen dosyayı karma hale getirmek için kullanmak istediğiniz anahtar.
zh_cn: 您想用于散列指定文件的密钥。
zh_tw: 您想用於雜湊處理指定檔案的金鑰。

# Activity_KeyedHashFile_Property_Key_Name
source: Key
de: Schlüssel
es: Clave
fr: Clé
ja: キー
pt_br: Chave
ru: Ключ
zh_cn: 密钥
zh_tw: 金鑰

# Activity_KeyedHashFile_Property_Result_Description
source: The hashed file, stored in a String variable.
de: Die gehashte Datei, gespeichert in einer String-Variablen.
es: El archivo al que ha aplicado hash, almacenado en una variable String.
fr: Le fichier haché, stocké dans une variable String.
ja: ハッシュされるファイルです。String 型変数に格納されます。
pt_br: O arquivo com hash, armazenado em uma variável String.
ru: Хэшированный файл, хранящийся в переменной String.
tr: Bir Dize değişkeninde depolanan karma dosya.
zh_cn: 储存在字符串变量的已散列文件。
zh_tw: 儲存在字串變數中的雜湊檔案。

# Activity_KeyedHashFile_Property_Result_Name
source: Hash
fr: Hachage
ja: ハッシュ
ru: Хэш
tr: Result
zh_cn: 哈希值
zh_tw: 雜湊

# Activity_KeyedHashText_Description
source: Hashes a string with a key using a specified algorithm and returns the hexadecimal string representation of the resulting hash.
de: Hasht eine Zeichenfolge mit einem Schlüssel mithilfe eines angegebenen Algorithmus und gibt die hexadezimale Zeichenfolgendarstellung des resultierenden Hashs zurück.
es: Aplica hash a una cadena con una clave utilizando un algoritmo especificado y devuelve la representación de la cadena hexadecimal del hash resultante. Admite algoritmos hash con una clave y sin clave.
fr: Hache une chaîne avec une clé à l'aide d'un algorithme spécifié et renvoie la représentation de la chaîne hexadécimale du hachage produit. Il prend en charge les algorithmes de hachage avec et sans clé.
ja: 指定したアルゴリズムを使用して、文字列をキーでハッシュします。結果として生成されるハッシュを表す 16 進数文字列を返します。キーを使用したハッシュ アルゴリズムと、キーを使用しないハッシュ アルゴリズムの両方をサポートします。(Hash Text)
pt_br: Faz o hash de uma string com uma chave usando um algoritmo especificado e retorna a representação da string hexadecimal do hash resultante. Ele suporta o hash de algoritmos com e sem uma chave.
ru: Hashes a string with a key using a specified algorithm and returns the hexadecimal string representation of the resulting hash. It supports hashing algorithms with a key and without a key.
tr: Belirtilen algoritmayı kullanarak bir anahtarla bir dizeyi karma hale getirir ve elde edilen karmanın onaltılık dize gösterimini döndürür.
zh_cn: 通过指定算法，使用密钥散列字符串，并返回所生成散列结果的十六进制字符串表示。
zh_tw: 透過指定的演算法，使用金鑰對字串進行雜湊處理，並傳回所產生雜湊的十六進位字串表示。它支援使用金鑰和不使用金鑰的雜湊演算法。

# Activity_KeyedHashText_Name
source: Hash Text
de: Hash Text With Key
es: Texto hash
ja: テキストをハッシュ
tr: Hash Text With Key
zh_cn: 散列文本
zh_tw: 雜湊文字
