Repository: UiPath/Community.Activities
Catalog: Activities/Database/UiPath.Database.Activities.Design/Properties/UiPath.Database.Activities.Design.*.resx
Languages: de, es, es_mx, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# BulkInsertDescription
source: Will update a table using Bulk operations using the specific database driver implementation. Will fallback to Insert Data Table if the database driver does not support Bulk operations.
de: Aktualisiert eine Tabelle mithilfe von Massenvorgängen mit der spezifischen Datenbank-Treiberimplementierung. Greift auf „Datentabelle einfügen“ zurück, wenn der Datenbanktreiber keine Massenvorgänge unterstützt.
es: Actualizará una tabla mediante operaciones por lotes usando la implementación específica del controlador de base de datos. Retrocederá a Insertar tabla de datos si el controlador de la base de datos no admite las operaciones por lotes.
es_mx: Actualizará una tabla usando operaciones en masa mediante la implementación específica del controlador de base de datos. Volverá a insertar la tabla de datos si el controlador de base de datos no admite operaciones en masa.
fr: Mettra à jour une table à l’aide d’opérations en masse via la mise en œuvre spécifique de pilote de base de données. Cette activité sera remplacée par Insérer une table de données (Insert Data Table) si le pilote de base de données ne prend pas en charge les opérations en masse.
ja: 特定のデータベース ドライバー実装を使用した一括操作でテーブルを更新します。データベース ドライバーが一括操作をサポートしていない場合は、[挿入] アクティビティにフォールバックします。(Bulk Insert)
ko: 특정 데이터베이스 드라이버 구현을 사용하여 일괄 작업을 사용하는 테이블을 업데이트합니다. 데이터베이스 드라이버가 일괄 작업을 지원하지 않는 경우 데이터 테이블 삽입으로 대체됩니다.
pt: Irá atualizar uma tabela com operações Em Massa através da implementação do controlador da base de dados específico. Irá reverter para Insert Data Table se o controlador da base de dados não suportar operações Em Massa.
pt_br: Atualizará uma tabela usando operações em massa com a implementação específica de driver do banco de dados. Realizará o fallback para Insert Data Table se o driver do banco de dados não for compatível com operações em massa.
ru: Обновит таблицу с помощью массовых операций с использованием определенного внедрения драйвера базы данных. Вернется к вставке таблицы данных, если драйвер базы данных не поддерживает массовые операции.
tr: Belirli veritabanı sürücü uygulamasını kullanarak Toplu işlemlerin kullanıldığı bir tabloyu güncelleştirir. Veritabanı sürücüsü Toplu işlemleri desteklemiyorsa Insert Data Table'a geri döner.
zh_cn: 将使通过特定数据库驱动程序实现的批量操作更新表。如果数据库驱动程序不支持批量操作，将返回到“插入数据表”。
zh_tw: 將使透過特定資料庫驅動程式實作的大量作業更新表。如果資料庫驅動程式不支援大量作業，將回復至「插入資料表」。

# ConnectionSecureStringDescription
source: The connection string used to establish a database connection as Secure String
de: Die Verbindungszeichenfolge zum Aufbau einer Datenbankverbindung als sichere Zeichenfolge.
es: La cadena de conexión utilizada para establecer una conexión con la base de datos como cadena segura
es_mx: La cadena de conexión utilizada para establecer una conexión de base de datos como cadena segura
fr: La chaîne de connexion utilisée pour établir une connexion à la base de données en tant que chaîne sécurisée
ja: データベース接続の確立に使用する、SecureString 型の接続文字列です。
ko: 데이터베이스 연결을 보안 문자열로 설정하기 위해 사용되는 연결 문자열
pt: A cadeia de ligação utilizada para estabelecer uma ligação de base de dados como Cadeia Segura
pt_br: A string de conexão usada para estabelecer uma conexão de banco de dados como uma String Segura
ru: Строка подключения, используемая для установления соединения с базой данных как Secure String
tr: Güvenli Dize olarak bir veritabanı bağlantısı kurmak için kullanılan bağlantı dizesi
zh_tw: 用於以安全字串形式建立資料庫連線的連線字串
