Repository: UiPath/Community.Activities
Catalog: Activities/Database/UiPath.Database.Activities.Design/Properties/UiPath.Database.Activities.Design.*.resx
Languages: de, es, es_mx, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# TableNameDescription
source: The target database table
de: Die Zieldatenbanktabelle
es: La tabla de la base de datos de destino
es_mx: La tabla de base de datos de destino
fr: Table de base de données cible
ja: 対象のデータベース テーブルです。
ko: 대상 데이터베이스 테이블
pt: A tabela de base de dados de destino
pt_br: A tabela de banco de dados de destino
ru: Таблица целевой базы данных
tr: Hedef veritabanı tablosu
zh_cn: 目标数据库表格
zh_tw: 目標資料庫資料表

# TimeoutMSDescription
source: Specifies the amount of time (in milliseconds) to wait for the sql command to run before an error is thrown. The default value is 30000 milliseconds (30 seconds) and must be greater than or equal to 0.
de: Gibt die Zeitspanne (in Millisekunden) an, in der auf die Ausführung des SQL-Befehls gewartet wird, bevor ein Fehler ausgelöst wird. Der Standardwert ist 30000 Millisekunden (30 Sekunden) und muss größer oder gleich 0 sein.
es: Especifica la cantidad de tiempo (en milisegundos) que se debe esperar para que se ejecute el comando sql antes de que se produzca un error. El valor predeterminado es 30 000 milisegundos (30 segundos) y debe ser mayor o igual a 0.
es_mx: Especifica la cantidad de tiempo (en milisegundos) que se debe esperar para que se ejecute el comando sql antes de que se produzca un error. El valor predeterminado es 30,000 milisegundos (30 segundos) y debe ser mayor que 0 o igual a ese valor.
fr: Indique la durée (en millisecondes) d’attente pour l’exécution d’une commande SQL avant qu’une erreur soit générée. La valeur par défaut est de 30 000 millisecondes (30 secondes) et doit être supérieure ou égale à 0.
ja: SQL コマンドの実行まで待機する時間をミリ秒で指定します。指定した時間が経過しても実行が完了しない場合には例外をスローします。既定値は 30000 ミリ秒 (30 秒) で、0 以上の値を設定する必要があります。
ko: 오류가 throw되기 전에 SQL 명령이 실행되기 위해 대기하는 시간(밀리초)을 지정합니다. 기본값은 30000밀리초(30초)이며 이 값은 0 이상이어야 합니다.
pt: Especifica a quantidade de tempo (em milissegundos) a aguardar que o comando sql seja executado antes de ser gerado um erro. O valor predefinido é de 30 000 milissegundos (30 segundos) e tem de ser superior ou igual a 0.
pt_br: Especifica o tempo (em milissegundos) a ser aguardado para que o comando sql seja executado antes de gerar um erro. O valor padrão é 30.000 milissegundos (30 segundos) e deve ser maior ou igual a 0.
ru: Указывает в миллисекундах время ожидания выполнения команды sql до возникновения ошибки. Значение по умолчанию равняется 30 000 миллисекунд (30 секундам) и должно быть больше или равно 0.
tr: Hata oluşturulmadan önce SQL komutunun çalışmasının bekleneceği süreyi (milisaniye olarak) belirtir. Varsayılan değer 30000 milisaniyedir (30 saniye) ve 0'dan büyük veya 0'a eşit olmalıdır.
zh_cn: 指定等待时间 (以毫秒为单位)，如果超出该时间后 SQL 指令并未运行，就会引发错误。默认值为 30000 毫秒 (30 秒)，且必须大于或等于 0。
zh_tw: 指定等待時間 (以毫秒為單位)，如果超出該時間後 SQL 命令並未執行，就會擲回錯誤。預設值為 30000 毫秒 (30 秒)，且必須大於或等於 0。

# UseTransactionDescription
source: Specifies if the database operations within this activity should be wrapped in a database transaction
de: Gibt an, ob die Datenbankvorgänge innerhalb dieser Aktivität in eine Datenbanktransaktion eingebettet werden sollen.
es: Especifica si las operaciones de la base de datos que se encuentran dentro de esta actividad deben formar parte de una transacción de la base de datos
es_mx: Especifica si las operaciones de base de datos dentro de esta actividad se deben ajustar en una transacción de base de datos
fr: Indique si les opérations de la base de données dans le cadre de cette activité doivent être encapsulées dans une transaction de base de données
ja: このアクティビティ内のデータベース操作を 1 つのデータベース トランザクションにまとめるかどうかを指定します。
ko: 이 액티비티의 데이터베이스 작업이 데이터베이스 트랜잭션에서 래핑되어야 하는지의 여부를 지정합니다.
pt: Especifica se as operações de base de dados nesta atividade devem ser moldadas numa transação de base de dados
pt_br: Especifica se as operações de banco de dados dentro desta atividade devem ser envolvidas em uma transação de banco de dados
ru: Показывает, должны ли операции в базе данных в рамках этого действия быть "упакованы" в транзакцию базы данных.
tr: Bu etkinlik içindeki veritabanı işlemlerinin bir veritabanı işlemine sarılıp sarılmayacağını belirtir
zh_cn: 指定是否应将此活动内的数据库操作包含在数据库事务中
zh_tw: 指定是否應將此活動內的資料庫作業包含在資料庫交易中

# AffectedRecordsInsertDescription
source: The number of inserted rows
de: Die Anzahl der eingefügten Zeilen
es: El número de filas insertadas
es_mx: El número de filas insertadas
fr: Nombre de lignes insérées
ja: 挿入した列の数です。
ko: 삽입된 행 수
pt: O número de linhas inseridas
pt_br: O número de linhas inseridas
ru: Количество вставленных строк
tr: Eklenen satırların sayısı
zh_cn: 插入的行数
zh_tw: 插入的列數

source: Configure Connection...
de: Verbindung konfigurieren...
es: Configurar conexión...
es_mx: Configurar conexión...
fr: Configurer la connexion...
ja: 接続を構成...
ko: 연결 구성...
pt: Configurar Ligação...
pt_br: Configurar Conexão...
ru: Настроить подключение...
tr: Bağlantıyı Yapılandır...
zh_cn: 配置连接…
zh_tw: 配置連線...

# InserDataTableInputDescription
source: The DataTable object that will be inserted in the Table. The DataTable columns description must match the columns from the database table
de: Das Datentabellenobjekt, das in die Tabelle eingefügt wird. Die Beschreibung der Datentabellenspalten muss mit den Spalten aus der Datenbanktabelle übereinstimmen.
es: El objeto TablaDeDatos que se insertará en la tabla. La descripción de las columnas TablaDeDatos debe coincidir con las columnas de la tabla de la base de datos
es_mx: El objeto DataTable que se insertará en la tabla. La descripción de las columnas de DataTable debe coincidir con las columnas de la tabla de base de datos
fr: Objet DataTable à insérer dans la Table. La description des colonnes de la DataTable doit correspondre aux colonnes de la table de base de données
ja: 表に挿入される DataTable オブジェクトです。データテーブル列の説明は、データベース テーブルの列と一致する必要があります。
ko: 테이블에 삽입될 DataTable 객체입니다. DataTable 열 설명은 데이터베이스 테이블의 열과 일치해야 합니다.
pt: O objeto TabelaDeDados que será inserido na Tabela. A descrição das colunas da TabelaDeDados tem de corresponder às colunas da tabela de base de dados
pt_br: O objeto DataTable a ser inserido na Tabela. A descrição das colunas DataTable deve corresponder às colunas da tabela do banco de dados
ru: Объект DataTable, который будет вставлен в таблицу Table. Описание столбцов DataTable должно совпадать с описанием в таблице в базе данных
tr: Tabloya eklenecek DataTable nesnesi. DataTable sütunları açıklaması veritabanı tablosundaki sütunlar ile eşleşmelidir
zh_cn: 要在表格中插入的“数据表”对象。数据表列的描述必须与数据库表格列的描述相符
zh_tw: 要在資料表中插入的「資料表」物件。資料表欄的說明必須與資料庫資料表欄的說明相符

source: Connection Wizard
de: Verbindungs-Assistent
es: Asistente de conexión
es_mx: Asistente de conexión
fr: Assistant de connexion
ja: 接続ウィザード
ko: 연결 마법사
pt: Assistente de Ligação
pt_br: Assistente de Conexão
ru: Мастер подключения
tr: Bağlantı Sihirbazı
zh_cn: 连接向导
zh_tw: 連線精靈

source: Double-click to view
de: Zum Anzeigen doppelklicken
es: Doble clic para ver
es_mx: Haga doble clic para ver.
fr: Double-cliquer pour afficher
ja: ダブルクリックして表示
ko: 두 번 클릭하여 보기
pt: Fazer duplo clique para ver
pt_br: Clique duas vezes para exibir
ru: Дважды щелкните для просмотра
tr: Görüntülemek için çift tıklatın
zh_cn: 双击查看
zh_tw: 按兩下以檢視

source: Edit Connection Settings
de: Verbindungseinstellungen bearbeiten
es: Editar la configuración de la conexión
es_mx: Editar configuración de conexión
fr: Modifier les paramètres de connexion
ja: 接続設定を編集
ko: 연결 설정 편집
pt: Editar Definições de Ligação
pt_br: Editar Configurações de Conexão
ru: Изменить параметры подключения
tr: Bağlantı Ayarlarını Düzenle
zh_cn: 编辑连接设置
zh_tw: 編輯連線設定

source: Edit Query...
es_mx: Editar consulta...
fr: Modifier la requête...
ja: クエリを編集...
ko: 쿼리 편집...
pt: Editar Consulta...
pt_br: Editar Consulta...
ru: Изменить запрос...
zh_cn: 编辑查询…
zh_tw: 編輯查詢...

source: New Database Connection
de: Neue Datenbankverbindung
es: Nueva conexión a la base de datos
es_mx: Nueva conexión de base de datos
fr: Nouvelle connexion à la base de données
ja: 新しいデータベース接続
ko: 새 데이터베이스 연결
pt: Nova Ligação de Base de Dados
pt_br: Nova Conexão do Banco de dados
ru: Новое подключение к базе данных
tr: Yeni Veritabanı Bağlantısı
zh_cn: 新的数据库连接
zh_tw: 新的資料庫連線

source: Parameters
de: Parameter
es: Parámetros
es_mx: Parámetros
fr: Paramètres
ja: パラメーター
ko: 매개 변수
pt: Parâmetros
pt_br: Parâmetros
ru: Параметры
tr: Parametreler
zh_cn: 参数
zh_tw: 參數

source: DisplayName
de: Anzeigename
es: NombreParaMostrar
ja: 表示名
ko: 표시 이름
pt: NomeApresentar
tr: GörünenAd
zh_cn: 显示名称
zh_tw: 顯示名稱

source: Connection String
de: Verbindungszeichenfolge
es: Cadena de conexión
es_mx: Cadena de conexión
fr: Chaîne de connexion
ja: 接続文字列
ko: 연결 문자열
pt: Cadeia de Ligação
pt_br: String de Conexão
ru: Строка подключения
tr: Bağlantı Dizesi
zh_cn: 连接字符串
zh_tw: 連線字串

source: Database connection
de: Datenbankverbindung
es: Conexión de base de datos
es_mx: Conexión a la base de datos
fr: Connexion à la base de données
ja: データベース接続
ko: 데이터베이스 연결
pt: Ligação de base de dados
pt_br: Conexão do banco de dados
ru: Подключение к базе данных
tr: Veritabanı bağlantısı
zh_cn: 数据库连接
zh_tw: 資料庫連線

source: Data Table
de: Datentabelle
es: Tabla de datos
es_mx: Tabla de datos
fr: Table de données
ja: データ テーブル
ko: 데이터 테이블
pt: Tabela de Dados
pt_br: Tabela de Dados
ru: Таблица данных
tr: Veri Tablosu
zh_cn: 数据表
zh_tw: 資料表

source: Drop activity here
de: Aktivität hier ablegen
es: Colocar la actividad aquí
es_mx: Coloque la actividad aquí.
fr: Déposer l'activité ici
ja: ここにアクティビティをドロップ
ko: 여기에 액티비티 놓기
pt: Largar a atividade aqui
pt_br: Soltar atividade aqui
ru: Перетащите действие сюда
tr: Etkinliği buraya bırak
zh_cn: 将活动放置在此处
zh_tw: 將活動放置在此處

source: Edit Sql
de: SQL bearbeiten
es: Editar Sql
es_mx: Editar Sql
fr: Modifier SQL
ja: SQL を編集
ko: SQL 편집
pt: Editar Sql
pt_br: Editar Sql
ru: Изменить Sql
tr: Sql Düzenle
zh_cn: 编辑 SQL
zh_tw: 編輯 SQL

source: Existing Database Connection
de: Vorhandene Datenbankverbindung
es: Conexión a la base de datos existente
es_mx: Conexión a base de datos existente
fr: Connexion à la base de données existante
ja: 既存のデータベース接続
ko: 기존 데이터베이스 연결
pt: Ligação de Base de Dados Existente
pt_br: Conexão do Banco de dados Existente
ru: Существующее подключение к базе данных
tr: Var Olan Veritabanı Bağlantısı
zh_cn: 现有数据库连接
zh_tw: 現有資料庫連線

# SqlQueryHint
source: Sql query. Text must be quoted
de: SQL-Abfrage. Text muss in Anführungszeichen stehen.
es: Consulta sql. El texto se debe entrecomillar
es_mx: Consulta sql. Se debe entrecomillar el texto
fr: Requête SQL. Le texte doit être entre guillemets
ja: SQL クエリです。テキストは引用符で囲む必要があります。
ko: SQL 쿼리입니다. 텍스트를 따옴표로 묶어야 합니다.
pt: Consulta Sql. O texto tem de estar entre aspas
pt_br: Consulta sql. O texto deve estar entre aspas
ru: Запрос Sql. Текст должен быть заключен в кавычки
tr: SQL sorgusu. Metin tırnak işareti içine alınmalıdır
zh_cn: SQL 查询。必须将文本放入引号中
zh_tw: SQL 查詢。文字必須使用引號括住

# TableNameHint
source: Table name. Text must be quoted
de: Tabellenname. Text muss in Anführungszeichen stehen.
es: Nombre de la tabla. El texto se debe entrecomillar
es_mx: Nombre de la tabla Se debe entrecomillar el texto
fr: Nom de la table. Le texte doit être entre guillemets
ja: 表の名前です。テキストは引用符で囲む必要があります。
ko: 테이블 이름입니다. 텍스트를 따옴표로 묶어야 합니다.
pt: Nome da tabela. O texto tem de estar entre aspas
pt_br: Nome da tabela. O texto deve estar entre aspas
ru: Имя таблицы. Текст должен быть заключен в кавычки
tr: Tablo adı. Metin tırnak işareti içine alınmalıdır
zh_cn: 表格名称。必须将文本放入引号中
zh_tw: 資料表名稱。文字必須使用引號括住

# QueryTimeoutMSDescription
source: Specifies the amount of time (in milliseconds) to wait for the sql query to run before an error is thrown (it doesn't include the response time for the query result retrieval). The default value is 30000 milliseconds (30 seconds) and must be greater than or equal to 0.
de: Gibt die Zeitspanne (in Millisekunden) an, in der auf die Ausführung der SQL-Abfrage gewartet wird, bevor ein Fehler ausgelöst wird (die Antwortzeit für das Abrufen des Abfrageergebnisses wird nicht eingeschlossen). Der Standardwert ist 30000 Millisekunden (30 Sekunden) und muss größer oder gleich 0 sein.
es: Especifica la cantidad de tiempo (en milisegundos) que se debe esperar a que se ejecute la consulta sql antes de producir un error (no incluye el tiempo de respuesta para la recuperación de resultados de la consulta). El valor predeterminado es 30 000 milisegundos (30 segundos) y debe ser mayor o igual a 0.
es_mx: Especifica la cantidad de tiempo (en milisegundos) que se debe esperar para que se ejecute la consulta sql antes de que se produzca un error (no incluye el tiempo de respuesta para la recuperación de resultados de la consulta). El valor predeterminado es 30,000 milisegundos (30 segundos) y debe ser mayor que 0 o igual a ese valor.
fr: Indique la durée (en millisecondes) d’attente pour l’exécution de la requête SQL avant qu’une erreur soit générée (n’inclut pas le temps de réponse pour la récupération du résultat de la requête). La valeur par défaut est de 30 000 millisecondes (30 secondes) et doit être supérieure ou égale à 0.
ja: SQL クエリの実行まで待機する時間をミリ秒で指定します。指定した時間が経過しても実行が完了しない場合には例外をスローします (クエリ結果の取得の応答時間は含みません)。既定値は 30000 ミリ秒 (30 秒) で、0 以上の値を設定する必要があります。
ko: 오류가 throw되기 전에 SQL 쿼리가 실행하기 위해 대기해야 하는 시간(밀리초)을 지정합니다(쿼리 결과를 검색하기 위한 응답 시간 제외). 기본값은 30000밀리초(30초)이며 이 값은 0 이상이어야 합니다.
pt: Especifica a quantidade de tempo (em milissegundos) a aguardar que a consulta sql seja executada antes de ser gerado um erro (não inclui o tempo de resposta para a obtenção do resultado da consulta). O valor predefinido é de 30 000 milissegundos (30 segundos) e tem de ser superior ou igual a 0.
pt_br: Especifica o tempo (em milissegundos) a ser aguardado para que a consulta sql seja executada antes de gerar um erro (não inclui o tempo de resposta para a recuperação do resultado da consulta). O valor padrão é 30.000 milissegundos (30 segundos) e deve ser maior ou igual a 0.
ru: Указывает в миллисекундах время ожидания выполнения запроса sql до возникновения ошибки (сюда не входит время ответа для получения результата запроса). Значение по умолчанию равняется 30 000 миллисекунд (30 секундам) и должно быть больше или равно 0.
tr: Bir hata oluşturulmadan önce SQL sorgusunun çalışmasının bekleneceği süreyi (milisaniye olarak) belirtir (sorgu sonucu almaya yönelik yanıt süresini içermez). Varsayılan değer 30000 milisaniyedir (30 saniye) ve 0'dan büyük veya 0'a eşit olmalıdır.
zh_cn: 指定等待时间 (以毫秒为单位)，如果超出该时间后 SQL 查询并未运行，就会引发错误 (不包括查询结果检索的响应时间)。默认值为 30000 毫秒 (30 秒)，且必须大于或等于 0。
zh_tw: 指定等待時間 (以毫秒為單位)，如果超出該時間後 SQL 查詢並未執行，就會擲回錯誤 (不包括查詢結果擷取的回應時間)。預設值為 30000 毫秒 (30 秒)，且必須大於或等於 0。

# CategoryAppIntegration
source: App Integration
es: Integración de aplicaciones
es_mx: Integración de aplicaciones
fr: Intégration de l'appli
ja: アプリの連携
ko: 앱 통합
pt_br: Integração do Aplicativo
ru: Интеграция приложений
zh_cn: 应用程序集成
zh_tw: 應用程式整合

source: Execute Non Query
es_mx: No ejecutar consulta
ja: 非クエリを実行
zh_cn: 执行非查询

source: Execute Query
es_mx: Ejecutar consulta
ja: クエリを実行
zh_cn: 执行查询

# CollectionLabel
source: (Collection)
de: (Aufzählung)
es: (Colección)
es_mx: (Colección)
ja: (コレクション)
ko: (컬렉션)
pt: (Coleção)
pt_br: (Coleção)
ru: (Коллекция)
tr: (Koleksiyon)
zh_cn: (集合)
zh_tw: (集合)

# ContinueOnError
source: ContinueOnError Boolean
de: BeiFehlerFortsetzen – boolescher Wert
es: Boolean ContinuarEnCasoDeError
ja: エラー発生時に実行を継続 (Boolean)
ko: ContinueOnError 부울
tr: ContinueOnError Boole
zh_cn: 出错时继续布尔值
zh_tw: 出錯時繼續布林值

source: Bulk Insert
es_mx: Inserción en masa
ja: 一括挿入
ru: Массовая вставка
zh_cn: 批量插入

# BulkInsert_DataTable
source: DataTable
de: Eingabedatentabelle
es: Tabla de datos de entrada
ja: データテーブル
pt: TabelaDeDados
tr: Giriş veri tablosu
zh_cn: 数据表
zh_tw: 資料表

# BulkInsert_DataTable_Description
source: The source DataTable for the items to be inserted.
de: Die Quell-Datentabelle für die einzufügenden Elemente.
es: La TablaDeDatos de origen para los elementos que va a insertarse.
es_mx: El DataTable de origen para los elementos que se insertarán.
fr: L’objet DataTable source pour les éléments à insérer.
ja: 挿入する項目のソース データテーブルです。
ko: 삽입할 항목에 대한 소스 DataTable입니다.
pt: A TabelaDeDados de origem para os itens a inserir.
pt_br: A DataTable de origem dos itens a serem inseridos.
ru: Исходный параметр DataTable для элементов, которые необходимо вставить.
tr: Öğeler için eklenecek kaynak DataTable.
zh_cn: 要插入项目的源数据表。
zh_tw: 要插入項目的來源資料表。

# BulkInsert_DataTable_Placeholder
source: Source DataTable
de: DataTable-Variable angeben
es: Proporcionar la variable TablaDeDatos
es_mx: DataTable de origen
fr: Objet DataTable source
ja: ソース データテーブル
ko: 소스 DataTable
pt: TabelaDeDados de Origem
pt_br: DataTable de Origem
tr: VeriTablosu değişkenini sağlayın
zh_cn: 源数据表
zh_tw: 來源資料表

# BulkInsert_TableName
source: Table name
de: Name der Zieltabelle
es: Nombre de la tabla de destino
es_mx: Nombre de la tabla
fr: Nom du tableau
ja: データ テーブル名
ko: 테이블 이름
pt: Nome da tabela
pt_br: Nome da tabela
ru: Имя таблицы
tr: Hedef tablo adı
zh_cn: 表格名称
zh_tw: 資料表名稱

# BulkInsert_TableName_Description
source: The name of the database table where you want to insert the items.
de: Der Name der Datenbanktabelle, in die Sie die Elemente einfügen möchten.
es: El nombre de la tabla de la base de datos en la que desea insertar los elementos.
es_mx: El nombre de la tabla de base de datos donde se desea insertar los elementos.
fr: Le nom de la table de base de données dans laquelle vous souhaitez insérer les éléments.
ja: 項目を挿入するデータベース テーブルの名前です。
ko: 항목을 삽입할 데이터베이스 테이블의 이름입니다.
pt: O nome da tabela de base de dados na qual pretende inserir os itens.
pt_br: O nome da tabela do banco de dados na qual você deseja inserir os itens.
ru: Имя таблицы базы данных, в которую нужно вставить элементы.
tr: Öğeleri eklemek istediğiniz veritabanı tablosunun adı.
zh_cn: 要插入项目的数据库表的名称。
zh_tw: 要插入項目的資料庫資料表的名稱。

# BulkInsert_TableName_Placeholder
source: Destination database table name
de: Namen der Zieldatenbanktabelle angeben
es: Proporcionar el nombre de la tabla de la base de datos de destino
es_mx: Nombre de la tabla de base de datos de destino
fr: Nom de la table de base de données de destination
ja: 挿入先のデータベース テーブル名
ko: 대상 데이터베이스 테이블 이름
pt: Nome da tabela de base de dados de destino
pt_br: Nome da tabela de destino no banco de dados
ru: Имя целевой таблицы базы данных
tr: Hedef veritabanı tablo adını sağlayın
zh_cn: 目标数据库表名称
zh_tw: 目的地資料庫資料表名稱

# BulkUpdate_ColumnNames
source: Columns used for matching rows
de: Spalten, die für übereinstimmende Zeilen verwendet werden
es: Columnas utilizadas para filas coincidentes
es_mx: Columnas utilizadas para hacer coincidir filas
fr: Colonnes utilisées pour la correspondance de lignes
ja: 行の照合に使用する列
ko: 일치하는 행에 사용되는 열
pt: Colunas utilizadas para corresponder linhas
pt_br: Colunas usadas para linhas correspondentes
ru: Столбцы, используемые для сопоставления строк
tr: Eşleşen satırlar için kullanılan sütunlar
zh_cn: 用于匹配行的列
zh_tw: 用於相符列的欄

# BulkUpdate_ColumnNames_Placeholder
source: The collection of column names used for row matching
de: Spaltennamen, die für den Zeilenabgleich verwendet werden
es: Nombres de columna utilizados para la coincidencia de filas
es_mx: La colección de nombres de columna utilizados para la coincidencia de filas
fr: La collection de noms de colonnes utilisée pour la correspondance de lignes
ja: 行の照合に使用する列名のコレクション
ko: 행 일치에 사용되는 열 이름의 컬렉션
pt: A coleção de nomes de colunas utilizados para a correspondência de linhas
pt_br: O conjunto de nomes de colunas usados na correspondência de linhas
ru: Коллекция имен столбцов, используемых для сопоставления строк
tr: Satır eşleştirmek için kullanılan sütun adları
zh_cn: 用于行匹配的列名称集合
zh_tw: 用於列相符的欄名稱集合

source: Bulk Update
es_mx: Actualización en masa
ja: 一括更新
ru: Массовое обновление
zh_cn: 批量更新

# BulkUpdateDescription
source: Updates a compatible DataTable in a existing Table. Will update all the columns that are not in the collection of column names used as a primary key. Returns the number of rows affected.
de: Fügt eine Datentabelle in eine vorhandene Tabelle ein. Aktualisiert alle Spalten, die sich nicht in der Sammlung der Spaltennamen befinden, die als Primärschlüssel verwendet werden. Gibt die Anzahl der betroffenen Zeilen zurück.
es: Actualiza una TablaDeDatos compatible en una tabla existente. Actualizará todas las columnas que no estén en la colección de nombres de columna utilizados como clave primaria. Devuelve el número de filas afectadas.
es_mx: Actualiza una DataTable compatible en una tabla existente. Actualizará todas las columnas que no están en la colección de nombres de columna utilizados como clave principal. Devuelve el número de filas afectadas.
fr: Met à jour un objet DataTable compatible dans un objet Table existant. Mettra à jour toutes les colonnes qui ne font pas partie de la collection de noms de colonnes utilisée comme clé principale. Renvoie le nombre de lignes affectées.
ja: 既存のテーブルにある、対応するデータテーブルを更新します。主キーとして使用される列名のコレクションに入っていない、すべての列を更新します。また、影響を受けた行の数を返します。(Bulk Update)
ko: 기존 테이블에서 호환되는 DataTable을 업데이트합니다. 기본 키로 사용되는 열 이름의 컬렉션에 없는 모든 열을 업데이트합니다. 영향을 받는 행의 수를 반환합니다.
pt: Atualiza uma TabelaDeDados compatível numa Tabela existente. Irá atualizar todas as colunas que não fazem parte da coleção de nomes de colunas utilizados como chave principal. Devolve o número de linhas afetadas.
pt_br: Atualiza uma DataTable compatível em uma Tabela existente. Atualizará todas as colunas que não fazem parte do conjunto de nomes de coluna usado como chave primária. Retorna o número de linhas afetadas.
ru: Обновляет совместимый объект DataTable в существующей таблице. Обновляет все столбцы, которых нет в коллекции имен столбцов, используемых как основной ключ. Возвращает число затронутых строк.
tr: Mevcut bir Tablo'daki uyumlu DataTable'i güncelleştirir. Ana anahtar olarak kullanılan sütun adları koleksiyonunda yer almayan sütunları güncelleştirir. Etkilenen satır sayısını döndürür.
zh_cn: 在现有表格中更新兼容的数据表。将更新所有未在列名称集合中用作主键的列。返回受影响的行数。
zh_tw: 在現有資料表中更新相容的資料表。將更新所有未在欄名稱集合中用作主鍵的欄。傳回受影響的列數。
