Repository: UiPath/Community.Activities
Catalog: Activities/Database/UiPath.Database.Activities.Design/Properties/UiPath.Database.Activities.Design.*.resx
Languages: de, es, es_mx, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# AffectedRecordsDescription
source: The result of the execution of the sql command. For UPDATE, INSERT, and DELETE statements, the return value is the number of rows affected by the command. For all other types of statements, the return value is -1.
de: Das Ergebnis der Ausführung des SQL-Befehls. Bei den Anweisungen UPDATE, INSERT und DELETE ist der Rückgabewert die Anzahl der Zeilen, die vom Befehl betroffen sind. Für alle anderen Typen von Anweisungen ist der Rückgabewert -1.
es: El resultado de la ejecución del comando sql. Para las instrucciones UPDATE, INSERT y DELETE, el valor devuelto es el número de filas afectadas por el comando. Para todos los demás tipos de instrucciones, el valor devuelto es -1.
es_mx: El resultado de la ejecución del comando sql. Para las instrucciones ACTUALIZAR, INSERTAR y ELIMINAR, el valor devuelto es el número de filas afectadas por el comando. Para todos los demás tipos de instrucciones, el valor devuelto es -1.
fr: Résultat de l’exécution de la commande SQL. Pour les instructions UPDATE, INSERT et DELETE, la valeur renvoyée est le nombre de lignes affectées par la commande. Pour tous les autres types d’instructions, la valeur renvoyée est de -1.
ja: SQL コマンドの実行の結果です。UPDATE、INSERT、および DELETE ステートメントの場合、戻り値は、コマンドの影響を受けた行の数です。それら以外の種類のステートメントでは、戻り値はいずれも -1 です。
ko: SQL 명령의 실행 결과입니다. UPDATE, INSERT 및 DELETE 문의 경우, 반환 값은 명령에 의해 영향을 받는 행의 수입니다. 기타 모든 문에서는 -1이 반환됩니다.
pt: O resultado da execução do comando sql. Para as instruções UPDATE, INSERT e DELETE, o valor devolvido é o número de linhas afetadas pelo comando. Para todos os outros tipos de instruções, o valor devolvido é -1.
pt_br: O resultado da execução do comando sql. Para instruções ATUALIZAR, INSERIR e EXCLUIR, o valor de retorno é o número de linhas afetadas pelo comando. Para todos os outros tipos de instruções, o valor de retorno é -1.
ru: Результат выполнения команды sql. Для операторов UPDATE, INSERT и DELETE возвращаемым значением является число строк, на которые влияет данная команда. Для всех других типов операторов возвращаемое значение равно -1.
tr: SQL komutunun yürütülmesinin sonucu. UPDATE, INSERT ve DELETE deyimleri için dönüş değeri komutun etkilediği satır sayısıdır. Diğer tüm deyim türleri için dönüş değeri -1'dir.
zh_cn: SQL 命令的执行结果。对于 UPDATE、INSERT 和 DELETE 语句，返回值为该命令影响的行数。对于所有其他类型的语句，返回值均为 -1。
zh_tw: SQL 命令的執行結果。對於 UPDATE、INSERT 和 DELETE 陳述式，傳回值為該命令影響的列數。對於所有其他類型的陳述式，傳回值均為 -1。

# CategoryDatabase
source: Database
de: Datenbank
es: Base de datos
es_mx: Base de datos
fr: Base de données
ja: データベース
ko: 데이터베이스
pt: Base de dados
pt_br: Banco de dados
ru: База данных
tr: Veritabanı
zh_cn: 数据库
zh_tw: 資料庫

# CommandTypeDescription
source: Specifies how a command string is interpreted
de: Gibt an, wie eine Befehlszeichenfolge interpretiert wird
es: Especifica cómo se interpreta una cadena de comandos
es_mx: Especifica cómo se interpreta una cadena de comandos
fr: Indique la façon dont une chaîne de commande est interprétée
ja: コマンド文字列の解釈方法を指定します。
ko: 명령 문자열이 해석되는 방법을 지정합니다.
pt: Especifica como é interpretada uma cadeia de comando
pt_br: Especifica como uma string de comando é interpretada
ru: Указывает способ интерпретации командной строки
tr: Bir komut dizesinin nasıl yorumlanacağını belirtir
zh_cn: 指定命令字符串的解释方式
zh_tw: 指定命令字串的解釋方式

source: Connect
es_mx: Conectar
ja: 接続
ru: Подключить
zh_cn: 连接

# ConnectionStringDescription
source: The connection string used to establish a database connection
de: Die Verbindungszeichenfolge zum Aufbau einer Datenbankverbindung
es: La cadena de conexión utilizada para establecer una conexión con la base de datos
es_mx: La cadena de conexión utilizada para establecer una conexión a base de datos
fr: Chaîne de connexion utilisée pour se connecter à une base de données
ja: データベース接続の確立に使用する接続文字列です。
ko: 데이터베이스를 연결하기 위해 사용되는 연결 문자열
pt: A cadeia de ligação utilizada para estabelecer uma ligação de base de dados
pt_br: A string de conexão usada para estabelecer uma conexão de banco de dados
ru: Строка подключения, используемая для установления соединения с базой данных
tr: Veritabanı bağlantısı kurmak için kullanılan bağlantı dizesi
zh_cn: 用于建立数据库连接的连接字符串
zh_tw: 用於建立資料庫連線的連線字串

# DatabaseConnectDescription
source: Connects to a database.
de: Stellt eine Verbindung mit einer Datenbank her.
es: Se conecta a una base de datos
es_mx: Se conecta a una base de datos.
fr: Établit une connexion à une base de données.
ja: データベースに接続します。
ko: 데이터베이스에 연결합니다.
pt: Estabelece ligação a uma base de dados.
pt_br: Conecta-se a um banco de dados.
ru: Выполняет подключение к базе данных.
tr: Veritabanına bağlanır.
zh_cn: 连接到数据库。
zh_tw: 連接到資料庫。

# DatabaseConnectionDescription
source: The database connection used for the operations within this activity
de: Die Datenbankverbindung, die für die Vorgänge innerhalb dieser Aktivität verwendet wird
es: La conexión a la base de datos utilizada para las operaciones dentro de esta actividad
es_mx: La conexión de base de datos utilizada para las operaciones dentro de esta actividad
fr: Connexion à une base de données utilisée pour les opérations dans le cadre de cette activité
ja: このアクティビティ内での操作に使用するデータベース接続です。
ko: 이 액티비티 내의 작업에서 사용되는 데이터베이스 연결
pt: A ligação de base de dados utilizada para as operações nesta atividade
pt_br: A conexão de banco de dados usada para as operações dentro desta atividade
ru: Соединение с базой данных, используемое для операций в рамках этого действия
tr: Bu etkinlik içindeki işlemler için kullanılan veritabanı bağlantısı
zh_cn: 用于此活动所含操作的数据库连接
zh_tw: 用於此活動所含作業的資料庫連線

# DatabaseDisconnectDescription
source: Closes a connection to a database.
de: Schließt die Verbindung zu einer Datenbank.
es: Cierra una conexión a una base de datos.
es_mx: Cierra una conexión a una base de datos.
fr: Ferme une connexion à une base de données.
ja: データベースへの接続を閉じます。(Disconnect)
ko: 데이터베이스로의 연결을 끊습니다.
pt: Fecha uma ligação a uma base de dados.
pt_br: Encerra uma conexão com um banco de dados.
ru: Закрывает подключение к базе данных,
tr: Veritabanı bağlantısını kapatır.
zh_cn: 关闭数据库连接。
zh_tw: 關閉資料庫連線。

# DataTableDescription
source: The output of the sql command wrapped in a DataTable object
de: Die Ausgabe des SQL-Befehls, der in ein Datentabellenobjekt eingeschlossen ist
es: La salida del comando sql rodeado por un objeto DataTable
es_mx: La salida del comando sql envuelto en un objeto DataTable
fr: Le résultat de la commande SQL encapsulé dans un objet DataTable
ja: DataTable オブジェクトにラップした SQL コマンドの出力です。
ko: DataTable 객체에 래핑된 SQL 명령의 출력
pt: A saída do comando sql moldada num objeto TabelaDeDados
pt_br: A saída do comando sql envolvido em um objeto DataTable
ru: Результаты команды sql, "упакованной" в объект DataTable
tr: DataTable nesnesine sarılmış SQL komutunun çıkışı
zh_cn: 包含在“数据表”对象中的 SQL 命令输出
zh_tw: 包含在「資料表」物件中的 SQL 命令輸出

# DbTransactionDescription
source: Connects to a database and returns a DatabaseConnection, providing a scope for Database activities. If UseTransaction is set true, the contained operations are executed in a single transaction, and applied at the end if none of the them failed. If UseTransaction is set false, all operations are commited individualy. When this activity ends, the connection to the database is closed.
de: Stellt eine Verbindung mit einer Datenbank her und gibt eine Datenbankverbindung zurück, die einen Scope für Datenbankaktivitäten bereitstellt. Wenn TransaktionVerwenden auf „true“ gesetzt ist, werden die enthaltenen Vorgänge in einer einzelnen Transaktion ausgeführt und am Ende angewendet, wenn keine von ihnen fehlgeschlagen ist. Wenn TransaktionVerwenden auf „false“ gesetzt ist, werden alle Vorgänge einzeln ausgeführt. Wenn diese Aktivität beendet wird, wird die Verbindung zur Datenbank geschlossen.
es: Se conecta a una base de datos y devuelve una ConexiónABaseDeDatos, lo que proporciona un ámbito a las actividades de la base de datos. Si UtilizarTransacción se establece en Verdadero, las operaciones contenidas se ejecutarán en una sola transacción y se aplicarán al final si ninguna de ellas ha fallado. Si UtilizarTransacción se establece en Falso, todas las operaciones se confirmarán individualmente. Al finalizar esta actividad, se cerrará la conexión a la base de datos.
es_mx: Se conecta a una base de datos y devuelve un DatabaseConnection, lo que proporciona un ámbito para las actividades de base de datos. Si UseTransaction se establece como verdadero, las operaciones contenidas se ejecutan en una sola transacción y se aplican al final si no se ha producido un error en ninguna de ellas. Si UseTransaction se establece como falso, todas las operaciones se confirman individualmente. Cuando finaliza esta actividad, se cierra la conexión a la base de datos.
fr: Établit la connexion à une base de données et renvoie une connexion à une base de données (DatabaseConnection) en fournissant un cadre aux activités en lien avec la base de données. Si la propriété Utiliser une transaction (UseTransaction) est définie sur true, les opérations contenues sont exécutées dans une seule transaction et appliquées à la fin si aucune d’elles n’a échoué. Si la propriété Utiliser une transaction (UseTransaction) est définie sur false, toutes les opérations sont validées individuellement. Lorsque cette activité se termine, la connexion à la base de données prend fin.
ja: データベースに接続してデータベース接続を返し、データベース系アクティビティのスコープを提供します。[トランザクションを使用] をオンに設定している場合、含まれる操作は単一のトランザクションで実行され、どの操作も失敗しなければ最後に適用されます。[トランザクションを使用] をオフに設定している場合、すべての操作が個別にコミットされます。このアクティビティが終了すると、データベースへの接続が終了します。(Start Transaction)
ko: 데이터베이스를 연결하고 DatabaseConnection을 반환하여 데이터베이스 액티비티에 대한 범위를 제공합니다. UseTransaction가 True로 설정되면 포함된 작업이 단일 트랜잭션에서 실행되며 실패한 작업이 없는 경우 마지막에 적용됩니다. UseTransaction가 False로 설정되면 모든 작업이 개별적으로 커밋됩니다. 이 액티비티가 종료되면 데이터베이스로의 연결이 끊깁니다.
pt: Estabelece ligação a uma base de dados e devolve uma LigaçãoBaseDeDados, fornecendo um âmbito para atividades de Base de dados. Se UtilizarTransação for definido como verdadeiro, as operações contidas são executadas numa única transação e aplicadas no final, se nenhuma delas falhar. Se UtilizarTransação for definido como falso, todas as operações são consolidadas individualmente. Quando esta atividade termina, a ligação à base de dados é fechada.
pt_br: Conecta-se a um banco de dados e retorna uma DatabaseConnection, fornecendo um escopo para as atividades de Banco de dados. Se UseTransaction estiver definido como verdadeiro, as operações contidas serão executadas em uma única transação e aplicadas no final, se nenhuma delas falhar. Se UseTransaction estiver definido como falso, todas as operações serão confirmadas individualmente. Quando esta atividade termina, a conexão com o banco de dados é encerrada.
ru: Выполняет подключение к базе данных и возвращает параметр DatabaseConnection, предоставляя область для действий Database. Если параметр UseTransaction имеет значение true ("истинно"), то связанные операции выполняются в виде одной транзакции и применяются в конце, если ни одна из них не завершилась ошибкой. Если параметр UseTransaction имеет значение false ("ложно"), все операции выполняются индивидуально. По завершении этого действия соединение с базой данных закрывается.
tr: Bir veritabanına bağlanır ve bir Databaseconnection döndürerek Veritabanı etkinlikleri için bir kapsam sağlar. UseTransaction doğru olarak ayarlanırsa içerdiği işlemler tek bir işlemle yürütülür ve hiçbiri başarısız olmazsa sonunda uygulanır. UseTransaction yanlış olarak ayarlanırsa tüm işlemler ayrı ayrı tamamlanır. Bu etkinlik sona erdiğinde veritabanı bağlantısı kapatılır.
zh_cn: 连接到数据库并返回“数据库连接”，为数据库活动提供作用域。如果将“使用事务”设为 Ture，所含操作将在单个事务中执行，并在最后应用 (如果所有操作均未失败)。如果将“使用事务”设为 False，则会单独执行所有操作。该活动结束后，系统便会关闭数据库连接。
zh_tw: 連接到資料庫並傳回「資料庫連線」，為資料庫活動提供範圍。如果將「使用交易」設為 Ture，所含作業將在單一交易中執行，並在最後套用 (如果所有作業均未失敗)。如果將「使用交易」設為 False，則會單獨執行所有作業。該活動結束後，系統便會關閉資料庫連線。

source: Disconnect
ja: 切断
ru: Отключить
zh_cn: 断开连接

# ExecuteNonQueryDescription
source: Executes a SQL statement on a database. For UPDATE, INSERT, and DELETE statements, the return value is the number of rows affected by the command. For all other types of statements, the return value is -1.
de: Führt eine SQL-Anweisung für eine Datenbank aus. Bei den Anweisungen UPDATE, INSERT und DELETE ist der Rückgabewert die Anzahl der Zeilen, die vom Befehl betroffen sind. Für alle anderen Typen von Anweisungen ist der Rückgabewert -1.
es: Ejecuta una instrucción SQL en una base de datos. Para las instrucciones UPDATE, INSERT y DELETE, el valor devuelto es el número de filas afectadas por el comando. Para todos los demás tipos de instrucciones, el valor devuelto es -1.
es_mx: Ejecuta una instrucción SQL en una base de datos. Para las instrucciones ACTUALIZAR, INSERTAR y ELIMINAR, el valor devuelto es el número de filas afectadas por el comando. Para todos los demás tipos de instrucciones, el valor devuelto es -1.
fr: Exécute une instruction SQL sur une base de données. Pour les instructions UPDATE, INSERT et DELETE, la valeur renvoyée est le nombre de lignes affectées par la commande. Pour tous les autres types d’instructions, la valeur renvoyée est de -1.
ja: データベースに対して SQL ステートメントを実行します。UPDATE、INSERT、および DELETE ステートメントの場合、戻り値は、コマンドの影響を受けた行の数です。それら以外の種類のステートメントでは、戻り値はいずれも -1 です。(Execute Non Query)
ko: 데이터베이스에서 SQL 문을 실행합니다. UPDATE, INSERT 및 DELETE 문의 경우, 반환 값은 명령에 의해 영향을 받는 행의 수입니다. 기타 모든 문에서는 -1이 반환됩니다.
pt: Executa uma instrução SQL numa base de dados. Para as instruções UPDATE, INSERT e DELETE, o valor devolvido é o número de linhas afetadas pelo comando. Para todos os outros tipos de instruções, o valor devolvido é -1.
pt_br: Executa uma instrução SQL em um banco de dados. Para instruções ATUALIZAR, INSERIR e EXCLUIR, o valor de retorno é o número de linhas afetadas pelo comando. Para todos os outros tipos de instruções, o valor de retorno é -1.
ru: Выполняет оператор SQL в базе данных. Для операторов UPDATE, INSERT и DELETE возвращаемым значением является число строк, на которые влияет данная команда. Для всех других типов операторов возвращаемое значение равно -1.
tr: Veritabanında bir SQL deyimi yürütür. UPDATE, INSERT ve DELETE deyimleri için dönüş değeri komutun etkilediği satır sayısıdır. Diğer tüm deyim türleri için dönüş değeri -1'dir.
zh_cn: 对数据库执行 SQL 语句。对于 UPDATE、INSERT 和 DELETE 语句，返回值为该命令影响的行数。对于所有其他类型的语句，返回值均为 -1。
zh_tw: 對資料庫執行 SQL 陳述式。對於 UPDATE、INSERT 和 DELETE 陳述式，傳回值為該命令影響的列數。對於所有其他類型的陳述式，傳回值均為 -1。

# ExecuteQueryDescription
source: Executes a query on a database and returns and the query result in a Data Table.
de: Führt eine Abfrage in einer Datenbank aus und gibt das Abfrageergebnis in einer Datentabelle zurück.
es: Ejecuta una consulta en una base de datos y devuelve el resultado de la consulta en forma de tabla de datos.
es_mx: Ejecuta una consulta en una base de datos y devuelve la consulta resuelta en una tabla de datos.
fr: Exécute une requête sur une base de données et renvoie le résultat de la requête dans une table de données.
ja: データベースに対してクエリを実行し、クエリの結果をデータテーブルとして返します。(Execute Query)
ko: 데이터베이스에서 쿼리를 실행하고 데이터 테이블의 쿼리 결과를 반환합니다.
pt: Executa uma consulta numa base de dados e devolve o resultado da consulta numa Tabela de dados.
pt_br: Executa uma consulta em um banco de dados e retorna o resultado da consulta em uma Tabela de Dados.
ru: Выполняет запрос к базе данных и возвращает результат запроса в таблицу данных.
tr: Veritabanında bir sorgu yürütür ve sorgu sonucunu Veri Tablosu olarak döndürür.
zh_cn: 对数据库执行查询，即可在数据表中返回查询结果。
zh_tw: 對資料庫執行查詢，即可在資料表中傳回查詢結果。

# ExistingDbConnectionDescription
source: An already opened database connection. If this property is set Connection String and Provider Name properties are ignored
de: Eine bereits geöffnete Datenbankverbindung. Wenn diese Eigenschaft festgelegt ist, werden die Eigenschaften „Verbindungszeichenfolge“ und „Name des Anbieters“ ignoriert.
es: Ya hay una conexión de base de datos abierta. Si esta propiedad está activa, se omitirán las propiedades Cadena de conexión y Nombre del proveedor
es_mx: Una conexión de base de datos ya abierta. Si esta propiedad se establece, se omiten las propiedades Cadena de conexión y Nombre de proveedor
fr: Connexion à une base de données déjà établie. Si cette propriété est définie, les propriétés Chaîne de connexion (Connection String) et Nom du fournisseur (Provider Name) sont ignorées.
ja: 既に開かれているデータベース接続です。このプロパティを設定した場合は、[接続文字列] と [プロバイダー名] プロパティは無視されます。
ko: 이미 열린 데이터베이스 연결입니다. 이 속성이 연결 문자열로 설정되면 제공자 이름 속성이 무시됩니다.
pt: Uma ligação de base de dados já aberta. Se esta propriedade estiver definida, as propriedades Cadeia de Ligação e Nome do Fornecedor são ignoradas
pt_br: Uma conexão de banco de dados já aberta. Se esta propriedade estiver configurada, as propriedades Connection String e Provider Name serão ignoradas
ru: Уже открытое подключение к базе данных. Если задано это свойство, свойства Строка подключения и Имя провайдера игнорируются
tr: Zaten açılmış bir veritabanı bağlantısı. Bu özellik ayarlanırsa Bağlantı Dizesi ve Sağlayıcı Adı özellikleri yok sayılır
zh_cn: 已打开的数据库连接。如果将此属性设置为“连接字符串”，则会忽略“提供程序名称”属性
zh_tw: 已開啟的資料庫連線。如果將此屬性設定為「連線字串」，則會忽略「提供者名稱」屬性

source: Insert
ja: 挿入
zh_cn: 插入

# InsertDataTableDescription
source: Inserts a compatible DataTable in a existing Table. Returns the number of rows affected.
de: Fügt eine kompatible Datentabelle in eine vorhandene Tabelle ein. Gibt die Anzahl der betroffenen Zeilen zurück.
es: Inserta una TablaDeDatos compatible en una tabla existente. Devuelve el número de filas afectadas.
es_mx: Inserta una tabla de datos compatible en una tabla existente. Devuelve el número de filas afectadas.
fr: Insère un objet DataTable compatible dans un objet Table existant. Renvoie le nombre de lignes affectées.
ja: 既存のテーブルに対応するデータテーブルを挿入します。また、影響を受けた行の数を返します。(Insert)
ko: 기존 테이블에서 호환되는 DataTable을 삽입합니다. 영향을 받는 행의 수를 반환합니다.
pt: Insere uma TabelaDeDados compatível numa Tabela existente. Devolve o número de linhas afetadas.
pt_br: Insere uma DataTable compatível em uma Tabela existente. Retorna o número de linhas afetadas.
ru: Вставляет совместимый объект DataTable в существующую таблицу Table. Возвращает число затронутых строк.
tr: Varolan bir Tabloya uyumlu bir DataTable ekler. Etkilenen satır sayısını döndürür.
zh_cn: 在现有表格中插入兼容的数据表。返回受影响的行数。
zh_tw: 在現有資料表中插入相容的資料表。傳回受影響的列數。

# ParametersDescription
source: A dictionary of named parameters that are bound to the sql command. The binding is done by specifying the '@parameterName' statement in the sql command. At runtime the parameterName will be replaced with its value from the dictionary
de: Ein Wörterbuch benannter Parameter, die an den SQL-Befehl gebunden sind. Die Bindung erfolgt durch Angabe der Anweisung „@parameterName“ im SQL-Befehl. Zur Laufzeit wird „parameterName“ durch seinen Wert aus dem Wörterbuch ersetzt.
es: Un diccionario de parámetros con nombre enlazados al comando sql. El enlace se realiza especificando la instrucción '@nombreDelParámetro' en el comando sql. Durante el runtime, se reemplazará nombreDelParámetro por su valor en el diccionario
es_mx: Diccionario de parámetros con nombre enlazados al comando sql. El enlace se realiza especificando la instrucción "@parameterName" en el comando sql. En tiempo de ejecución, parameterName se reemplazará por su valor del diccionario
fr: Dictionnaire de paramètres nommés liés à la commande SQL. La liaison s’effectue en spécifiant l’instruction « @parameterName » dans la commande SQL. Lors de l’exécution, parameterName sera remplacé par sa valeur dans le dictionnaire.
ja: SQL コマンドにバインドされた名前付きパラメーターのディクショナリです。バインドするには、SQL コマンドで '@parameterName' ステートメントを指定します。実行時に、parameterName がディクショナリからの値に置き換えられます。
ko: SQL 명령으로 바인딩된 이름이 지정된 파라미터의 딕셔너리입니다. 바인딩은 SQL 명령에 '@parameterName' 문을 지정하여 수행됩니다. 런타임 시에 parameterName이 딕셔너리의 값으로 대체됩니다.
pt: Um dicionário de parâmetros nomeados que estão vinculados ao comando sql. A vinculação é feita ao especificar a instrução "@parameterName" no comando sql. No runtime, parameterName será substituído pelo respetivo valor do dicionário.
pt_br: Um dicionário de parâmetros nomeados que estão vinculados ao comando sql. A vinculação é feita especificando a instrução '@parameterName' no comando sql. Em tempo de execução, o parameterName será substituído por seu valor do dicionário
ru: Справочник именованных параметров, связанных с командой sql. Привязка выполняется путем указания оператора "@parameterName" в команде sql. Во время выполнения параметр parameterName будет заменен его значением из справочника.
tr: SQL komutuna bağlı adlandırılmış parametreleri içeren bir sözlük. Bağlama, SQL komutunda '@parameterName' deyimi belirtilerek yapılır. Çalışma zamanında parametreName sözlükten gelen değeriyle değiştirilir
zh_cn: 绑定到 SQL 命令的命名参数字典。可通过在 SQL 命令中指定 "@parameterName" 语句以完成绑定。在运行时，“参数名称”将替换为其在字典中的对应值
zh_tw: 繫結到 SQL 命令的具名參數字典。可透過在 SQL 命令中指定 "@parameterName" 陳述式以完成繫結。在執行階段時，「參數名稱」將取代為其在字典中的值

# ProviderNameDescription
source: The name of the database provider used to access the database. A list of Data Providers can be found at http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx
de: Der Name des Datenbankanbieters, der für den Zugriff auf die Datenbank verwendet wird. Eine Liste der Datenanbieter finden Sie unter http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx.
es: El nombre del proveedor de la base de datos utilizado para tener acceso a la base de datos. Puede encontrar una lista de proveedores de datos en http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx
es_mx: El nombre del proveedor de base de datos utilizado para tener acceso a la base de datos. Puede encontrar una lista de proveedores de datos en http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx
fr: Nom du fournisseur de base de données utilisé pour accéder à la base de données. Une liste des fournisseurs de données est disponible à l’adresse suivante : https://docs.microsoft.com/fr-fr/previous-versions/dotnet/netframework-4.0/a6cd7c08(v=vs.100)?redirectedfrom=MSDN
ja: データベースへのアクセスに使用するデータベース プロバイダーの名前です。データ プロバイダーの一覧は次のページから確認できます: http://msdn.microsoft.com/ja-jp/library/a6cd7c08(v=vs.100).aspx
ko: 데이터베이스에 액세스하기 위해 사용되는 데이터베이스 제공자의 이름입니다. 전체 데이터 제공자는 http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx에서 확인할 수 있습니다.
pt: O nome do fornecedor de base de dados utilizado para aceder à base de dados. Pode encontrar uma lista de Fornecedores de Dados em http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx
pt_br: O nome do provedor usado para acessar o banco de dados. Uma lista de Provedores de Dados pode ser encontrada em http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx
ru: Имя провайдера базы данных, используемое для доступа к базе данных. Список провайдеров данных можно найти на странице http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx
tr: Veritabanına erişmek için kullanılan veritabanı sağlayıcısının adı. Veri Sağlayıcılarının listesi http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx adresinde bulunabilir
zh_cn: 用于访问数据库的数据库提供程序的名称。数据提供程序列表详见 http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx
zh_tw: 用於存取資料庫的資料庫提供者的名稱。資料提供者清單詳見 http://msdn.microsoft.com/en-us/library/a6cd7c08(v=vs.100).aspx

# SqlDescription
source: A sql command to be executed.
de: SQL-Anweisung angeben, die dem ausgewählten Befehlstyp entspricht
es: Proporcionar una instrucción SQL que corresponda al tipo de comando seleccionado
es_mx: Un comando sql que se ejecutará.
fr: Commande SQL à exécuter.
ja: 実行する SQL コマンドです。
ko: 실행될 SQL 명령입니다.
pt: Um comando sql a ser executado.
pt_br: Um comando sql a ser executado.
ru: Команда sql для выполнения.
tr: Seçili komut türüne karşılık gelen bir SQL ifadesi sağlayın
zh_cn: 要执行的 SQL 命令。
zh_tw: 要執行的 SQL 命令。

source: Start Transaction
ja: トランザクションを開始
zh_cn: 开始事务
