Repository: UiPath/Community.Activities
Catalog: Activities/Database/ConnectionDialog/UiPath.Data.ConnectionUI.Dialog/Properties/UiPath.Data.ConnectionUI.Dialog.*.resx
Languages: de, es_mx, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# OracleConnectionUIHostname_Label
source: Hostname:
es_mx: Nombre de anfitrión:
fr: Nom d’hôte :
ja: ホスト名:
ko: 호스트 이름:
pt: Nome de anfitrião:
pt_br: Nome do host:
ru: Имя хоста:
tr: Ana bilgisayar adı:
zh_cn: 主机名:
zh_tw: 主機名稱:

# OracleConnectionUIPort_Label
source: Port:
es_mx: Puerto:
ja: ポート:
ko: 포트:
pt: Porta:
pt_br: Porta:
ru: Порт:
tr: Bağlantı noktası:
zh_cn: 端口:
zh_tw: 連接埠:

# OracleConnectionUIService_Label
source: Service name:
de: Dienstname:
es_mx: Nombre del servicio:
fr: Nom du service :
ja: サービス名:
ko: 서비스 이름:
pt: Nome do serviço:
pt_br: Nome do serviço:
ru: Имя сервиса:
tr: Hizmet adı:
zh_cn: 服务名称:
zh_tw: 服務名稱:

# Password_Label
source: Password:
de: Kennwort:
es_mx: Contraseña:
fr: Mot de passe :
ja: パスワード:
ko: 암호:
pt: Palavra-passe:
pt_br: Senha:
ru: Пароль:
tr: Parola:
zh_cn: 密码:
zh_tw: 密碼:

# Refresh_Label
source: Refresh
de: Aktualisieren
es_mx: Actualizar
fr: Actualiser
ja: 更新
ko: 새로 고침
pt: Atualizar
pt_br: Atualizar
ru: Обновить
tr: Yenile
zh_cn: 刷新
zh_tw: 重新整理

# SavePassword_Label
source: Save my password
de: Mein Kennwort speichern
es_mx: Guardar mi contraseña
fr: Enregistrer mon mot de passe
ja: パスワードを保存
ko: 내 암호 저장
pt: Guardar a minha palavra-passe
pt_br: Salvar minha senha
ru: Сохранить мой пароль
tr: Parolamı kaydet
zh_cn: 保存我的密码
zh_tw: 儲存我的密碼

# Server_Label
source: Server name:
es_mx: Nombre del servidor:
fr: Nom du serveur :
ja: サーバー名:
ko: 서버 이름:
pt: Nome do servidor:
pt_br: Nome do servidor:
ru: Имя сервера:
tr: Sunucu adı:
zh_cn: 服务器名称:
zh_tw: 伺服器名稱:

# SQLAuthentication_Label
source: Use SQL Server authentication
de: SQL Server-Authentifizierung verwenden
es_mx: Utilice la autenticación de SQL Server
fr: Utiliser l’authentification SQL Server
ja: SQL Server 認証を使用
ko: SQL Server 인증 사용
pt: Utilizar autenticação do SQL Server
pt_br: Usar autenticação do SQL Server
ru: Используйте проверку подлинности SQL Server
tr: SQL Server kimlik doğrulamasını kullan
zh_cn: 使用 SQL Server 身份验证
zh_tw: 使用 SQL Server 驗證

# SqlConnectionProperties_CannotTestNonExistentDatabase
source: This connection cannot be tested because the specified database does not exist or is not visible to the specified user.
de: Diese Verbindung kann nicht getestet werden, da die angegebene Datenbank nicht vorhanden ist oder für den angegebenen Benutzer nicht sichtbar ist.
es_mx: Esta conexión no se puede probar porque la base de datos especificada no existe o no puede verla el usuario especificado.
fr: Cette connexion ne peut pas être testée, car la base de données spécifiée n’existe pas ou n’est pas visible par l’utilisateur spécifié.
ja: 指定したデータベースが存在しないか、または指定したユーザーに対して表示されないため、この接続をテストできません。
ko: 지정된 데이터베이스가 없거나 지정된 사용자에게 표시되지 않으므로 이 연결을 테스트할 수 없습니다.
pt: Não é possível testar esta ligação porque a base de dados especificada não existe ou não é visível ao utilizador especificado.
pt_br: Essa conexão não pode ser testada porque o banco de dados especificado não existe ou não está visível para o usuário selecionado.
ru: Это соединение не может быть протестировано, поскольку указанная база данных не существует или не отображается для указанного пользователя.
tr: Belirtilen veritabanı olmadığından veya belirtilen kullanıcı tarafından görülmediğinden bu bağlantı test edilemez.
zh_cn: 此连接无法测试，因为指定的数据库不存在或对指定用户不可见。
zh_tw: 此連線無法測試，因為指定的資料庫不存在或對指定使用者不可見。

# SqlConnectionProperties_MustSpecifyDataSource
source: This connection cannot be tested because no server name has been specified.
de: Diese Verbindung kann nicht getestet werden, da kein Servername angegeben wurde.
es_mx: Esta conexión no se puede probar porque no se especificó ningún nombre de servidor.
fr: Cette connexion ne peut pas être testée, car aucun nom de serveur n’a été spécifié.
ja: サーバー名が指定されていないため、この接続をテストできません。
ko: 서버 이름이 지정되지 않았으므로 이 연결을 테스트할 수 없습니다.
pt: Não é possível testar esta ligação porque não foi especificado qualquer nome de servidor.
pt_br: Essa conexão não pode ser testada porque nenhum nome de servidor foi especificado.
ru: Это соединение не может быть протестировано, поскольку имя сервера не указано.
tr: Sunucu adı belirtilmediğinden bu bağlantı test edilemez.
zh_cn: 无法测试此连接，因为未指定服务器名称。
zh_tw: 無法測試此連線，因為未指定伺服器名稱。

# SqlFileConnectionUIControl_InvalidConnectionProperties
source: The connection properties object must be of type SqlFileConnectionProperties.
de: Das Verbindungseigenschaftenobjekt muss vom Typ „SqlFileConnectionProperties“ sein.
es_mx: El objeto de propiedades de conexión debe ser del tipo SqlFileConnectionProperties.
fr: L’objet des propriétés de connexion doit être de type SqlFileConnectionProperties.
ja: 接続プロパティ オブジェクトは、SqlFileConnectionProperties 型である必要があります。
ko: 연결 속성 개체는 SqlFileConnectionProperties 유형이어야 합니다.
pt: O objeto de propriedades de ligação tem de ser do tipo SqlFileConnectionProperties.
pt_br: O objeto de propriedades da conexão deve ser do tipo SqlFileConnectionProperties.
ru: Типом объекта свойств подключения должен быть SqlFileConnectionProperties.
tr: Bağlantı özellikleri nesnesi OdbcConnectionProperties türünde olmalıdır.
zh_cn: 连接属性对象的类型必须为 SqlFileConnectionProperties。
zh_tw: 連線屬性物件的類型必須為 SqlFileConnectionProperties。

# TestConnection_Label
source: Test connection
de: Testverbindung
es_mx: Conexión de prueba
fr: Connexion de test
ja: テスト接続
ko: 연결 테스트
pt: Testar ligação
pt_br: Testar Conexão
ru: Проверить соединение
tr: Test Bağlantısı
zh_cn: 测试连接
zh_tw: 測試連線

# Username_Label
source: User name:
de: Benutzername:
es_mx: Nombre de usuario:
ja: ユーザー名:
ko: 사용자 이름:
pt: Nome de utilizador:
pt_br: Nome de usuário:
ru: Имя пользователя:
tr: Kullanıcı adı:
zh_cn: 用户名:
zh_tw: 使用者名稱:

# WindowsAuthentication_Label
source: Use Windows authentication
de: Windows-Authentifizierung verwenden
es_mx: Use la autenticación de Windows
fr: Utiliser l’authentification Windows
ja: Windows 認証を使用
ko: Windows 인증 사용
pt: Utilizar autenticação do Windows
pt_br: Usar autenticação do Windows
ru: Использовать проверку подлинности Windows
tr: Windows kimlik doğrulamasını kullan
zh_cn: 使用 Windows 身份验证
zh_tw: 使用 Windows 驗證

# DataProvider_OleDB_Short
source: OLE DB
fr: Base de données OLE

# DataProvider_Oracle_Short
source: OracleClient
fr: Client Oracle
zh_cn: Oracle 客户端
zh_tw: Oracle 用戶端

# DataSource_MicrosoftSqlServer
source: Microsoft SQL Server
fr: Serveur Microsoft SQL

# DataProvider_Sql_Short
source: SqlClient
zh_cn: SQL 客户端
zh_tw: SQL 用戶端
