Repository: UiPath/Community.Activities
Catalog: Activities/Database/ConnectionDialog/UiPath.Data.ConnectionUI.Dialog/Properties/UiPath.Data.ConnectionUI.Dialog.*.resx
Languages: de, es_mx, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# AccessConnectionUIControl_BrowseFileFilter
source: Microsoft Access Databases (*.mdb;*.accdb)|*.mdb;*.accdb|All Files (*.*)|*.*
de: Microsoft Access-Datenbanken (*.mdb;*.accdb)|*.mdb;*.accdb| Alle Dateien (*.*)|*.*
es_mx: Bases de datos de Microsoft Access (*.mdb;*.accdb)|*.mdb;*.accdb| Todo los archivos (*.*)|*.*
fr: Bases de données Microsoft Access (*.mdb;*.accdb)|*.mdb;*.accdb|Tous les fichiers (*.*)|*.*
ja: Microsoft Access データベース (*.mdb;*.accdb)|*.mdb;*.accdb|すべてのファイル (*.*)|*.*
ko: Microsoft Access 데이터베이스(*.mdb;*.accdb)|*.mdb;*.accdb|모든 파일(*.*)|*.*
pt: Bases de Dados do Microsoft Access (*.mdb;*.accdb)|*.mdb;*.accdb|Todos os ficheiros (*.*)|*.*
pt_br: Bancos de Dados do Microsoft Access (*.mdb;*.accdb)|*.mdb;*.accdb|Todos os arquivos (*.*)|*.*
ru: Базы данных Microsoft Access (*.mdb;*.accdb)|*.mdb;*.accdb|Все файлы (*.*)|*.*
tr: Microsoft Access Veritabanları (*.mdb;*.accdb)|*.mdb;*.accdb|Tüm Dosyalar (*.*)|*.*
zh_cn: Microsoft Access 数据库 (*.mdb、*.accdb)|*.mdb、*.accdb|所有文件 (*.*)|*.*
zh_tw: Microsoft Access 資料庫 (*.mdb、*.accdb)|*.mdb、*.accdb|所有檔案 (*.*)|*.*

# AccessConnectionUIControl_BrowseFileTitle
source: Select Microsoft Access Database File
de: Microsoft Access-Datenbankdatei auswählen
es_mx: Seleccione archivo de base de datos de Microsoft Access
fr: Sélectionnez le fichier de base de données Microsoft Access
ja: Microsoft Access データベース ファイルを選択
ko: Microsoft Access 데이터베이스 파일 선택
pt: Selecionar Ficheiro da Base de Dados do Microsoft Access
pt_br: Selecionar o arquivo do Banco de Dados do Microsoft Access
ru: Выберите файл базы данных Microsoft Access
tr: Microsoft Access Veritabanı Dosyasını Seç
zh_cn: 选择 Microsoft Access 数据库文件
zh_tw: 選取 Microsoft Access 資料庫檔案

# AccessConnectionUIControl_InvalidConnectionProperties
source: The connection properties object must be of type OleDBAccessConnectionProperties.
de: Das Verbindungseigenschaftenobjekt muss vom Typ „OleDBAccessConnectionProperties“ sein.
es_mx: El objeto de propiedades de conexión debe ser del tipo OleDBAccessConnectionProperties.
fr: L’objet des propriétés de connexion doit être de type OleDBAccessConnectionProperties.
ja: 接続プロパティ オブジェクトは、OleDBAccessConnectionProperties 型である必要があります。
ko: 연결 속성 개체는 OleDBAccessConnectionProperties 유형이어야 합니다.
pt: O objeto de propriedades de ligação tem de ser do tipo OleDBAccessConnectionProperties.
pt_br: O objeto de propriedades da conexão deve ser do tipo OleDBAccessConnectionProperties.
ru: Типом объекта свойств подключения должен быть OleDBAccessConnectionProperties.
tr: Bağlantı özellikleri nesnesi OleDBAccessConnectionProperties türünde olmalıdır.
zh_cn: 连接属性对象的类型必须为 OleDBAccessConnectionProperties。
zh_tw: 連線屬性物件的類型必須為 OleDBAccessConnectionProperties。

# AdoDotNetConnectionProperties_NoProperties
source: No connection properties have been set.
de: Es wurden keine Verbindungseigenschaften festgelegt.
es_mx: No se establecieron propiedades de conexión.
fr: Aucune propriété de connexion n’a été définie.
ja: 接続プロパティが設定されていません。
ko: 연결 속성이 설정되지 않았습니다.
pt: Não foram definidas propriedades de ligação.
pt_br: Nenhuma propriedade de conexão enviada.
ru: Свойства подключения не установлены.
tr: Bağlantı özellikleri ayarlanmadı.
zh_cn: 未设置任何连接属性。
zh_tw: 未設定任何連線屬性。

source: Advanced Properties
de: Erweiterte Eigenschaften
es_mx: Propiedades avanzadas
fr: Propriétés avancées
ja: 詳細プロパティ
ko: 고급 속성
pt: Propriedades avançadas
pt_br: Propriedades avançadas
ru: Расширенные свойства
tr: Gelişmiş Özellikler
zh_cn: 高级属性
zh_tw: 進階屬性

# Advanced_Label
source: Advanced...
de: Erweitert…
es_mx: Avanzado...
fr: Avancé...
ja: 詳細...
ko: 고급...
pt: Avançado...
pt_br: Avançado...
ru: Дополнительно...
tr: Gelişmiş...
zh_cn: 高级...
zh_tw: 進階...

# AttachRadio_Label
source: Attach a database file:
de: Datenbankdatei anhängen:
es_mx: Adjunte un archivo de base de datos:
fr: Joindre un fichier de base de données :
ja: データベース ファイルを添付:
ko: 데이터베이스 파일 첨부:
pt: Anexar um ficheiro da base de dados:
pt_br: Anexe um arquivo de banco de dados:
ru: Прикрепить файл базы данных:
tr: Bir veritabanı dosyası ekleyin:
zh_cn: 附加数据库文件:
zh_tw: 附加資料庫檔案:

# BrowseButton_Label
source: Browse...
de: Durchsuchen…
es_mx: Explorar...
fr: Parcourir...
ja: 参照...
ko: 찾아보기...
pt: Procurar...
pt_br: Pesquisar...
ru: Обзор...
tr: Gözat...
zh_cn: 浏览...
zh_tw: 瀏覽...

# BuildButton_Label
source: Build...
de: Erstellen…
es_mx: Crear...
fr: Générer...
ja: 構築...
ko: 빌드...
pt: Criar...
pt_br: Criar...
ru: Создать...
tr: Oluştur...
zh_cn: 构建…
zh_tw: 建立...

source: Choose Data Source
de: Datenquelle wählen
es_mx: Elegir origen de datos
fr: Choisir la source de données
ja: データ ソースを選択
ko: 데이터 소스 선택
pt: Escolher Origem de Dados
pt_br: Selecionar fonte de dados
ru: Выбрать источник данных
tr: Veri Kaynağı Seç
zh_cn: 选择数据源
zh_tw: 選擇資料來源

source: Connection Properties
de: Verbindungseigenschaften
es_mx: Propiedades de conexión
fr: Propriétés de la connexion
ja: 接続プロパティ
ko: 연결 속성
pt: Propriedades de Ligação
pt_br: Propriedades da Conexão
ru: Свойства соединения
tr: Bağlantı Özellikleri
zh_cn: 连接属性
zh_tw: 連線屬性

# ConnectToDb_Label
source: Connect to a database
de: Verbindung mit einer Datenbank herstellen
es_mx: Conectarse a una base de datos
fr: Établir une connexion à une base de données
ja: データベースに接続
ko: 데이터베이스에 연결
pt: Ligar a uma base de dados
pt_br: Conectar a um banco de dados
ru: Подключиться к базе данных
tr: Bir veritabanına bağlan
zh_cn: 连接到数据库
zh_tw: 連接到資料庫

# ConnStringSpec_Label
source: Use connection string:
de: Verbindungszeichenfolge verbinden:
es_mx: Utilice la cadena de conexión:
fr: Utiliser la chaîne de connexion :
ja: 接続文字列を使用:
ko: 연결 문자열 사용:
pt: Utilizar cadeia de ligação:
pt_br: Usar strings de conexão:
ru: Использовать строку подключения:
tr: Bağlantı dizesi kullan:
zh_cn: 使用连接字符串:
zh_tw: 使用連線字串:

# DatabaseFileBrowseFilter
source: Microsoft SQL Server Databases (*.mdf)|*.mdf|All files (*.*)|*.*
de: Microsoft SQL Server-Datenbanken (*.mdf)|*.mdf| Alle Dateien (*.*)|*.*
es_mx: Bases de datos de Microsoft SQL Server (*.mdf)|*.mdf|Todos los archivos (*.*)|*.*
fr: Bases de données Microsoft SQL Server (*.mdf)|*.mdf|Tous les fichiers (*.*)|*.*
ja: Microsoft SQL Server データベース (*.mdf)|*.mdf|すべてのファイル (*.*)|*.*
ko: Microsoft SQL Server 데이터베이스(*.mdf)|*.mdf|모든 파일(*.*)|*.*
pt: Bases de Dados do Microsoft SQL Server (*.mdf)|*.mdf|Todos os ficheiros (*.*)|*.*
pt_br: Bancos de Dados do Microsoft SQL Server (*.mdf)|*.mdf|Todos os arquivos (*.*)|*.*
ru: Базы данных Microsoft SQL Server (*.mdf)|*.mdf|Все файлы (*.*)|*.*
tr: Microsoft SQL Server Veritabanları (*.mdf)|*.mdf|Tüm dosyalar (*.*)|*.*
zh_cn: Microsoft SQL Server 数据库 (*.mdf)|*.mdf|所有文件 (*.*)|*.*
zh_tw: Microsoft SQL Server 資料庫 (*.mdf)|*.mdf|所有檔案 (*.*)|*.*

# DatabaseRadio_Label
source: Select or enter a database name:
de: Datenbanknamen auswählen oder eingeben:
es_mx: Seleccione o ingrese un nombre de base de datos:
fr: Sélectionnez ou saisissez un nom de base de données :
ja: データベース名を選択または入力:
ko: 데이터베이스 이름 선택 또는 입력:
pt: Selecionar ou introduzir o nome de uma base de dados:
pt_br: Selecione ou insira um nome de banco de dados:
ru: Выберите или введите имя базы данных:
tr: Bir veritabanı adı seçin veya girin:
zh_cn: 选择或输入数据库名称:
zh_tw: 選取或輸入資料庫名稱:

# DataConnectionDialog_TestConnectionSucceeded
source: Test connection succeeded.
de: Testverbindung erfolgreich.
es_mx: La conexión de prueba se realizó correctamente.
fr: Test de connexion réussi.
ja: テスト接続に成功しました。
ko: 연결 테스트에 성공했습니다.
pt: Teste da ligação com êxito.
pt_br: Conexão de teste bem-sucedida.
ru: Тестовое соединение выполнено.
tr: Test bağlantısı başarılı oldu.
zh_cn: 测试连接已成功。
zh_tw: 測試連線已成功。

# DataLinks_Label
source: Data Links...
de: Datenlinks…
es_mx: Enlaces de datos...
fr: Liens de données...
ja: データのリンク...
ko: 데이터 링크...
pt: Ligações de Dados...
pt_br: Links de dados...
ru: Ссылки на данные...
tr: Veri Bağlantıları...
zh_cn: 数据链接…
zh_tw: 資料連結...

# DataProvider_Label
source: Data provider:
de: Datenanbieter:
es_mx: Proveedor de datos:
fr: Fournisseur de données :
ja: データ プロバイダー:
ko: 데이터 공급자:
pt: Fornecedor de dados:
pt_br: Provedor de dados:
ru: Поставщик данных:
tr: Veri sağlayıcı:
zh_cn: 数据提供程序:
zh_tw: 資料提供者:

# DataProvider_Odbc
source: .NET Framework Data Provider for ODBC
de: .NET Framework-Datenanbieter für ODBC
es_mx: Proveedor de datos de .NET Framework para ODBC
fr: Fournisseur de données .NET Framework pour ODBC
ja: .NET Framework ODBC 用データ プロバイダー
pt: Fornecedor de Dados .NET Framework para ODBC
pt_br: Provedor de Dados do .NET Framework para ODBC
ru: Поставщик данных .NET Framework для ODBC
tr: ODBC için .NET Framework Veri Sağlayıcısı

# DataProvider_Odbc_DataSource_Description
source: Use this selection to specify an ODBC user or system data source name to connect to an ODBC driver through the .NET Framework Data Provider for ODBC.
de: Verwenden Sie diese Auswahl, um einen ODBC-Benutzer- oder Systemdatenquellennamen anzugeben, um eine Verbindung mit einem ODBC-Treiber über den .NET Framework-Datenanbieter für ODBC herzustellen.
es_mx: Utilice esta selección para especificar un usuario ODBC o un nombre de origen de datos del sistema para conectarse a un controlador ODBC a través del proveedor de datos de .NET Framework para ODBC.
fr: Utilisez cette sélection pour spécifier un nom d’utilisateur ou de source de données système ODBC pour vous connecter à un pilote ODBC via le fournisseur de données .NET Framework pour ODBC.
ja: .NET Framework ODBC 用データ プロバイダーを通じて ODBC ドライバーに接続するために、ODBC のユーザーまたはシステム データ ソース名を指定するには、これを選択します。
ko: .NET Framework Data Provider for ODBC를 통해 ODBC 드라이버에 연결할 ODBC 사용자나 시스템 데이터 소스 이름을 지정하려면 선택합니다.
pt: Utilize esta seleção para especificar um utilizador ODBC ou nome de origem de dados de sistema para ligar a um controlador ODBC através do Fornecedor de Dados .NET Framework para ODBC.
pt_br: Use essa opção para especificar um usuário ODBC ou nome de origem de dados do sistema para se conectar a um driver usando o Provedor de Dados do .NET Framework para ODBC.
ru: Используйте этот выбор, чтобы указать пользователя ODBC или имя источника данных системы для подключения к драйверу ODBC через поставщика данных .NET Framework для ODBC.
tr: ODBC için .NET Framework Veri Sağlayıcısı aracılığıyla bir ODBC sürücüsüne bağlanmak üzere bir ODBC kullanıcısı veya sistem veri kaynağı adı belirtmek için bu seçimi kullanın.
zh_cn: 使用此选项指定 ODBC 用户或系统数据源名称，以通过 .NET Framework Data Provider for ODBC 连接到 ODBC 驱动程序。
zh_tw: 使用此選項來指定 ODBC 使用者或系統資料來源名稱，以透過 .NET Framework Data Provider for ODBC 連接到 ODBC 驅動程式。

# DataProvider_Odbc_Description
source: Use this data provider to connect to ODBC data sources.
de: Verwenden Sie diesen Datenanbieter, um eine Verbindung mit ODBC-Datenquellen herzustellen.
es_mx: Utilice este proveedor de datos para conectarse a orígenes de datos ODBC.
fr: Utilisez ce fournisseur de données pour vous connecter aux sources de données ODBC.
ja: ODBC データ ソースに接続するには、このデータ プロバイダーを使用します。
ko: 이 데이터 공급자를 사용하여 ODBC 데이터 소스에 연결합니다.
pt: Utilize este fornecedor de dados para ligar às origens de dados de ODBC.
pt_br: Use esse provedor de dados para se conectar às fontes de dados ODBC.
ru: Используйте этого поставщика данных, чтобы подключиться к источникам данных ODBC.
tr: ODBC veri kaynaklarına bağlanmak için bu veri sağlayıcısını kullanın.
zh_cn: 使用此数据提供程序连接到 ODBC 数据源。
zh_tw: 使用此資料提供者連接到 ODBC 資料來源。

# DataProvider_OleDB
source: .NET Framework Data Provider for OLE DB
de: .NET Framework-Datenanbieter für OLE DB
es_mx: Proveedor de datos de .NET Framework para OLE DB
fr: Fournisseur de données .NET Framework pour la base de données OLE
ja: .NET Framework OLE DB 用データ プロバイダー
pt: Fornecedor de Dados .NET Framework para OLE DB
pt_br: Provedor de Dados do .NET Framework para OLE DB
ru: Поставщик данных .NET Framework для OLE DB
tr: OLE DB için .NET Framework Veri Sağlayıcısı

# DataProvider_OleDB_AccessDataSource_Description
source: Use this selection to connect to a Microsoft Access database file through the .NET Framework Data Provider for OLE DB.
de: Verwenden Sie diese Auswahl, um über den .NET Framework-Datenanbieter für OLE DB eine Verbindung mit einer Microsoft Access-Datenbankdatei herzustellen.
es_mx: Utilice esta selección para conectarse a un archivo de base de datos de Microsoft Access a través del proveedor de datos de .NET Framework para OLE DB.
fr: Utilisez cette sélection pour vous connecter à un fichier de base de données Microsoft Access via le fournisseur de données .NET Framework pour la base de données OLE.
ja: .NET Framework OLE DB 用データ プロバイダーを通じて Microsoft Access データベース ファイルに接続するには、これを選択します。
ko: .NET Framework Data Provider for OLE DB를 통해 Microsoft Access 데이터베이스 파일에 연결하려면 선택합니다.
pt: Utilize esta seleção para ligar a um ficheiro da base de dados do Microsoft Access através do Fornecedor de Dados .NET Framework para OLE DB.
pt_br: Use essa opção para se conectar a um arquivo do banco de dados do Microsoft Access usando o Provedor de Dados do .NET Framework para OLE DB.
ru: Используйте этот выбор, чтобы подключиться к файлу базы данных Microsoft Access с помощью поставщика данных .NET Framework для OLE DB.
tr: OLE DB için .NET Framework Veri Sağlayıcısı aracılığıyla bir Microsoft Access veritabanı dosyasına bağlanmak için bu seçimi kullanın.
zh_cn: 使用此选项，通过 .NET Framework Data Provider for OLE DB 连接到 Microsoft Access 数据库文件。
zh_tw: 使用此選項，透過 .NET Framework Data Provider for OLE DB 連接到 Microsoft Access 資料庫檔案。

# DataProvider_OleDB_Description
source: Use this data provider to connect to OLE DB data sources.
de: Verwenden Sie diesen Datenanbieter, um eine Verbindung mit OLE DB-Datenquellen herzustellen.
es_mx: Utilice este proveedor de datos para conectarse a orígenes de datos OLE DB.
fr: Utilisez ce fournisseur de données pour vous connecter aux sources de données de la base de données OLE.
ja: OLE DB データ ソースに接続するには、このデータ プロバイダーを使用します。
ko: 이 데이터 공급자를 사용하여 OLE DB 데이터 소스에 연결합니다.
pt: Utilize este fornecedor de dados para ligar às origens de dados de OLE DB.
pt_br: Use esse provedor de dados para se conectar às fontes de dados OLE DB.
ru: Используйте этого поставщика данных, чтобы подключиться к источникам данных OLE DB.
tr: OLE DB veri kaynaklarına bağlanmak için bu veri sağlayıcısını kullanın.
zh_cn: 使用此数据提供程序连接到 OLE DB 数据源。
zh_tw: 使用此資料提供者連接到 OLE DB 資料來源。

# DataProvider_OleDB_OracleDataSource_Description
source: Use this selection to connect to Oracle 7.3, 8i, 9i or 10g using the native MSDAORA provider through the .NET Framework Data Provider for OLE DB.
de: Verwenden Sie diese Auswahl, um unter Verwendung des nativen MSDAORA-Anbieters über den .NET Framework-Datenanbieter für OLE DB eine Verbindung mit Oracle 7.3, 8i, 9i oder 10g herzustellen.
es_mx: Utilice esta selección para conectarse a Oracle 7.3, 8i, 9i o 10g mediante el proveedor MSDAORA nativo a través del proveedor de datos de .NET Framework para OLE DB.
fr: Utilisez cette sélection pour vous connecter à Oracle 7.3, 8i, 9i ou 10g à l’aide du fournisseur MSDAORA natif via le fournisseur de données .NET Framework pour la base de données OLE.
ja: .NET Framework OLE DB 用データ プロバイダーを通じ、ネイティブ MSDAORA プロバイダーを使うことによって Oracle 7.3、8i、9i、10g に接続するには、これを選択します。
ko: .NET Framework Data Provider for OLE DB를 통해 네이티브 MSDAORA 제공자를 사용하여 Oracle 7.3, 8i, 9i 또는 10g에 연결하려면 선택합니다.
pt: Utilize esta seleção para ligar ao Oracle 7.3, 8i, 9i ou 10g utilizando o fornecedor MSDAORA nativo através do Fornecedor de Dados .NET Framework para OLE DB.
pt_br: Use essa opção para se conectar ao Oracle 7.3, 8i, 9i ou 10g usando o provedor nativo MSDAORA por meio do Provedor de Dados do .NET Framework para OLE DB.
ru: Используйте этот выбор, чтобы подключиться к Oracle 7.3, 8i, 9i или 10g с помощью встроенного поставщика MSDAORA через поставщика данных .NET Framework для OLE DB.
tr: OLE DB için .NET Framework Veri Sağlayıcısı aracılığıyla özgün MSDAORA sağlayıcısını kullanarak Oracle 7.3, 8i, 9i veya 10g'ye bağlanmak için bu seçimi kullanın.
zh_cn: 使用此选项，通过 .NET Framework Data Provider for OLE DB 连接到使用本地 MSDAORA 提供程序的 Oracle 7.3、8i、9i 或 10g。
zh_tw: 使用此選項，透過 .NET Framework Data Provider for OLE DB 連接到使用原生 MSDAORA 提供者的 Oracle 7.3、8i、9i 或 10g。

# DataProvider_OleDB_SqlDataSource_Description
source: Use this selection to connect to Microsoft SQL Server 2000 or above using the .NET framework data provider for OLEDB.
de: Verwenden Sie diese Auswahl, um unter Verwendung des .NET Framework-Datenanbieters für OLE DB eine Verbindung mit Microsoft SQL Server 2000 oder höher herzustellen.
es_mx: Utilice esta selección para conectarse a Microsoft SQL Server 2000 o a una versión posterior mediante el proveedor de datos de .NET Framework para OLEDB.
fr: Utilisez cette sélection pour vous connecter à Oracle 7.3, 8i, 9i ou 10g à l’aide du fournisseur MSDAORA natif via le fournisseur de données .NET Framework pour la base de données OLE.
ja: .NET Framework OLE DB 用データ プロバイダーを使用して Microsoft SQL Server 2000 以降に接続するには、これを選択します。
ko: .NET framework data provider for OLEDB를 사용하여 Microsoft SQL Server 2000 이상에 연결하려면 선택합니다.
pt: Utilize esta seleção para ligar ao Microsoft SQL Server 2000 ou superior utilizando o fornecedor de dados .NET Framework para OLE DB.
pt_br: Use essa opção para se conectar ao Microsoft SQL Server 2000 ou posterior usando o Provedor de Dados do .NET Framework para OLE DB.
ru: Используйте этот выбор, чтобы подключиться к Microsoft SQL Server 2000 или более поздней версии с помощью поставщика данных .NET Framework для OLEDB.
tr: OLEDB için .NET Framework veri sağlayıcısını kullanarak Microsoft SQL Server 2000 veya daha üst sürümüne bağlanmak için bu seçimi kullanın.
zh_cn: 使用此选项，通过 .NET Framework Data Provider for OLEDB 连接到 Microsoft SQL Server 2000 或更高版本。
zh_tw: 使用此選項，透過 .NET Framework Data Provider for OLEDB 連接到 Microsoft SQL Server 2000 或更高版本。

# DataProvider_Oracle_DataSource_Description
source: ODP.NET, Managed Driver is a 100% native code .NET Framework driver for Oracle Database. No additional Oracle Client software is required to be installed to connect to Oracle Database.
de: ODP.NET, Managed Driver ist ein .NET Framework-Treiber für Oracle Database mit 100 % nativem Code. Zum Herstellen einer Verbindung mit Oracle Database ist keine zusätzliche Oracle Client-Software erforderlich.
es_mx: ODP.NET, Managed Driver es un controlador de .NET Framework 100 % de código nativo para la base de datos Oracle. No es necesario instalar ningún software adicional de Oracle Client para conectarse a la base de datos Oracle.
fr: ODP.NET, Managed Driver est un fournisseur de code natif géré 100 % .NET Framework pour la base de données Oracle. Aucun logiciel client Oracle supplémentaire n’est requis pour se connecter à la base de données Oracle.
ja: ODP.NET 管理対象ドライバーは、Oracle データベース用の 100% ネイティブ コードの .NET Framework ドライバーです。Oracle データベースに接続するために Oracle クライアント ソフトウェアを追加でインストールする必要はありません。
ko: ODP.NET, Managed Driver는 Oracle 데이터베이스를 위한 100% 네이티브 코드 .NET Framework 드라이버입니다. Oracle 데이터베이스에 연결하기 위해 추가 Oracle Client 소프트웨어를 설치할 필요가 없습니다.
pt: ODP.NET, controlador gerido é um código 100% nativo do controlador .NET Framework para Base de Dados Oracle. Não é necessário instalar software Oracle Client adicional para ligar à Base de Dados Oracle.
pt_br: ODP.NET, Managed Driver é um driver .NET Framework de código 100% nativo para banco de dados Oracle. Não é necessário instalar nenhum software Oracle Client adicional para se conectar ao banco de dados Oracle.
ru: ODP.NET, Managed Driver — это драйвер .NET Framework с собственным кодом для базы данных Oracle. Для подключения к базе данных Oracle не требуется установка дополнительного программного обеспечения клиента Oracle.
tr: ODP.NET, Yönetilen Sürücü; Oracle Veritabanı için %100 özgün kodlu .NET Framework sürücüsüdür. Oracle Veritabanına bağlanmak için ek bir Oracle İstemci yazılımının yüklenmesi gerekmez.
zh_cn: ODP.NET 托管驱动程序面向 Oracle 数据库，是拥有 100％ 原生代码的 .NET Framework 驱动程序。无需额外安装 Oracle 客户端软件即可连接到 Oracle 数据库。
zh_tw: ODP.NET，受管理驅動程式是用於 Oracle 資料庫的 100% 機器碼 .NET 架構驅動程式。無需額外安裝 Oracle 用戶端軟體即可連接到 Oracle 資料庫。
