Repository: UiPath/Community.Activities
Catalog: Activities/Database/ConnectionDialog/UiPath.Data.ConnectionUI.Dialog/Properties/UiPath.Data.ConnectionUI.Dialog.*.resx
Languages: de, es_mx, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# DataProvider_Oracle_Description
source: Oracle Data Provider for .NET provides fast data access from .NET clients to Oracle databases. ODP.NET enables .NET applications to take advantage of Oracle advanced features, such as Oracle Real Application Clusters (Oracle RAC) and XML DB. It is accessible through any .NET language, including C#, Visual Basic .NET, and C++ .NET.
de: Oracle Data Provider für .NET bietet schnellen Datenzugriff über .NET-Clients auf Oracle-Datenbanken. Mit ODP.NET können .NET-Anwendungen die Vorteile der erweiterten Funktionen von Oracle nutzen, wie Oracle Real Application Clusters (Oracle RAC) und XML DB. Er ist über jede .NET-Sprache zugänglich, einschließlich C#, Visual Basic .NET und C++ .NET.
es_mx: Oracle Data Provider para .NET proporciona acceso rápido a los datos desde los clientes .NET hasta las bases de datos Oracle. ODP.NET permite que las aplicaciones .NET aprovechen las características avanzadas de Oracle, como Oracle Real Application Clusters (Oracle RAC) y XML DB. Es accesible a través de cualquier lenguaje .NET, incluidos C#, Visual Basic .NET y C++ .NET.
fr: Le fournisseur de données Oracle de .NET fournit un accès rapide aux données des bases de données Oracle depuis les clients .NET. ODP.NET permet aux applications .NET de tirer parti des fonctionnalités avancées d’Oracle, telles qu’Oracle Real Application Clusters (Oracle RAC) et les bases de données XML. Il est accessible via n’importe quel langage .NET, y compris C#, Visual Basic .NET et C++ .NET.
ja: Oracle Data Provider for .NET では、.NET クライアントから Oracle データベースへのすばやいデータ アクセスを提供します。ODP.NET を使用すると、.NET アプリケーションが Oracle の高度な機能 (Oracle Real Application Clusters (Oracle RAC) や Oracle XML DB など) を活用できます。C#、Visual Basic .NET、C++ .NET を含む、あらゆる .NET 言語でアクセスできます。
ko: Oracle Data Provider for .NET은 .NET 클라이언트에서 Oracle 데이터베이스로의 빠른 데이터 액세스 기능을 제공합니다. ODP.NET을 사용하면 .NET 애플리케이션에서 Oracle RAC(Oracle Real Application Clusters) 및 XML DB와 같은 Oracle 고급 기능을 활용할 수 있습니다. .NET 언어(C#, Visual Basic .NET 및 C++ .NET)를 통해 액세스할 수 있습니다.
pt: O Fornecedor de Dados Oracle fornece um acesso rápido aos dados a partir dos clientes .NET para as bases de dados Oracle. O ODP.NET permite que as aplicações .NET beneficiem das funcionalidades avançadas do Oracle, tais como os Oracle Real Application Clusters (Oracle RAC) e XML DB. Está acessível através de qualquer linguagem .NET, incluindo C#, Visual Basic .NET e C++ .NET.
pt_br: O provedor de dados Oracle para .NET fornece acesso rápido a dados de clientes .NET para bancos de dados Oracle. O ODP.NET permite que aplicativos .NET aproveitem as funcionalidades avançadas do Oracle, como Oracle Real Application Clusters (Oracle RAC) e XML DB. Ele é acessível por qualquer linguagem .NET, incluindo C#, Visual Basic .NET e C++ .NET.
ru: Поставщик данных Oracle для .NET обеспечивает быстрый доступ из клиентов .NET к базам данных Oracle. ODP.NET позволяет приложениям .NET использовать расширенные функции Oracle, например Oracle Real Application Clusters (Oracle RAC) и XML DB. Он доступен из любого языка .NET, в том числе C#, Visual Basic .NET и C ++ .NET.
tr: .NET için Oracle Veri Sağlayıcısı, .NET istemcilerinden Oracle veritabanlarına hızlı veri erişimi sağlar. ODP.NET, .NET uygulamalarının Oracle Real Application Clusters (Oracle RAC) ve XML DB gibi Oracle gelişmiş özelliklerinden yararlanmasını sağlar. C#, Visual Basic .NET ve C++ .NET dahil olmak üzere herhangi bir .NET diliyle erişilebilir.
zh_cn: Oracle Data Provider for .NET 可提供从 .NET 客户端到 Oracle 数据库的快速数据访问。ODP.NET 支持 .NET 应用程序利用 Oracle 高级功能，例如 Oracle Real Application Clusters (Oracle RAC) 和 XML DB。可通过任何 .NET 语言进行访问，包括 C＃、Visual Basic .NET 和 C++ .NET。
zh_tw: Oracle Data Provider for .NET 可提供從 .NET 用戶端到 Oracle 資料庫的快速資料存取。ODP.NET 支援 .NET 應用程式利用 Oracle 進階功能，例如 Oracle Real Application Clusters (Oracle RAC) 和 XML DB。可透過任何 .NET 語言進行存取，包括 C＃、Visual Basic .NET 和 C++ .NET。

# DataProvider_Sql
source: .NET Framework Data Provider for SQL Server
de: .NET Framework-Datenanbieter für SQL Server
es_mx: Proveedor de datos de .NET Framework para SQL Server
fr: Fournisseur de données .NET Framework pour SQL Server
ja: .NET Framework SQL Server 用データ プロバイダー
pt: Fornecedor de Dados .NET Framework para SQL Server
pt_br: Provedor de Dados do .NET Framework para SQL Server
ru: Поставщик данных .NET Framework для SQL Server
tr: SQL Server için .NET Framework Veri Sağlayıcısı

# DataProvider_Sql_DataSource_Description
source: Use this selection to connect to Microsoft SQL Server 2005 or above using the .NET Framework Data Provider for SQL Server.
de: Verwenden Sie diese Auswahl, um unter Verwendung des .NET Framework-Datenanbieters für SQL Server eine Verbindung mit Microsoft SQL Server 2005 oder höher herzustellen.
es_mx: Utilice esta selección para conectarse a Microsoft SQL Server 2005 o a una versión posterior mediante el proveedor de datos de .NET Framework para SQL Server.
fr: Utilisez cette sélection pour vous connecter à Microsoft SQL Server 2005 ou toute version ultérieure à l’aide du fournisseur de données .NET Framework pour SQL Server.
ja: .NET Framework SQL Server 用データ プロバイダーを使用して Microsoft SQL Server 2005 以降に接続するには、これを選択します。
ko: NET Framework Data Provider for SQL Server를 사용하여 Microsoft SQL Server 2005 이상의 버전에 연결하려면 선택하십시오.
pt: Utilize esta seleção para ligar ao Microsoft SQL Server 2005 ou superior utilizando o Fornecedor de Dados .NET Framework para SQL Server.
pt_br: Use essa opção para se conectar ao Microsoft SQL Server 2005 ou posterior usando o Provedor de Dados do .NET Framework para SQL Server.
ru: Используйте этот выбор, чтобы подключиться к Microsoft SQL Server 2005 или более поздней версии с помощью поставщика данных .NET Framework для SQL Server.
tr: SQL Server için .NET Framework Veri Sağlayıcısı'nı kullanarak Microsoft SQL Server 2005 veya üst sürümüne bağlanmak için bu seçimi kullanın.
zh_cn: 使用此选项，通过 .NET Framework Data Provider for SQL Server 连接到 Microsoft SQL Server 2005 或更高版本。
zh_tw: 使用此選項，透過 .NET Framework Data Provider for SQL Server 連接到 Microsoft SQL Server 2005 或更高版本。

# DataProvider_Sql_Description
source: Use this data provider to connect to Microsoft SQL Server 2005 or above.
de: Verwenden Sie diesen Datenanbieter, um eine Verbindung mit Microsoft SQL Server 2005 oder höher herzustellen.
es_mx: Utilice este proveedor de datos para conectarse a Microsoft SQL Server 2005 o a una versión posterior.
fr: Utilisez ce fournisseur de données pour vous connecter à Microsoft SQL Server 2005 ou toute version ultérieure.
ja: Microsoft SQL Server 2005 以降に接続するには、このデータ プロバイダーを使用します。
ko: 이 데이터 공급자를 사용하여 Microsoft SQL Server 2005 이상의 버전에 연결합니다.
pt: Utilize este fornecedor de dados para ligar ao Microsoft SQL Server 2005 ou superior.
pt_br: Use esse provedor de dados para se conectar ao Microsoft SQL Server 2005 ou posterior.
ru: Используйте этого поставщика данных, чтобы подключиться к Microsoft SQL Server 2005 или более поздней версии.
tr: Microsoft SQL Server 2005 veya üst sürümüne bağlanmak için bu veri sağlayıcısını kullanın.
zh_cn: 使用此数据提供程序连接到 Microsoft SQL Server 2005 或更高版本。
zh_tw: 使用此資料提供者連接到 Microsoft SQL Server 2005 或更高版本。

# DataProvider_Sql_FileDataSource_Description
source: Use this selection to attach a database file to a local Microsoft SQL Server instance (including Microsoft SQL Express) using the .NET Framework Data Provider for SQL Server.
de: Verwenden Sie diese Auswahl, um eine Datenbankdatei mithilfe des .NET Framework-Datenanbieters für SQL Server an eine lokale Microsoft SQL Server-Instanz (einschließlich Microsoft SQL Express) anzufügen.
es_mx: Utilice esta selección para adjuntar un archivo de base de datos a una instancia local de Microsoft SQL Server (incluido Microsoft SQL Express) mediante el proveedor de datos de .NET Framework para SQL Server.
fr: Utilisez cette sélection pour attacher un fichier de base de données à une instance locale de Microsoft SQL Server (y compris Microsoft SQL Express) à l’aide du fournisseur de données .NET Framework pour SQL Server.
ja: .NET Framework SQL Server 用データ プロバイダーを使用して、データベース ファイルをローカル Microsoft SQL Server インスタンス (Microsoft SQL Express など) にアタッチするには、これを選択します。
ko: NET Framework Data Provider for SQL Server를 사용하여 로컬 Microsoft SQL Server 인스턴스(Microsoft SQL Express 포함)에 데이터베이스 파일을 첨부하려면 선택하십시오.
pt: Utilize esta seleção para anexar um ficheiro de base de dados a uma instância do Microsoft SQL Server local (incluindo Microsoft SQL Express) utilizando o Fornecedor de Dados .NET Framework para SQL Server.
pt_br: Use essa opção para anexar um arquivo de banco de dados a uma instância Microsoft SQL Server local (incluindo Microsoft SQL Express) usando o Provedor de Dados do .Net Framework para SQL Server.
ru: Используйте этот выбор, чтобы прикрепить файл базы данных к локальному экземпляру Microsoft SQL Server (в том числе Microsoft SQL Express) с помощью поставщика данных .NET Framework для SQL Server.
tr: SQL Server için .NET Framework Veri Sağlayıcısı'nı kullanarak yerel bir Microsoft SQL Server örneğine (Microsoft SQL Express dahil) bir veritabanı dosyası eklemek için bu seçimi kullanın.
zh_cn: 使用此选项，通过 .NET Framework Data Provider for SQL Server 将数据库文件附加到本地 Microsoft SQL Server 实例 (包括 Microsoft SQL Express)。
zh_tw: 使用此選項，透過 .NET Framework Data Provider for SQL Server 將資料庫檔附加到本機 Microsoft SQL Server 執行個體 (包括 Microsoft SQL Express)。

# DataSourceContent_Label
source: Details
es_mx: Detalles
fr: Détails
ja: 詳細
ko: 세부 정보
pt: Detalhes
pt_br: Detalhes
ru: Сведения
tr: Ayrıntılar
zh_cn: 详细信息
zh_tw: 詳細資訊

# DataSourceDescription_Label
source: Description
de: Beschreibung
ja: 説明
ko: 설명
pt: Descrição
pt_br: Descrição
ru: Описание
tr: Açıklama
zh_cn: 说明
zh_tw: 說明

# DataSourceGroupBox_Label
source: Data source specification
de: Datenquellenspezifikation
es_mx: Especificación del origen de datos
fr: Spécification de la source de données
ja: データ ソースの指定
ko: 데이터 소스 사양
pt: Especificação da origem de dados
pt_br: Especificação de fonte de dados
ru: Характеристики источника данных
tr: Veri kaynağı belirtimi
zh_cn: 数据源规范
zh_tw: 資料來源規格

# DataSourceSpec_Label
source: Use user or system data source ({0} only):
de: Benutzer- oder Systemdatenquelle verwenden (nur {0}):
es_mx: Utilice el origen de datos del usuario o del sistema (solo{0} ):
fr: Utiliser la source de données utilisateur ou système ({0} uniquement) :
ja: ユーザーまたはシステム データ ソースを使用 ({0} のみ):
ko: 사용자 또는 시스템 데이터 소스 사용({0}만 해당):
pt: Utilize origem de dados de utilizador ou de sistema: ({0} apenas):
pt_br: Usar fonte de dados de sistema ou usuário (apenas {0}):
ru: Использовать пользовательский или системный источник данных (только {0}):
tr: Kullanıcı veya sistem veri kaynağını kullan (yalnızca {0}):
zh_cn: 使用用户或系统数据源 (仅限 {0}):
zh_tw: 使用使用者或系統資料來源 (僅限 {0}):

# DataSource_CannotChangeSingleDataProvider
source: The default data provider cannot be changed when there is only one data provider available.
de: Der Standarddatenanbieter kann nicht geändert werden, wenn nur ein Datenanbieter verfügbar ist.
es_mx: El proveedor de datos predeterminado no se puede cambiar cuando solo hay un proveedor de datos disponible.
fr: Le fournisseur de données par défaut ne peut pas être modifié lorsqu’un seul fournisseur de données est disponible.
ja: 利用可能なデータ プロバイダーが 1 つのみのときは、既定のデータ プロバイダーを変更できません。
ko: 사용 가능한 데이터 공급자가 하나만 있는 경우, 기본 데이터 공급자를 변경할 수 없습니다.
pt: O fornecedor de dados predefinido não pode ser alterado quando só está disponível um fornecedor de dados.
pt_br: O provedor de dados padrão não pode ser alterado quando houver apenas um provedor de dados disponível.
ru: Невозможно изменить поставщика данных по умолчанию, если доступен только один поставщик данных.
tr: Yalnızca tek bir veri sağlayıcı olduğunda varsayılan veri sağlayıcısı değiştirilemez.
zh_cn: 只有一个数据提供程序可用时，无法更改默认数据提供程序。
zh_tw: 只有一個資料提供者可用時，無法變更預設資料提供者。

# DataSource_DataProviderNotFound
source: The data provider was not found.
de: Der Datenanbieter wurde nicht gefunden.
es_mx: No se encontró el proveedor de datos.
fr: Le fournisseur de données n’a pas été trouvé.
ja: データ プロバイダーが見つかりませんでした。
ko: 데이터 공급자를 찾을 수 없습니다.
pt: O fornecedor de dados não foi encontrado.
pt_br: O provedor de dados não foi encontrado.
ru: Поставщик данных не найден.
tr: Veri sağlayıcı bulunamadı.
zh_cn: 未找到任何数据提供程序。
zh_tw: 找不到任何資料提供者。

# DataSource_Label
source: Data source:
de: Datenquelle:
es_mx: Origen de datos:
fr: Source de données :
ja: データ ソース:
ko: 데이터 소스:
pt: Origem de dados:
pt_br: Fonte de dados:
ru: Источник данных:
tr: Veri kaynağı:
zh_cn: 数据源:
zh_tw: 資料來源:

# DataSource_MicrosoftAccess
source: Microsoft Access Database File
de: Microsoft Access-Datenbankdatei
es_mx: Archivo de base de datos de Microsoft Access
fr: Fichier de base de données Microsoft Access
ja: Microsoft Access データベース ファイル
ko: Microsoft Access 데이터베이스 파일
pt: Ficheiro da Base de Dados do Microsoft Access
pt_br: Arquivo do Banco de Dados do Microsoft Access
ru: Файл базы данных Microsoft Access
tr: Microsoft Access Veritabanı Dosyası
zh_cn: Microsoft Access 数据库文件
zh_tw: Microsoft Access 資料庫檔案

# DataSource_MicrosoftOdbcDsn
source: Microsoft ODBC Data Source
de: Microsoft ODBC-Datenquelle
es_mx: Origen de datos ODBC de Microsoft
fr: Source de données Microsoft ODBC
ja: Microsoft ODBC データ ソース
ko: Microsoft ODBC 데이터 소스
pt: Origem de Dados do Microsoft ODBC
pt_br: Fonte de Dados ODBC da Microsoft
ru: Источник данных Microsoft ODBC
tr: Microsoft ODBC Veri Kaynağı
zh_cn: Microsoft ODBC 数据源
zh_tw: Microsoft ODBC 資料來源

# DataSource_MicrosoftSqlServerFile
source: Microsoft SQL Server Database File
de: Microsoft SQL Server-Datenbankdatei
es_mx: Archivo de base de datos de Microsoft SQL Server
fr: Fichier de base de données Microsoft SQL Server
ja: Microsoft SQL Server データベース ファイル
ko: Microsoft SQL Server 데이터베이스 파일
pt: Ficheiro da Base de Dados do Microsoft SQL Server
pt_br: Arquivo de Banco de Dados do Microsoft SQL Server
ru: Файл базы данных Microsoft SQL Server
tr: Microsoft SQL Server Veritabanı Dosyası
zh_cn: Microsoft SQL Server 数据库文件
zh_tw: Microsoft SQL Server 資料庫檔案

# DataSource_UnspecifiedDisplayName
source: <other>
tr: <other>&nbsp

# Error_Label
source: Error
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
pt: Erro
pt_br: Erro
ru: Ошибка
tr: Hata
zh_cn: 错误
zh_tw: 錯誤

# FileName_Label
source: Database file name:
de: Name der Datenbankdatei:
es_mx: Nombre del archivo de base de datos:
fr: Nom du fichier de la base de données :
ja: データベース ファイル名:
ko: 데이터베이스 파일 이름:
pt: Nome do ficheiro de base de dados:
pt_br: Nome do arquivo de banco de dados:
ru: Имя файла базы данных:
tr: Veritabanı dosya adı:
zh_cn: 数据库文件名:
zh_tw: 資料庫檔案名稱:

# LogicalName_Label
source: Logical name:
de: Logischer Name:
es_mx: Nombre lógico:
fr: Nom logique :
ja: 論理名:
ko: 논리 이름:
pt: Nome lógico:
pt_br: Nome lógico:
ru: Логическое имя:
tr: Mantıksal ad:
zh_cn: 逻辑名称:
zh_tw: 邏輯名稱:

# LogonDBGroupBox_Label
source: Log on to database
de: Bei Datenbank anmelden
es_mx: Inicie sesión en la base de datos
fr: Se connecter à la base de données
ja: データベースにログオン
ko: 데이터베이스에 로그온
pt: Iniciar sessão na base de dados
pt_br: Logon no banco de dados
ru: Регистрация в базе данных
tr: Veritabanında oturum aç
zh_cn: 登录到数据库
zh_tw: 登入資料庫

# LogonGroupBox_Label
source: Log on to server
de: Bei Server anmelden
es_mx: Inicie sesión en el servidor
fr: Se connecter au serveur
ja: サーバーにログオン
ko: 서버에 로그온
pt: Iniciar sessão no servidor
pt_br: Logon no servidor
ru: Регистрация на сервере
tr: Sunucuda oturum aç
zh_cn: 登录到服务器
zh_tw: 登入伺服器

# OdbcConnectionUIControl_InvalidConnectionProperties
source: The connection properties object must be of type OdbcConnectionProperties.
de: Das Verbindungseigenschaftenobjekt muss vom Typ „OdbcConnectionProperties“ sein.
es_mx: El objeto de propiedades de conexión debe ser del tipo OdbcConnectionProperties.
fr: L’objet des propriétés de connexion doit être de type OdbcConnectionProperties.
ja: 接続プロパティ オブジェクトは、OdbcConnectionProperties 型である必要があります。
ko: 연결 속성 개체는 OdbcConnectionProperties 유형이어야 합니다.
pt: O objeto de propriedades de ligação tem de ser do tipo OdbcConnectionProperties.
pt_br: O objeto de propriedades da conexão deve ser do tipo OdbcConnectionProperties.
ru: Типом объекта свойств подключения должен быть OdbcConnectionProperties.
tr: Bağlantı özellikleri nesnesi OdbcConnectionProperties türünde olmalıdır.
zh_cn: 连接属性对象的类型必须为 OdbcConnectionProperties。
zh_tw: 連線屬性物件的類型必須為 OdbcConnectionProperties。

# OdbcConnectionUIControl_SQLAllocConnectFailed
source: Failed to allocate ODBC connection handle.
de: Fehler beim Zuweisen des ODBC-Verbindungshandles.
es_mx: Se produjo un error al asignar el identificador de conexión ODBC.
fr: Échec de l’affectation de la poignée de connexion ODBC.
ja: ODBC 接続ハンドルの割り当てに失敗しました。
ko: ODBC 연결 핸들을 할당하지 못했습니다.
pt: Falha ao alocar o parâmetro de ligação ODBC.
pt_br: Falha ao alocar o identificador de conexão ODBC.
ru: Не удалось выделить дескриптор подключения ODBC.
tr: ODBC bağlantı tanıtıcısı atanamadı.
zh_cn: 未能成功分配 ODBC 连接句柄。
zh_tw: 未能成功配置 ODBC 連線控制代碼。

# OdbcConnectionUIControl_SQLAllocEnvFailed
source: Failed to allocate ODBC environment handle.
de: Fehler beim Zuweisen des ODBC-Umgebungshandles.
es_mx: Se produjo un error al asignar el identificador de entorno ODBC.
fr: Échec de l’affectation de la poignée d’environnement ODBC.
ja: ODBC 環境ハンドルの割り当てに失敗しました。
ko: ODBC 환경 핸들을 할당하지 못했습니다.
pt: Falha ao alocar o parâmetro de ambiente ODBC.
pt_br: Falha ao alocar o identificador de ambiente ODBC.
ru: Не удалось выделить дескриптор среды ODBC.
tr: ODBC ortam tanıtıcısı atanamadı.
zh_cn: 未能成功分配 ODBC 环境句柄。
zh_tw: 未能成功配置 ODBC 環境控制代碼。

# OdbcConnectionUIControl_SQLDriverConnectFailed
source: Failed to call the ODBC driver connection utility.
de: Fehler beim Aufrufen des Dienstprogramms für die ODBC-Treiberverbindung.
es_mx: Se produjo un error al llamar a la utilidad de conexión del controlador ODBC.
fr: Échec de l’appel de l’utilitaire de connexion du pilote ODBC.
ja: ODBC ドライバー接続ユーティリティの呼び出しに失敗しました。
ko: ODBC 드라이버 연결 유틸리티를 호출하지 못했습니다.
pt: Falha ao chamar o utilitário de ligação do controlador ODBC.
pt_br: Falha ao chamar o utilitário de conexão de driver ODBC.
ru: Не удалось вызвать утилиту подключения драйвера ODBC.
tr: ODBC sürücü bağlantı yardımcı programı çağrılamadı.
zh_cn: 未能成功调用 ODBC 驱动程序连接实用程序。
zh_tw: 無法叫用 ODBC 驅動程式連線公用程式。

# OleDBConnectionUIControl_InvalidConnectionProperties
source: The connection properties object must be of type OleDBConnectionProperties.
de: Das Verbindungseigenschaftenobjekt muss vom Typ „OleDBConnectionProperties“ sein.
es_mx: El objeto de propiedades de conexión debe ser del tipo OleDBConnectionProperties.
fr: L’objet des propriétés de connexion doit être de type OleDBConnectionProperties.
ja: 接続プロパティ オブジェクトは、OleDBConnectionProperties 型である必要があります。
ko: 연결 속성 개체는 OleDBConnectionProperties 유형이어야 합니다.
pt: O objeto de propriedades de ligação tem de ser do tipo OleDBConnectionProperties.
pt_br: O objeto de propriedades da conexão deve ser do tipo OleDBConnectionProperties.
ru: Типом объекта свойств подключения должен быть OleDBConnectionProperties.
tr: Bağlantı özellikleri nesnesi OleDBAccessConnectionProperties türünde olmalıdır.
zh_cn: 连接属性对象的类型必须为 OleDBConnectionProperties。
zh_tw: 連線屬性物件的類型必須為 OleDBConnectionProperties。

# OleDBConnectionUIInitialCatalog_Label
source: Initial catalog:
de: Ursprünglicher Katalog:
es_mx: Catálogo inicial:
fr: Catalogue initial :
ja: 初期カタログ:
ko: 초기 카탈로그:
pt: Catálogo inicial:
pt_br: Catálogo inicial:
ru: Исходный каталог:
tr: İlk katalog:
zh_cn: 初始目录:
zh_tw: 初始目錄:

# OleDBConnectionUILocationGroup_Label
source: Enter a server or file name
de: Server- oder Dateinamen eingeben
es_mx: Introduzca un nombre de servidor o archivo
fr: Entrer un serveur ou un nom de fichier
ja: サーバー名またはファイル名を入力
ko: 서버 또는 파일 이름 입력
pt: Introduzir um nome de servidor ou de ficheiro
pt_br: Insira um nome de arquivo ou servidor
ru: Введите имя сервера или файла
tr: Bir sunucu veya dosya adı girin
zh_cn: 输入服务器或文件名称
zh_tw: 輸入伺服器或檔案名稱

# OleDBConnectionUILocation_Label
source: Location:
de: Speicherort:
es_mx: Ubicación:
fr: Emplacement :
ja: 場所:
ko: 위치:
pt: Localização:
pt_br: Local:
ru: Расположение:
tr: Konum:
zh_cn: 位置:
zh_tw: 位置:

# OleDBConnectionUISavePassword_Label
source: Save password
de: Kennwort speichern
es_mx: Guardar contraseña
fr: Enregistrer le mot de passe
ja: パスワードを保存
ko: 암호 저장
pt: Guardar palavra-passe
pt_br: Salvar senha
ru: Сохранить пароль
tr: Parolayı kaydet
zh_cn: 保存密码
zh_tw: 儲存密碼

# OleDBConnectionUIServer_Label
source: Server or file name:
de: Server- oder Dateiname:
es_mx: Nombre del servidor o archivo:
fr: Nom du serveur ou du fichier :
ja: サーバー名またはファイル名:
ko: 서버 또는 파일 이름:
pt: Nome de servidor ou de ficheiro:
pt_br: Nome de arquivo ou servidor:
ru: Имя сервера или файла:
tr: Sunucu veya dosya adı:
zh_cn: 服务器或文件名称：
zh_tw: 伺服器或檔案名稱:

# OleDBConnectionUISSPI_Label
source: Use Integrated Security
de: Integrierte Sicherheit verwenden
es_mx: Utilice la seguridad integrada
fr: Utiliser la sécurité intégrée
ja: 統合セキュリティを使用
ko: 통합 보안 사용
pt: Utilizar Segurança Integrada
pt_br: Usar segurança integrada
ru: Использовать встроенную систему безопасности
tr: Tümleşik Güvenliği Kullan
zh_cn: 使用集成安全性
zh_tw: 使用整合安全性

# OleDBConnectionUIUserBlankPassword_Label
source: Blank password
de: Leeres Kennwort
es_mx: Contraseña en blanco
fr: Mot de passe vide
ja: 空のパスワード
ko: 빈 암호
pt: Palavra-passe em branco
pt_br: Senha em branco
ru: Пустой пароль
tr: Boş parola
zh_cn: 空白密码
zh_tw: 空白密碼

# OleDBConnectionUIUserPassword_Label
source: Use a specific user name and password
de: Bestimmten Benutzernamen und Kennwort verwenden
es_mx: Utilice un nombre de usuario y una contraseña específicos
fr: Utiliser un nom d’utilisateur et un mot de passe spécifiques
ja: 特定のユーザー名とパスワードを使用:
ko: 특정 사용자 이름 및 암호 사용
pt: Utilizar um nome de utilizador e palavra-passe específicos
pt_br: Usar um nome de usuário e senha específicos
ru: Используйте определенное имя пользователя и пароль
tr: Belirli bir kullanıcı adı ve parola kullanın
zh_cn: 使用特定用户名和密码
zh_tw: 使用特定使用者名稱和密碼

# OLEDBProvider_Label
source: OLE DB Provider:
de: OLE DB-Anbieter:
es_mx: Proveedor OLE DB:
fr: Fournisseur de la base de données OLE :
ja: OLE DB プロバイダー:
ko: OLE DB 공급자:
pt: Fornecedor OLE DB:
pt_br: Provedor OLE DB:
ru: Поставщик OLE DB:
tr: OLE DB Sağlayıcısı:
zh_cn: OLE DB 提供程序:
zh_tw: OLE DB 提供者:

# OracleConnectionUIControl_InvalidConnectionProperties
source: The connection properties object must be of type OracleConnectionProperties or OleDBOracleConnectionProperties.
de: Das Verbindungseigenschaftenobjekt muss vom Typ „OracleConnectionProperties“ oder „OleDBOracleConnectionProperties“ sein.
es_mx: El objeto de propiedades de conexión debe ser del tipo OracleConnectionProperties u OleDBOracleConnectionProperties.
fr: L’objet des propriétés de connexion doit être de type OracleConnectionProperties ou OleDBOracleConnectionProperties.
ja: 接続プロパティ オブジェクトは、OracleConnectionProperties 型か OleDBOracleConnectionProperties 型である必要があります。
ko: 연결 속성 개체는 OracleConnectionProperties 또는 OleDBOracleConnectionProperties 유형이어야 합니다.
pt: O objeto de propriedades de ligação tem de ser do tipo OracleConnectionProperties ou OleDBOracleConnectionProperties.
pt_br: O objeto de propriedades da conexão deve ser do tipo OracleConnectionProperties ou OleDBOracleConnectionProperties.
ru: Типом объекта свойств подключения должен быть OracleConnectionProperties или OleDBOracleConnectionProperties.
tr: Bağlantı özellikleri nesnesi OracleConnectionProperties veya OleDBOracleConnectionProperties türünde olmalıdır.
zh_cn: 连接属性对象的类型必须为 OracleConnectionProperties 或 OleDBOracleConnectionProperties。
zh_tw: 連線屬性物件的類型必須為 OracleConnectionProperties 或 OleDBOracleConnectionProperties。
