Repository: UiPath/Community.Activities
Catalog: Activities/Java/UiPath.Java.Activities/Properties/UiPath.Java.Activities.*.resx
Languages: de, es, es_mx, fr, ja, ko, pt, pt_br, ru, tr, zh_cn, zh_tw

# ConstructorException
source: Constructor could not be called.
de: Der Konstruktor konnte nicht aufgerufen werden.
es: No se ha podido llamar al constructor.
es_mx: No se pudo llamar al constructor.
fr: Le constructeur n’a pas pu être appelé.
ja: コンストラクターを呼び出せませんでした。
ko: 생성자를 호출할 수 없습니다.
pt: Não foi possível chamar o construtor.
pt_br: Não foi possível chamar o Construtor.
ru: Не удалось вызвать конструктор.
tr: Oluşturucu çağrılamadı.
zh_cn: 无法调用构造函数。
zh_tw: 無法呼叫建構函式。

# ConvertException
source: Could not convert
de: Konnte nicht konvertiert werden
es: No se ha podido convertir
es_mx: No se pudo convertir
fr: Conversion impossible
ja: 変換できませんでした。
ko: 변환할 수 없음
pt: Não foi possível converter
pt_br: Não foi possível converter
ru: Сбой преобразования
tr: Dönüştürülemedi
zh_cn: 无法转换
zh_tw: 無法轉換

# ConvertJavaObjectDescription
source: Convert a java object to the specified .net type. If the cast was not possible throws exception.
de: Konvertiert ein Java-Objekts in den angegebenen .NET- Typ. Wenn die Umwandlung nicht möglich war, wird eine Ausnahme ausgelöst.
es: Convertir un objeto de java al tipo .net especificado. Si no ha sido posible la conversión, lanza una excepción.
es_mx: Convierta un objeto en Java en el tipo .net especificado . Si no fue posible la conversión, arroja una excepción.
fr: Convertissez un objet java en type .net spécifié. En cas de conversion impossible, une exception est générée.
ja: Java オブジェクトを、指定した .NET 型に変換します。キャストできない場合は例外がスローされます。(Convert Java Object)
ko: java 객체를 지정된 .net 형식으로 변환하십시오. 그럴 수 없는 경우 예외가 throw됩니다.
pt: Converta um objeto java no tipo .net especificado. Se a transmissão não for possível, lança uma exceção.
pt_br: Converta um objeto java no tipo de .net especificado. Se a conversão não for possível, será gerada uma exceção.
ru: Преобразование объекта Java в указанный тип .net. Если преобразование выполнить невозможно, создается исключение.
tr: Bir java nesnesini belirtilen .net türüne dönüştürün. Aktarım mümkün değilse özel durum oluşturur.
zh_cn: 将 Java 对象转换为指定的 .net 类型。如果无法转换，则引发异常。
zh_tw: 將 Java 物件轉換為指定的 .net 類型。如果無法轉換，則擲回例外狀況。

# ConvertJavaObjectDisplayName
source: Convert Java Object
es: Convertir objeto de java
ja: Java オブジェクトを変換
zh_cn: 转换 Java 对象
zh_tw: 轉換 Java 物件

# ConvertJavaObjectResultDescription
source: The java object converted to .net.
de: Das in .NET konvertierte Java-Objekt.
es: El objeto de java convertido a .net.
es_mx: El objeto en Java se convirtió en .net.
fr: L’objet java converti en .net.
ja: .NET に変換された Java オブジェクトです。
ko: .net으로 변환된 java 객체입니다.
pt: O objeto java convertido em .net.
pt_br: O objeto java convertido em .net.
ru: Объект Java преобразован в .net.
tr: Java nesnesi .net'e dönüştürüldü.
zh_cn: 转换为 .net 的 Java 对象。
zh_tw: 轉換為 .net 的 Java 物件。

# CreateJavaObjectDescription
source: Invokes the constructor on the specified class.
de: Ruft den Konstruktor für die angegebene Klasse auf.
es: Solicita el constructor en la clase especificada.
es_mx: Invoca el constructor en la clase especificada.
fr: Invoque le constructeur au niveau de la classe spécifiée.
ja: 指定したクラスのコンストラクターを呼び出します。(Create Java Object)
ko: 지정된 클래스에서 생성자를 호출하십시오.
pt: Invoca o construtor na classe especificada.
pt_br: Invoca o construtor na classe especificada.
ru: Вызов конструктора для указанного класса.
tr: Belirtilen sınıftaki oluşturucuyu çağırır.
zh_cn: 调用指定类的构造函数。
zh_tw: 叫用指定類別的建構函式。

# CreateJavaObjectDisplayName
source: Create Java Object
es: Crear objeto de java
ja: Java オブジェクトを作成
zh_cn: 创建 Java 对象
zh_tw: 建立 Java 物件

source: Do
de: Ausführen
es: Hacer
es_mx: Hacer
fr: Faire
ja: 実行
ko: 실행
pt: Fazer
pt_br: Fazer
ru: Сделать
tr: Yap
zh_cn: 执行
zh_tw: 執行

# FieldNameDisplayName
source: FieldName
es: Nombre del campo
es_mx: NombreDeCampo
fr: Nom du champ
ja: フィールド名
ko: 필드 이름
ru: ИмяПоля
zh_cn: 字段名称
zh_tw: 欄位名稱

# FieldNameDescription
source: The name of the field the activity will return as a java object.
de: Der Name des Felds, das die Aktivität als Java-Objekt zurückgibt.
es: El nombre del campo que la actividad devolverá como objeto de java.
es_mx: El nombre del campo que la actividad devolverá como un objeto en Java.
fr: Le nom du champ renvoyé par l’activité en tant qu’objet java.
ja: アクティビティが Java オブジェクトとして返すフィールドの名前です。
ko: 액티비티가 java 객체로 반환될 필드의 이름입니다.
pt: O nome do campo que a atividade devolve como objeto java.
pt_br: O nome do campo retornado pela atividade como um objeto java.
ru: Имя поля, возвращаемое в виде объекта Java при выполнении действия.
tr: Etkinliğin java nesnesi olarak döndüreceği alanın adı.
zh_cn: 活动将作为 Java 对象返回的字段名称。
zh_tw: 活動將作為 Java 物件傳回的欄位名稱。

# GetFieldDescritption
source: Returns a public field from a java object.
de: Gibt ein öffentliches Feld aus einem Java-Objekt zurück.
es: Devuelve un campo público desde un objeto de java.
es_mx: Devuelve un campo público de un objeto en Java.
fr: Renvoie un champ public à partir d’un objet java.
ja: Java オブジェクトからパブリック フィールドを返します。
ko: java 객체에서 공용 필드를 반환합니다.
pt: Devolve um campo público a partir de um objeto java.
pt_br: Retorna um campo público de um objeto java.
ru: Возвращает общедоступное поле из объекта Java.
tr: Java nesnesinden bir genel alan döndürür.
zh_cn: 从 Java 对象返回公共字段。
zh_tw: 從 Java 物件傳回返回公用欄位。

# GetFieldDisplayName
source: Get Field
es: Obtener campo
ja: フィールドを取得
zh_cn: 获取字段
zh_tw: 取得欄位

# GetFieldException
source: Field not found.
de: Feld nicht gefunden.
es: Campo no encontrado.
es_mx: No se encontró el campo.
fr: Champ introuvable.
ja: フィールドが見つかりません。
ko: 필드를 찾을 수 없습니다.
pt: Campo não encontrado.
pt_br: Campo não encontrado.
ru: Поле не найдено.
tr: Alan bulunamadı.
zh_cn: 未找到字段。
zh_tw: 找不到欄位。

source: Input
de: Eingabe
es: Entrada
es_mx: Entrada
fr: Entrée
ja: 入力
ko: 입력
pt: Entrada
pt_br: Entrada
ru: Ввод
tr: Giriş
zh_cn: 输入
zh_tw: 輸入

source: Target
es: Destino
es_mx: Destino
fr: Cible
ja: ターゲット
ko: 타겟
ru: Целевой объект
zh_cn: 目标
zh_tw: 目標

# InvokationObjectException
source: The Target Object and Target Type are both empty. At least one of them has to be set.
de: Sowohl Zielobjekt als auch Zieltyp ist leer. Mindestens eines davon muss festgelegt sein.
es: El objeto de destino y el tipo de destino están vacíos. Al menos uno de estos debe estar configurado.
es_mx: El objeto de destino y el tipo de destino están vacíos. Al menos se debe establecer uno de ellos.
fr: Les champs Objet cible (Target Object) et Type cible (Target Type) sont vides. Au moins l’un d’entre eux doit être défini.
ja: [ターゲット オブジェクト] と [ターゲット型] の両方が空です。少なくとも 1 つを設定する必要があります。
ko: 대상 객체와 대상 형식이 모두 비어 있습니다. 둘 중 하나 이상은 설정되어야 합니다.
pt: O Objeto de Destino e o Tipo de Destino estão ambos vazios. Tem de ser definido, pelo menos, um.
pt_br: O Objeto de Destino e o Tipo de Destino estão em branco. Defina ao menos um deles.
ru: Не указаны значения для целевого объекта и типа целевого объекта. Необходимо задать хотя бы одно из двух значений.
tr: Hedef Nesne ve Hedef Türü'nün ikisi de boş. En azından biri ayarlanmalıdır.
zh_cn: 目标对象和目标类型都为空。至少要设置其中一项。
zh_tw: 目標物件和目標類型都為空。至少要設定其中一項。

# InvokeJavaMethodDescription
source: Invoke Java Method
de: Java-Methode aufrufen
es: Solicitar método de Java
es_mx: Invocar el método Java
fr: Invoquer la méthode Java
ja: Java メソッドを呼び出します。 (Invoke Java Method)
ko: Java 메서드 호출
pt: Invocar Método Java
pt_br: Invoca o Método Java
ru: Вызов метода Java
tr: Java Yöntemini Çağır
zh_cn: 调用 Java 方法
zh_tw: 叫用 Java 方法

# InvokeJavaMethodDisplayName
source: Invoke Java Method
es: Solicitar método de Java
fr: Invoquer la méthode Java
ja: Java メソッドを呼び出し
pt_br: Invoke Method Java
zh_cn: 调用 Java 方法
zh_tw: 叫用 Java 方法

# InvokeJavaResultDescription
source: A reference to an object loaded in Java.
de: Ein Verweis auf ein in Java geladenes Objekt.
es: Una referencia a un objeto cargado en Java.
es_mx: Una referencia a un objeto cargado en Java.
fr: Une référence à un objet chargé dans Java.
ja: Java に読み込まれたオブジェクトへの参照です。
ko: Java에서 로드된 객체에 대한 참조입니다.
pt: Uma referência a um objeto carregado no Java.
pt_br: Uma referência a um objeto carregado em Java.
ru: Ссылка на объект, загруженный в Java.
tr: Java'da yüklenen bir nesnenin başvurusu.
zh_cn: 对已在 Java 中加载的对象的引用。
zh_tw: 對 Java 中已載入的物件的參考。

# InvokeMethodException
source: The method could not be invoked.
de: Die Methode konnte nicht aufgerufen werden.
es: No se ha podido invocar el método.
es_mx: No se pudo invocar el método.
fr: La méthode n’a pas pu être invoquée.
ja: メソッドを呼び出せませんでした。
ko: 메서드를 호출하지 못했습니다.
pt: Não foi possível invocar o método.
pt_br: Não foi possível invocar o método.
ru: Не удалось вызвать метод.
tr: Yöntem çağrılamadı.
zh_cn: 无法调用此方法。
zh_tw: 無法叫用此方法。

# JarPathDescription
source: Path to the jar that will be loaded.
de: Pfad zur JAR-Datei, die geladen wird.
es: Se cargará la ruta de JAR.
es_mx: Ruta al JAR que se cargará.
fr: Le chemin d’accès au fichier jar va être chargé.
ja: 読み込まれる Jar ファイルのパスです。
ko: 로드될 jar의 경로입니다.
pt: Caminho para o jar que será carregado.
pt_br: O caminho para o arquivo JAR será carregado.
ru: Путь к загружаемому JAR-файлу.
tr: Yüklenecek jar dosyasının yolu.
zh_cn: 将要加载的 Jar 的路径。
zh_tw: 將要載入的 Jar 的路徑。

# JarPathDisplayName
source: JarPath
es: RutaDeJAR
es_mx: RutaDeJar
fr: CheminJar
ja: Jar パス
ko: Jar 경로
ru: ПутьКФайлуJAR
zh_cn: Jar 路径
zh_tw: Jar 路徑

# JavaInitiazeException
source: Error intializing Java : {0}
de: Fehler beim Intialisieren von Java: {0}
es: Error al iniciar Java: {0}
es_mx: Error al inicializar Java : {0}
fr: Erreur lors de l’initialisation de Java : {0}
ja: 次の Java の Jar ファイルの初期化中にエラーが発生しました: {0}
ko: Java 초기화 중 오류: {0}
pt: Erro ao inicializar o Java: {0}
pt_br: Erro ao iniciar Java: {0}
ru: Ошибка инициализации Java: {0}
tr: Java'yı başlatma hatası : {0}
zh_cn: 初始化 Java 时出错: {0}
zh_tw: 初始化 Java 時發生錯誤： {0}

# JavaInvokerNotLoadedException
source: Java invoker was not loaded.
de: Java-Aufrufer wurde nicht geladen.
es: No se ha cargado el solicitante de Java.
es_mx: No se cargó el invocador Java.
fr: L’invocateur Java ne s’est pas chargé.
ja: Java Invoker が読み込まれませんでした。
ko: Java 호출자가 로드되지 않았습니다.
pt: O invocador Java não foi carregado.
pt_br: O invocador Java não foi carregado.
ru: Вызывающий объект Java не загружен.
tr: Java çağırıcısı yüklenmedi.
zh_cn: 未加载 Java 调用程序。
zh_tw: 未載入 Java 啟動程式。

# JavaObjectDisplayName
source: JavaObject
es: ObjetoDeJava
es_mx: ObjetoDeJava
fr: ObjetJava
ja: Java オブジェクト
ko: Java 개체
ru: ОбъектJava
zh_cn: Java 对象
zh_tw: Java 物件

# JavaObjectDescription
source: A reference to an object loaded in Java.
de: Ein Verweis auf ein in Java geladenes Objekt.
es: Una referencia a un objeto cargado en Java.
es_mx: Una referencia a un objeto cargado en Java.
fr: Une référence à un objet chargé dans Java.
ja: Java に読み込まれたオブジェクトへの参照です。
ko: Java에서 로드된 객체에 대한 참조입니다.
pt: Uma referência a um objeto carregado no Java.
pt_br: Uma referência a um objeto carregado em Java.
ru: Ссылка на объект, загруженный в Java.
tr: Java'da yüklenen bir nesnenin başvurusu.
zh_cn: 对已在 Java 中加载的对象的引用。
zh_tw: 對 Java 中已載入的物件的參考。

# JavaPathDescription
source: Path to java.exe
de: Pfad zu „java.exe“
es: Ruta a java.exe
es_mx: Ruta a java.exe
fr: Chemin d’accès à java.exe
ja: java.exe のパスです。
ko: java.exe의 경로
pt: Caminho para o java.exe
pt_br: Caminho para java.exe
ru: Путь к java.exe
tr: java.exe'nin yolu
zh_cn: java.exe 的路径
zh_tw: java.exe 的路徑

# JavaPathDisplayName
source: JavaLibraryPath
es: RutaDeLaBibliotecaDeJava
es_mx: RutaDeBibliotecaDeJava
fr: CheminBibliothèqueJava
ja: Java ライブラリ パス
ko: Java 라이브러리경로
ru: ПутьКБиблиотекеJava
zh_cn: Java 库路径
zh_tw: Java 元件庫路徑

# JavaScopeDescription
source: Java Activities Container
de: Java-Aktivitätencontainer
es: Contenedor de actividades de Java
es_mx: Contenedor de actividades Java
fr: Conteneur des activités Java
ja: Java 系アクティビティのコンテナーです。(Java Scope)
ko: Java 액티비티 컨테이너
pt: Contentor de Atividades Java
pt_br: Contêiner de Atividades Java
ru: Контейнер действий Java
tr: Java Etkinlikleri Kapsayıcısı
zh_cn: Java 活动容器
zh_tw: Java 活動容器

# JavaScopeNameDisplayName
source: Java Scope
es: Ámbito de Java
ja: Java スコープ
zh_cn: Java 作用域
zh_tw: Java 範圍

# LoadJarDescription
source: Loads a jar in the current java scope.
de: Lädt eine JAR-Datei in der aktuellen Aktivität „Java Scope“.
es: Carga un JAR dentro del ámbito de Java actual.
es_mx: Carga un JAR en el ámbito de Java actual.
fr: Charge un fichier jar dans l’activité Java Scope en cours.
ja: Jar を現在の [Java スコープ] アクティビティに読み込みます。(Load Jar)
ko: 현재 java 범위에서 jar을 로드합니다.
pt: Carrega um jar no âmbito java atual.
pt_br: Carrega um arquivo JAR na atividade Java Scope atual.
ru: Загружает JAR-файл в текущее действие Java Scope.
tr: Geçerli java kapsamına bir jar yükler.
zh_cn: 在当前 Java 作用域中加载 Jar。
zh_tw: 在目前 Java 範圍中載入 Jar。

# LoadJarDisplayName
source: Load Jar
es: Cargar JAR
ja: Jar を読み込み
zh_cn: 加载 Jar
zh_tw: 載入 Jar

# LoadJarException
source: Jar could not be loaded.
de: JAR-Datei konnte nicht geladen werden.
es: No se ha podido cargar el JAR.
es_mx: No se pudo cargar el JAR.
fr: Le fichier jar n’a pas pu être chargé.
ja: Jar ファイルを読み込めませんでした。
ko: Jar을 로드하지 못했습니다.
pt: Não foi possível carregar o jar.
pt_br: Não foi possível carregar o arquivo JAR.
ru: Не удалось загрузить JAR-файл.
tr: Jar yüklenemedi.
zh_cn: 无法加载此 Jar。
zh_tw: 無法載入 Jar。

# MethodNameDisplayName
source: MethodName
es: NombreDeMétodo
es_mx: NombreDeMétodo
fr: NomMéthode
ja: メソッド名
ko: 메드 이름
ru: НазваниеМетода
zh_cn: 方法名称
zh_tw: 方法名稱

# MethodNameDescription
source: The name of the method that will be executed in Java.
de: Der Name der Methode, die in Java ausgeführt wird.
es: Nombre del método que se ejecutará en Java.
es_mx: El nombre del método que se ejecutará en Java.
fr: Le nom de la méthode qui sera exécutée en Java.
ja: Java で実行するメソッドの名前です。
ko: Java에서 실행될 메서드의 이름입니다.
pt: O nome do método que será executado no Java.
pt_br: O nome do método que será executado em Java.
ru: Имя метода, который будет выполняться в Java.
tr: Java'da yürütülecek yöntemin adı.
zh_cn: 将在 Java 中执行的方法名称。
zh_tw: 將在 Java 中執行的方法名稱。

# OutputDisplayName
source: Output
es: Salida
es_mx: Salida
fr: Sortie
ja: 出力
ko: 출력
ru: Вывод
zh_cn: 输出
zh_tw: 輸出

# ParametersDescription
source: The list of the arguments specified in the same order as the java method. An argument can not be null.
de: Die Liste der Argumente in der gleichen Reihenfolge wie die Java-Methode. Ein Argument kann nicht NULL sein.
es: Lista de argumentos especificados en el mismo orden que el método de Java. Un argumento no puede ser nulo.
es_mx: La lista de los argumentos especificados en el mismo orden que el método Java. Un argumento no puede ser nulo.
fr: La liste des arguments spécifiés dans le même ordre que la méthode java. Un argument ne peut pas avoir la valeur Null.
ja: Java メソッドでの順序と同じ順序で指定する引数の一覧です。引数を null にすることはできません。
ko: Java 메서드와 동일한 순서로 지정된 인수의 목록입니다. 인수는 Null이 아니어야 합니다.
pt: A lista de argumentos especificados pela mesma ordem que o método java. Um argumento não pode ser nulo.
pt_br: A lista de argumentos especificados na mesma ordem que o método java. Um argumento não pode ser nulo.
ru: Список аргументов, указанных в том же порядке, что и в методе Java. Аргумент не может иметь значение null.
tr: Java yöntemiyle aynı sırada belirtilen bağımsız değişkenlerin listesi. Bağımsız değişken null olamaz.
zh_cn: 以与 Java 方法相同的顺序指定的参数列表。参数不能为 null。
zh_tw: 以與 Java 方法相同的順序指定的引數清單。引數不能為 null。

# ParametersDisplayName
source: Parameters
es: Parámetros
es_mx: Parámetros
fr: Paramètres
ja: パラメーター
ko: 매개 변수
ru: Параметры
zh_cn: 参数
zh_tw: 參數

# ParametersListDisplayName
source: ParametersList
es: ListaDeParámetros
es_mx: ListaDeParámetros
fr: ListeParamètres
ja: パラメーター一覧
ko: 파라미터 목록
ru: СписокПараметров
zh_cn: 参数列表
zh_tw: 參數清單

# ParametersSetException
source: Can not set both {0} and {1}.
de: {0} und {1} können nicht gleichzeitig festgelegt sein.
es: No puede configurar {0} y {1} a la vez.
es_mx: No se pueden establecer tanto {0} como {1}.
fr: Impossible de définir {0} et {1}.
ja: {0} と {1} は同時に設定できません。
ko: {0} 및 {1} 모두를 설정할 수 없습니다.
pt: Não é possível definir {0} e {1}.
pt_br: Não é possível definir {0} e {1}.
ru: Невозможно одновременно задать параметры "{0}" и "{1}".
tr: Hem {0} hem de {1} ayarlanamaz.
zh_cn: 无法同时设置“{0}”和“{1}”。
zh_tw: 無法同時設定 "{0}" 和 "{1}"。

# ResultDisplayName
source: Result
es: Resultado
es_mx: Resultado
fr: Résultat
ja: 結果
ko: 결과
ru: Результат
zh_cn: 结果
zh_tw: 結果

# TargetObjectDisplayName
source: TargetObject
es: ObjetoDeDestino
es_mx: ObjetoDeDestino
fr: ObjetCible
ja: ターゲット オブジェクト
ko: 대상 개체
ru: ЦелевойОбъект
zh_cn: 目标对象
zh_tw: 目標物件

# TargetObjectDescription
source: The java object instace the method will be invoked. TargetObject and TargetType can not be set at the same time.
de: Die Java-Objektinstanz, mit der die Methode aufgerufen wird. TargetObject und TargetType können nicht gleichzeitig festgelegt werden.
es: La instancia del objeto de Java que el método va a invocar. No se puede configurar el ObjetoDeDestino y el TipoDeDestino a la vez.
es_mx: Se invocará el método de instancia del objeto Java. El ObjetoDeDestino y el TipoDeDestino no se pueden establecer al mismo tiempo.
fr: L’instance d’objet java invoquée par la méthode. ObjetCible et TypeCible ne peuvent pas être définis en même temps.
ja: メソッドを呼び出す Java オブジェクトのインスタンスです。[ターゲット オブジェクト] と [ターゲット型] は、同時に設定することはできません。
ko: 메서드가 호출될 java 객체 인스턴스입니다. TargetObject 및 TargetType을 동시에 설정할 수 없습니다.
pt: A instância do objeto java em que o método será invocado. TargetObject e TargetType não podem ser definidos ao mesmo tempo.
pt_br: A instância do objeto java invocada pelo método. Não é possível definir TargetObject e TargetType ao mesmo tempo.
ru: Будет вызван экземпляр объекта Java этого метода. Невозможно одновременно задать параметры TargetObject и TargetType.
tr: Yöntemi çağırmak için kullanılacak java nesnesi. Aynı anda hem TargetObject hem de TargetType ayarlanamaz.
zh_cn: 将调用此方法的 Java 对象实例。无法同时设置目标对象和目标类型。
zh_tw: 將叫用此方法的 Java 物件執行個體。無法同時設定目標物件和目標類型。

# TargetTypeDisplayName
source: TargetType
es: TipoDeDestino
es_mx: TipoDeDestino
fr: TypeCible
ja: ターゲット型
ko: 대상 유형
ru: ТипЦелевогоОбъекта
zh_cn: 目标类型
zh_tw: 目標類型

# TargetTypeDescription
source: The name of the java class.
de: Der Name der Java-Klasse.
es: Nombre de la clase de Java.
es_mx: El nombre de la clase de Java.
fr: Le nom de la classe java.
ja: Java クラスの名前です。
ko: java 클래스의 이름입니다.
pt: O nome da classe java.
pt_br: O nome da classe java.
ru: Имя класса Java
tr: Java sınıfının adı.
zh_cn: Java 类名称。
zh_tw: Java 類別名稱。

# ValidateParentError
source: Activity is valid only inside {0}
de: Aktivität ist nur innerhalb von {0} gültig.
es: La actividad es válida solo dentro de {0}
es_mx: La actividad es válida solo dentro de {0}
fr: L'activité est uniquement valide à l'intérieur de {0}
ja: アクティビティは {0} の内部でのみ有効です。
ko: 액티비티는 {0} 내에서만 유효합니다.
pt: A atividade só é válida dentro de {0}
pt_br: A atividade só é válida em {0}
ru: Действие допустимо только внутри {0}
tr: Etkinlik sadece {0} içinde geçerlidir
zh_cn: 活动仅在“{0}”内有效
zh_tw: 活動僅在 {0} 內有效

source: Field Name
de: Name des Felds
es: Nombre del campo
es_mx: Nombre del campo
fr: Nom du champ
ja: フィールド名
ko: 필드 이름
pt: Nome de Campo
pt_br: Nome do Campo
ru: Имя поля
tr: Alan Adı
zh_cn: 字段名称
zh_tw: 欄位名稱

source: JavaObject
es: ObjetoDeJava
fr: ObjetJava
ja: Java オブジェクト
zh_cn: Java 对象
zh_tw: Java 物件

source: Method Name
es: NombreDeMétodo
es_mx: Nombre del método
fr: NomMéthode
ja: メソッド名
ko: 메서드 이름
ru: Название метода
zh_cn: 方法名称
zh_tw: 方法名稱

source: Output
de: Ausgabe
es: Salida
es_mx: Salida
fr: Sortie
ja: 出力
ko: 출력
pt: Saída
pt_br: Saída
ru: Вывод
tr: Çıkış
zh_cn: 输出
zh_tw: 輸出

# InvalidJavaPath
source: The path to java library is invalid.
de: Der Pfad zur Java-Bibliothek ist ungültig.
es: La ruta de la biblioteca de Java no es válida.
es_mx: La ruta a la biblioteca Java no es válida.
fr: Le chemin d’accès à la bibliothèque java n’est pas valide.
ja: Java ライブラリのパスが無効です。
ko: java 라이브러리의 경로가 잘못되었습니다.
pt: O caminho para a biblioteca java é inválido.
pt_br: O caminho para a biblioteca java é inválido.
ru: Недопустимый путь к библиотеке Java.
tr: Java kitaplığının yolu geçersiz.
zh_cn: Java 库路径无效。
zh_tw: Java 元件庫路徑無效。

# TimeoutMSDisplayName
source: Init timeout (milliseconds)
es: Inicio del tiempo de espera (milisegundos)
es_mx: Iniciar tiempo de espera (milisegundos)
fr: Délai d'initialisation (millisecondes)
ja: 初期タイムアウト (ミリ秒)
ko: 시간 제한(밀리초)
ru: Время ожидания начала (в миллисекундах)
zh_cn: 初始化超时 (毫秒)
zh_tw: 初始化逾時 (毫秒)

# TimeoutMSException
source: The value provided for TimeoutMS must be >= 0
de: Der für TimeoutMS angegebene Wert muss >= 0 sein.
es: El valor proporcionado para TiempoDeEsperaMS debe ser >= 0
es_mx: El valor proporcionado para TiempoDeEsperaMS debe ser >= 0
fr: La valeur fournie pour DélaiAttenteMillisecondes doit être >= 0
ja: [タイムアウト (ミリ秒)] に入力する値は 0 以上である必要があります。
ko: TimeoutMS의 입력 값은 0 이상이어야 합니다.
pt: O valor fornecido para TimeoutMS tem de ser >= 0
pt_br: O valor fornecido para TimeoutMS deve ser >= 0
ru: Значение, указанное для TimeoutMS должно быть больше или равно 0
tr: TimeoutMS için sağlanan değer >= 0 olmalıdır
zh_cn: 超时 (毫秒) 的给定值必须大于或等于 0
zh_tw: 針對逾時 (毫秒) 所提供的值必須大於或等於 0

# TimeoutMSDescription
source: The amount of time (in miliseconds) to wait for the Java runtime connection (default 15000ms).
de: Die Zeit (in Millisekunden), die auf die Java-Laufzeitverbindung gewartet werden muss (Standard: 15.000 ms).
es: La cantidad de tiempo (en milisegundos) que se debe esperar la conexión de runtime de Java (por defecto, 15 000 ms).
es_mx: La cantidad de tiempo (en milisegundos) que se debe esperar la conexión en tiempo de ejecución Java (15 000 ms predeterminados).
fr: Le temps d’attente (en millisecondes) pour que la connexion au runtime Java s’établisse (15 000 ms par défaut).
ja: Java ランタイムに接続するまでに待機する時間 (ミリ秒) です (既定では 15000 ミリ秒)。
ko: Java 런타임 연결을 위해 기다리는 시간(밀리초)입니다(기본 값 15000ms).
pt: A quantidade de tempo (em milissegundos) a aguardar pela ligação do runtime Java (predefinição de 15 000 ms).
pt_br: O tempo de espera (em milissegundos) pela conexão de runtime Java (padrão: 15.000 ms).
ru: Период времени (в миллисекундах) для ожидания подключения к среде выполнения Java (значение по умолчанию — 15 000 мс).
tr: Java çalışma zamanı bağlantısı için beklenecek süre (milisaniye olarak) (varsayılan 15.000 ms).
zh_cn: 等待 Java 运行时连接的时间量 (以毫秒为单位，默认为 15000 毫秒)。
zh_tw: 等待 Java 執行階段連線的時間量 (以毫秒為單位，預設為 15000 毫秒)。
