Repository: UiPath/Community.Activities
Catalog: Activities/Java/UiPath.Java/Properties/UiPath.Java.*.resx
Languages: fr, ja, ko, pt_br

# CastArrayException
source: Can not cast java object to array.
fr: Impossible de convertir l'objet java en matrice.
ja: Java オブジェクトを配列にキャストできません。
ko: java 객체를 배열로 캐스팅할 수 없습니다.
pt_br: Não é possível converter objeto java em matriz.

# CastException
source: Can not cast java object to dot net type.
fr: Impossible de convertir l'objet java en type .NET.
ja: Java オブジェクトを .NET 型にキャストできません。
ko: java를 .net 형식으로 캐스팅할 수 없습니다.
pt_br: Não é possível converter objeto java no tipo .net.

# ClassNotFoundException
source: The target type was not found.
fr: Le type cible est introuvable.
ja: ターゲット型が見つかりませんでした。
ko: 대상 형식을 찾지 못했습니다.
pt_br: O tipo de destino não foi encontrado.

# ConstructorNotFoundException
source: Constructor could not be invoked.
fr: Impossible d'invoquer le constructeur.
ja: コンストラクターを呼び出せませんでした。
ko: 생성자를 호출하지 못했습니다.
pt_br: Não foi possível invocar o construtor.

# DeserializationException
source: The result from java could not be deserialized.
fr: Impossible de désérialiser le résulta de java.
ja: Java からの結果を逆シリアル化できませんでした。
ko: java에서 제공된 결과를 역직렬화하지 못했습니다.
pt_br: Não foi possível desserializar o resultado de java.

# FieldNotFoundException
source: Field with the specified name was not found on target.
fr: Le champ du nom spécifié est introuvable sur la cible.
ja: 指定した名前のフィールドが、ターゲット上で見つかりませんでした。
ko: 지정된 이름을 갖는 필드를 대상에서 찾지 못했습니다.
pt_br: O campo com o nome especificado não foi encontrado no destino.

# IllegalAccessException
source: Only public member can be accessed.
fr: Seul le membre public est accessible.
ja: アクセスできるのはパブリック メンバーのみです。
ko: 공용 멤버에만 액세스할 수 있습니다.
pt_br: Apenas membros públicos podem ser acessados.

# IllegalArgumentsException
source: An illegal or inapropriate parameter has been passed.
fr: Un paramètre interdit ou inapproprié a été transmis.
ja: 無効または不適切なパラメーターが渡されました。
ko: 잘못된 또는 부적절한 파라미터가 전달되었습니다.
pt_br: Um parâmetro inválido ou inapropriado foi passado.

# InstanceNotFoundException
source: The specified instance was not created.
fr: L'instance spécifiée n'a pas été créée.
ja: 指定したインスタンスは作成されませんでした。
ko: 지정된 인스턴스가 생성되지 않았습니다.
pt_br: A instância especificada não foi criada.

# InstantiationException
source: The target class could not be instatiated.
fr: Impossible d'instancier la classe cible.
ja: ターゲット クラスをインスタンス化できませんでした。
ko: 대상 클래스를 인스턴스화하지 못했습니다.
pt_br: Não foi possível instanciar a classe de destino.

# InvocationTargetException
source: An invocation exception has occured during the execution of the target.
fr: Une exception d'invocation s'est produite lors de l'exécution de la cible.
ja: ターゲットの実行中に起動例外が発生しました。
ko: 대상을 실행하는 중 호출 예외가 발생했습니다.
pt_br: Ocorreu uma exceção de invocação ao executar o destino.

# JarAlreadyLoadedException
source: The jar with specified path was already loaded.
fr: Le fichier jar avec le chemin d'accès spécifié a déjà été chargé.
ja: 指定したパスの Jar ファイルはすでに読み込まれています。
ko: 지정된 경로를 갖는 jar이 이미 로드되었습니다.
pt_br: O arquivo JAR com o caminho especificado já foi carregado.

# JarNotFoundException
source: The path to the specified jar was not found or does not exist.
fr: Le chemin d'accès au fichier jar spécifié est introuvable ou n'existe pas.
ja: 指定した Jar ファイルのパスが見つからないか、存在しません。
ko: 지정된 jar로의 경로를 찾지 못하거나 존재하지 않습니다.
pt_br: O caminho para o arquivo JAR especificado não foi encontrado ou não existe.

# JarNotLoadedException
source: Jar could not be loaded.
fr: Impossible de charger le fichier jar.
ja: Jar ファイルを読み込めませんでした。
ko: Jar을 로드하지 못했습니다.
pt_br: Não foi possível carregar o arquivo JAR.

# JavaTimeoutException
source: Java initialization timeout expired.
ja: Java の初期化タイムアウトの期限が切れました。
ko: Java 초기화 시간 제한이 만료되었습니다.
pt_br: O tempo limite de inicialização Java expirou.

# MethodNotFoundException
source: Method could not be invoked.
fr: Impossible d'invoquer la méthode.
ja: メソッドを呼び出せませんでした。
ko: 메서드를 호출하지 못했습니다.
pt_br: Não foi possível invocar o método.

# SerializationException
source: Could not serialize the .net object
fr: Impossible de sérialiser l'objet .net
ja: .NET オブジェクトをシリアル化できませんでした
ko: .net 개체를 시리얼화할 수 없습니다.
pt_br: Não foi possível serializar o objeto .net

# UnknowException
source: An unexpected exception has occurred during the invocation.
fr: Une exception inattendue s'est produite lors de l'invocation.
ja: 呼び出し中に予期しない例外が発生しました。
ko: 호출하는 동안 예기치 않은 예외가 발생했습니다.
pt_br: Ocorreu uma exceção inesperada durante a invocação.
