Repository: UiPath/Community.Activities
Catalog: Activities/Python/UiPath.Python.Activities/Properties/UiPath.Python.Activities.*.resx
Languages: de, es, fr, ja, ko, pt_br, ru, tr, zh_cn, zh_tw

# CodeDescription
source: Python script content
de: Python-Skriptinhalt
es: Contenido del script de Python
fr: Contenu du script Python
ja: Python スクリプトの内容です。
ko: Python 스크립트 내용
pt_br: Conteúdo do script em Python
ru: Содержимое сценария Python
tr: Python komut dosyası içeriği
zh_cn: Python 脚本内容
zh_tw: Python 指令碼內容

# CodeNameDisplayName
source: Code
es: Código
ja: コード
ko: 코드
tr: Kod
zh_cn: 代码
zh_tw: 程式碼

# ConvertException
source: Error converting Python object
de: Fehler beim Konvertieren des Python-Objekts
es: Error al convertir un objeto de Python
fr: Erreur lors de la conversion de l’objet Python
ja: Python オブジェクトの変換中にエラーが発生しました。
ko: Python 개체 변환 중 오류
pt_br: Erro ao converter o objeto Python
ru: Ошибка при преобразовании объекта Python
tr: Python nesnesi dönüştürülürken hata oluştu
zh_cn: 转换 Python 对象时出错
zh_tw: 轉換 Python 物件時發生錯誤

source: Do
de: Ausführen
es: Hacer
fr: Faire
ja: 実行
ko: 실행
pt_br: Fazer
ru: Сделать
tr: Yap
zh_cn: 执行
zh_tw: 執行

# GetObjectDescription
source: Get the .NET type from a PythonObject
de: Abrufen des .NET-Typs aus einem Python-Objekt (PythonObject)
es: Obtenga el tipo .NET de un ObjetoDePython
fr: Obtenir le type .NET à partir d’un objet Python (PythonObject)
ja: Python オブジェクトから .NET 型を取得します。(Get Python Object)
ko: PythonObject에서 .NET 형식을 가져오십시오.
pt_br: Obtenha o tipo .NET de um PythonObject
ru: Получить тип .NET из PythonObject
tr: Bir PythonObject'ten .NET türünü al
zh_cn: 从 Python 对象获取 .NET 类型
zh_tw: 從 Python 物件取得 .NET 類型

# GetObjectNameDisplayName
source: Get Python Object
es: Obtener objeto de Python
ja: Python のオブジェクトを取得
zh_cn: 获取 Python 对象
zh_tw: 取得 Python 物件

# GetObjectResultDescription
source: The .NET type corresponding to Python object
de: Der .NET-Typ, der dem Python-Objekt entspricht
es: El tipo .NET correspondiente al objeto de Python
fr: Type .NET correspondant à l’objet Python
ja: Python オブジェクトに対応する .NET 型です。
ko: Python 개체에 해당하는 .NET 형식
pt_br: O tipo .NET correspondente ao objeto Python
ru: Тип .NET, соответствующий объекту Python
tr: Python nesnesine karşılık gelen .NET türü
zh_cn: 与 Python 对象对应的 .NET 类型
zh_tw: 與 Python 物件相對應的 .NET 類型

source: Input
de: Eingabe
es: Entrada
fr: Entrée
ja: 入力
ko: 입력
pt_br: Entrada
ru: Ввод
tr: Giriş
zh_cn: 输入
zh_tw: 輸入

# InstanceDescription
source: Instance of Python object
de: Instanz des Python-Objekts
es: Instancia del objeto de Python
fr: Instance de l’objet Python
ja: Python オブジェクトのインスタンスです。
ko: Python 개체의 인스턴스
pt_br: Instância do objeto Python
ru: Экземпляр объекта Python
tr: Python nesnesi örneği
zh_cn: Python 对象实例
zh_tw: Python 物件的執行個體

# InstanceNameDisplayName
source: Instance
es: Instancia
ja: インスタンス
ko: 인스턴스
tr: Örnek
zh_cn: 实例
zh_tw: 執行個體

# InvalidMethodNameException
source: Invalid method name
de: Ungültiger Methodenname
es: Nombre de método no válido
fr: Nom de méthode invalide
ja: メソッド名が無効です。
ko: 유효하지 않은 메서드 이름
pt_br: Nome de método inválido
ru: Недопустимое имя метода
tr: Geçersiz yöntem adı
zh_cn: 方法名称无效
zh_tw: 方法名稱無效

# InvalidPathException
source: The specified Python path is not valid: {0}
de: Der angegebene Python-Pfad ist ungültig: {0}
es: La ruta de Python especificada no es válida: {0}
fr: Le chemin d’accès Python indiqué n’est pas valide : {0}
ja: 指定した Python のパスは無効です: {0}
ko: 지정된 Python 경로가 잘못됨: {0}
pt_br: O caminho Python especificado não é válido: {0}
ru: Указанный путь Python является недопустимым: {0}
tr: Belirtilen Python yolu geçerli değil: {0}
zh_cn: 指定的 Python 路径无效: {0}
zh_tw: 指定的 Python 路徑無效: {0}

# InvokeException
source: Error invoking Python method
de: Fehler beim Aufrufen der Python-Methode
es: Error al invocar el método de Python
fr: Erreur lors de l’invocation de la méthode Python
ja: Python メソッドの呼びし中にエラーが発生しました。
ko: Python 메서드 호출 중 오류
pt_br: Erro ao invocar método Python
ru: Ошибка при вызове метода Python
tr: Python yöntemi çağrılırken hata oluştu
zh_cn: 调用 Python 方法时出错
zh_tw: 叫用 Python 方法時發生錯誤

# InvokeMethodDescription
source: Invoke Python method
de: Python-Methode aufrufen
es: Invocar método de Python
fr: Appeler la méthode Python (Invoke Python Method)
ja: Python メソッドを呼び出します。(Invoke Python Method)
ko: Python 메서드 호출
pt_br: Invocar método Python
ru: Вызов метода Python
tr: Invoke Python yöntemi
zh_cn: 调用 Python 方法
zh_tw: 叫用 Python 方法

# InvokeMethodNameDisplayName
source: Invoke Python Method
es: Invocar método de Python
ja: Python メソッドを呼び出し
zh_cn: 调用 Python 方法
zh_tw: 叫用 Python 方法

# LoadScriptDescription
source: Loads and executes a Python script
de: Lädt ein Python-Skript und führt es aus
es: Carga y ejecuta un script de Python
fr: Charge et exécute un script Python
ja: Python スクリプトを読み込み実行します。(Load Python Script)
ko: Python 스크립트 로드 및 실행
pt_br: Carrega e executa um script Python
ru: Загружает и выполняет сценарий Python
tr: Bir Python komut dosyasını yükler ve yürütür
zh_cn: 加载并运行 Python 脚本
zh_tw: 載入並執行 Python 指令碼

# LoadScriptException
source: Error loading Python script
de: Fehler beim Laden des Python-Skripts
es: Error al cargar el script de Python
fr: Erreur lors du chargement du script Python
ja: Python スクリプトの読み込み中にエラーが発生しました。
ko: Python 스크립트 로드 중 오류
pt_br: Erro ao carregar o script em Python
ru: Ошибка при загрузке сценария Python
tr: Python komut dosyası yüklenirken hata oluştu
zh_cn: 加载 Python 脚本时出错
zh_tw: 載入 Python 指令碼時發生錯誤

# LoadScriptNameDisplayName
source: Load Python Script
es: Cargar script de Python
ja: Python スクリプトを読み込み
zh_cn: 加载 Python 脚本
zh_tw: 載入 Python 指令碼

# MethodNameDescription
source: Name of the method to be invoked
de: Name der aufzurufenden Methode
es: Nombre del método que se va a solicitar
fr: Nom de la méthode à invoquer
ja: 呼び出すメソッドの名前です。
ko: 호출될 메서드의 이름
pt_br: Nome do método a ser invocado
ru: Имя вызываемого метода
tr: Çağrılacak yöntemin adı
zh_cn: 要调用的方法名称
zh_tw: 要叫用的方法名稱

# NameDisplayName
source: Name
es: Nombre
ja: 名前
ko: 이름
tr: Ad
zh_cn: 名称
zh_tw: 名稱

# NoScriptSpecifiedException
source: No code/script specified
de: Kein Code/Skript angegeben
es: Sin código/script especificado
fr: Aucun code/script spécifié
ja: コード/スクリプトが指定されていません。
ko: 코드/스크립트 지정 안 됨
pt_br: Nenhum código/script especificado
ru: Не указан код/сценарий
tr: Kod/komut dosyası belirtilmedi
zh_cn: 未指定代码/脚本
zh_tw: 未指定程式碼/指令碼

# OutputDisplayName
source: Output
es: Salida
ja: 出力
ko: 출력
tr: Çıkış
zh_cn: 输出
zh_tw: 輸出

# ParametersDescription
source: Input parameters for Python script
de: Eingabeparameter für Python-Skript
es: Parámetros de entrada para el script de Python
fr: Paramètres d’entrée pour le script Python
ja: Python スクリプトの入力パラメーターです。
ko: Python 스크립트의 입력 파라미터
pt_br: Parâmetros de entrada para script em Python
ru: Входные параметры для сценария Python
tr: Python komut dosyası için giriş parametreleri
zh_cn: Python 脚本的输入参数
zh_tw: Python 指令碼的輸入參數

# ParametersNameDisplayName
source: InputParameters
es: Parámetros de entrada
ja: 入力パラメーター
ko: 입력 파라미터
tr: GirişParametreleri
zh_cn: 输入参数
zh_tw: 輸入參數

# PathDescription
source: Python home path
de: Python-Hauptpfad
es: Ruta de inicio de Python
fr: Chemin d’accès d’accueil Python
ja: Python のホーム パスです。
ko: Python 홈 경로
pt_br: Caminho inicial Python
ru: Основная папка Python
tr: Python giriş yolu
zh_cn: Python 主页路径
zh_tw: Python 主目錄路徑

# PathNameDisplayName
source: Path
es: Ruta
ja: パス
ko: 경로
tr: Yol
zh_cn: 路径
zh_tw: 路徑

# PythonEngineNotFoundException
source: Python engine session was not found
de: Python-Modulsitzung wurde nicht gefunden.
es: No se encontró la sesión del motor de Python
fr: Session du moteur Python introuvable
ja: Python エンジンのセッションが見つかりませんでした。
ko: Python 엔진 세션을 찾을 수 없음
pt_br: A sessão do mecanismo Python não foi encontrada
ru: Сеанс ядра Python не найден
tr: Python altyapısı oturumu bulunamadı
zh_cn: 找不到 Python 引擎会话
zh_tw: 找不到 Python 引擎工作階段

# PythonInitializeException
source: Error initializing Python engine
de: Fehler beim Initialisieren des Python-Moduls
es: Error al inicializar el motor de Python
fr: Erreur lors de l’initialisation du moteur Python
ja: Python エンジンの初期化時にエラーが発生しました。
ko: Python 엔진 초기화 중 오류
pt_br: Erro ao inicializar mecanismo Python
ru: Ошибка при инициализации ядра Python
tr: Python altyapısı başlatılırken hata oluştu
zh_cn: 初始化 Python 引擎时出错
zh_tw: 初始化 Python 引擎時發生錯誤

# PythonObjectDescription
source: Python object to extract value from
de: Python-Objekt, aus dem der Wert extrahiert werden soll
es: Objeto de Python del que se va a extraer un valor
fr: Objet Python d’origine pour l’extraction
ja: 値を抽出する Python オブジェクトです。
ko: 값을 추출할 Python 개체
pt_br: Objeto Python do qual extrair valor
ru: Объект Python, из которого извлекается значение
tr: Şu kaynaktan değer ayıklamak için Python nesnesi:
zh_cn: 要从中提取值的 Python 对象
zh_tw: 要從中擷取值的 Python 物件

# PythonObjectNameDisplayName
source: PythonObject
es: ObjetoDePython
ja: Python オブジェクト
ko: Python 개체
tr: PythonNesnesi
zh_cn: Python 对象
zh_tw: Python 物件

# PythonScopeDescription
source: Python activities container
de: Python-Aktivitätscontainer
es: Contenedor de actividades de Python
fr: Conteneur des activités Python
ja: Python アクティビティのコンテナーです。(Python Scope)
ko: Python 액티비티 컨테이너
pt_br: Container de atividades Python
ru: Контейнер действий Python
tr: Python etkinlikleri kapsayıcısı
zh_cn: Python 活动容器
zh_tw: Python 活動容器

# PythonScopeNameDisplayName
source: Python Scope
es: Ámbito de Python
ja: Python スコープ
zh_cn: Python 作用域
zh_tw: Python 範圍

# ResultDescription
source: The result of script invocation
de: Das Ergebnis eines Skriptaufrufs
es: El resultado de la invocación de un script
fr: Résultat de l’invocation du script
ja: スクリプト呼び出しの結果です。
ko: 스크립트 호출 결과
pt_br: O resultado da invocação do script
ru: Результат вызова сценария
tr: Komut dosyası çağırma işleminin sonucu
zh_cn: 脚本调用结果
zh_tw: 指令碼叫用結果

# ResultNameDisplayName
source: Result
es: Resultado
ja: 結果
ko: 결과
tr: Sonuç
zh_cn: 结果
zh_tw: 結果

# RunScriptDescription
source: Invoke Python script activity
de: Python-Skriptaktivität aufrufen
es: Solicitar la actividad de script de Python
fr: Activité d’invocation du script Python
ja: Python スクリプトを呼び出すアクティビティです。(Run Python Script)
ko: Python 스크립트 액티비티 호출
pt_br: Invoca atividade de script em Python
ru: Вызвать действие сценария Python
tr: Invoke Python script etkinliği
zh_cn: 调用 Python 脚本活动
zh_tw: 叫用 Python 指令碼活動

# RunScriptException
source: Error running Python script
de: Fehler beim Ausführen des Python-Skripts
es: Error al ejecutar el script de Python
fr: Erreur lors de l’exécution du script Python
ja: Python スクリプトの実行時にエラーが発生しました。
ko: Python 스크립트 실행 중 오류
pt_br: Erro ao executar script em Python
ru: Ошибка при запуске сценария Python
tr: Python komut dosyası çalıştırılırken hata oluştu
zh_cn: 运行 Python 脚本时出错
zh_tw: 執行 Python 指令碼時發生錯誤

# RunScriptNameDisplayName
source: Run Python Script
es: Ejecutar script de Python
ja: Python スクリプトを実行
zh_cn: 运行 Python 脚本
zh_tw: 執行 Python 指令碼

# ScriptFileDescription
source: Full path to Python script file
de: Vollständiger Pfad zur Python-Skriptdatei
es: Ruta completa a un archivo de script de Python
fr: Chemin d’accès complet vers le fichier de script Python
ja: Python スクリプト ファイルへのフル パスです。
ko: Python 스크립트 파일의 전체 경로
pt_br: Caminho completo do arquivo de script em Python
ru: Файл сценария Python
tr: Python komut dosyasının tam yolu
zh_cn: Python 脚本文件的完整路径
zh_tw: Python 指令碼檔案的完整路徑

# ScriptFileNameDisplayName
source: File
es: Archivo
ja: ファイル
ko: 파일
tr: Dosya
zh_cn: 文件
zh_tw: 檔案

# ScriptFileNotFoundException
source: The specified script file was not found
de: Die angegebene Skriptdatei wurde nicht gefunden.
es: No se encontró el archivo de script especificado
fr: Le fichier de script indiqué est introuvable
ja: 指定したスクリプト ファイルが見つかりませんでした。
ko: 지정된 스크립트 파일을 찾을 수 없음
pt_br: O arquivo de script especificado não foi encontrado
ru: Указанный файл сценария не найден
tr: Belirtilen komut dosyası bulunamadı
zh_cn: 找不到指定的脚本文件
zh_tw: 找不到指定的指令碼檔案

# TargetPlatformDisplayName
source: Target
es: Destino
ja: ターゲット
ko: 타겟
tr: Hedef
zh_cn: 目标
zh_tw: 目標

# TargetPlatformDescription
source: Specifies the Python runtime platform
de: Gibt die Python-Laufzeitplattform an
es: Especifica la plataforma de tiempo de ejecución de Python
fr: Indique la plate-forme de runtimes Python
ja: Python のランタイム プラットフォームを指定します。
ko: Python 런타임 플랫폼 지정
pt_br: Especifica a plataforma de tempo de execução Python
ru: Указывает платформу среды выполнения Python
tr: Python çalışma zamanı platformunu belirtir
zh_cn: 指定 Python 运行时平台
zh_tw: 指定 Python 執行階段平台

# ValidateParentError
source: Activity is valid only inside {0}
de: Aktivität ist nur innerhalb von {0} gültig.
es: La actividad es válida solo dentro de {0}
fr: L'activité est uniquement valide à l'intérieur de {0}
ja: アクティビティは {0} の内部でのみ有効です。
ko: 액티비티는 {0} 내에서만 유효합니다.
pt_br: A atividade só é válida em {0}
ru: Действие допустимо только внутри {0}
tr: Etkinlik sadece {0} içinde geçerlidir
zh_cn: 活动仅在“{0}”内有效
zh_tw: 活動僅在 {0} 內有效

# VersionDescription
source: Python version
es: Versión de Python
fr: Version de Python
ja: Python のバージョンです。
ko: Python 버전
pt_br: Versão do Python
ru: Версия Python
tr: Python sürümü
zh_cn: Python 版本
zh_tw: Python 版本

# VersionNameDisplayName
source: Version
es: Versión
ja: バージョン
ko: 버전
tr: Sürüm
zh_cn: 版本
zh_tw: 版本

source: Output
de: Ausgabe
es: Salida
fr: Sortie
ja: 出力
ko: 출력
pt_br: Saída
tr: Çıkış
zh_cn: 输出
zh_tw: 輸出

source: WorkingFolder
es: CarpetaDeTrabajo
fr: Dossier de travail (WorkingFolder)
ja: 作業フォルダー
ko: 작업 폴더
tr: ÇalışmaKlasörü
zh_cn: 工作文件夹
zh_tw: 工作資料夾

# WorkingFolderDescription
source: Used to specify the working folder of the scripts executing under the current scope
de: Wird verwendet, um den Arbeitsordner der Skripte anzugeben, die im aktuellen Scope ausgeführt werden
es: Se utiliza para especificar la carpeta de trabajo de los scripts que se ejecutan en el ámbito actual
fr: Utilisé pour indiquer le dossier de travail des scripts en cours d’exécution dans le cadre actuel.
ja: 現在のスコープ下で実行するスクリプトの作業フォルダーの指定に使用します。
ko: 현재 범위 내에서 실행 중인 스크립트의 작업 폴더를 지정하기 위해 사용됩니다.
pt_br: Usado para especificar a pasta de trabalho dos scripts em execução sob o escopo atual
tr: Geçerli kapsam altında yürütülen komut dosyalarının çalışma klasörünü belirtmek için kullanılır
zh_cn: 用于指定在当前作用域内执行的脚本的工作文件夹
zh_tw: 用於指定在目前範圍內執行的指令碼的工作資料夾

# WorkingFolderPathInvalid
source: WorkingFolder path is not valid
de: WorkingFolder-Pfad ist ungültig
es: La ruta de la CarpetaDeTrabajo no es válida
fr: Le chemin d’accès du dossier de travail (WorkingFolder) n’est pas valide
ja: 作業フォルダーのパスが無効です。
ko: WorkingFolder 경로가 잘못되었습니다.
pt_br: Caminho do WorkingFolder inválido
tr: WorkingFolder yolu geçerli değil
zh_cn: 工作文件夹路径无效
zh_tw: 工作資料夾路徑無效

# InvalidVersionException
source: Selected version {0} is different from the version found {1}
de: Die ausgewählte Version {0} unterscheidet sich von der gefundenen Version {1}.
es: La versión seleccionada {0} es diferente de la versión encontrada {1}
fr: La version sélectionnée {0} est différente de la version rencontrée {1}
ja: 選択したバージョン {0} は、見つかったバージョン {1} と異なります。
ko: 선택한 버전 {0}이(가) 발견된 버전 {1}와(과) 다릅니다.
pt_br: A versão selecionada {0} é diferente da versão encontrada {1}
tr: Seçili sürüm ({0}) bulunan sürümden ({1}) farklı
zh_cn: 选定版本 {0} 不同于已找到的版本 {1}
zh_tw: 所選版本 {0} 不同於已找到的版本 {1}

# OperationTimeout
source: Timeout
es: Tiempo de espera
ja: タイムアウト
ko: 시간 제한
pt_br: Tempo limite
tr: Zaman aşımı
zh_cn: 超时
zh_tw: 逾時

# OperationTimeoutDescription
source: The amount of time to allow a Python script to run until it is terminated and an exception is thrown.
de: Die Zeit, die ein Python-Skript ausgeführt werden kann, bis es beendet und eine Ausnahme ausgelöst wird.
es: La cantidad de tiempo que se permite que se ejecute un script de Python hasta que finaliza y se genera una excepción.
fr: Temps nécessaire pour permettre l’exécution d’un script Python jusqu’à la fin et le lancement d’une exception.
ja: Python スクリプトを実行して終了するまでの時間です。設定した時間内に実行が終わらない場合は例外がスローされます。
ko: Python 스크립트가 종료되어 예외가 throw될 때까지 실행이 허용되는 시간입니다.
pt_br: A quantidade de tempo para permitir que um script em Python seja executado até que seja encerrado e uma exceção seja gerada.
tr: Sonlandırılana ve bir özel durum oluşturulana kadar Python komut dosyasının çalışmasına izin verilecek süre.
zh_cn: 在遭到终止及引发异常前，允许 Python 脚本运行的时长。
zh_tw: 在遭到終止及擲回例外狀況之前，允許 Python 指令碼執行的時間長度。

# LibraryPathDescription
source: For Linux is the path to Python libpython*.so library including library name. For Windows (Version>3.9) path to python**.dll including library name(usually is in Python Home path. For Windows (Version<=3.9) leave empty.
de: Für Linux ist der Pfad zur Python-Bibliothek „libpython*.so“ einschließlich des Bibliotheksnamens anzugeben. Für Windows (Version > 3.9) ist der Pfad zu „python**.dll“ einschließlich des Bibliotheksnamens (steht normalerweise im Python-Startpfad) anzugeben. Für Windows (Version <= 3.9) leer lassen.
es: Ruta a la biblioteca de Python libpython*.so incluyendo el nombre de la biblioteca
fr: Chemin vers la bibliothèque Python libpython*.so en incluant le nom de la bibliothèque. Pour Windows (version ultérieure à 3.9), indiquer le chemin vers python**.dll en incluant le nom de la bibliothèque (se trouve généralement dans le chemin Python Home). Pour Windows (Version antérieure à la 3.9), laisser vide.
ja: Linux の場合は、Python ライブラリ libpython*.so (ライブラリ名を含む) のパスを入力します。Windows (3.9 より後のバージョン) の場合は、python**.dll (ライブラリ名を含む) のパスを入力します (通常 Python のホーム パスに含まれます)。Windows (3.9 以前のバージョン) の場合は、空のままにします。
ko: Linux의 경우 Python libpython*.so 라이브러리(라이브러리 이름 포함). Windows(버전>3.9)의 경우 python**.dll 라이브러리 이름 포함(일반적으로 Python 홈 경로에 있음). Windows(버전<=3.9)의 경우 비워 둡니다.
pt_br: Para Linux, é o caminho para biblioteca Python libpython*.so incluindo o nome da biblioteca. Para Windows (versão > 3.9), caminho para biblioteca python**.dll incluindo o nome da biblioteca (geralmente está no caminho inicial Python). Para Windows (versão <= 3.9) deixe em branco.
tr: Linux için, Python libpython*.so yoludur kitaplık adı dahil olmak üzere, kitaplık. Windows (Sürüm>3.9) için python**.dll yolu kitaplık adı da dahil olmak üzere (genellikle Python Ana Sayfası yolundadır). Windows (Sürüm<=3.9) için boş bırakın.
zh_cn: Python libpython*.so 的路径包括库名称在内的库
zh_tw: 對於 Linux，是 Python libpython*.so 元件庫的路徑，包含元件庫名稱。對於 Windows (版本 > 3.9)，是 python**.dll 的路徑，包括元件庫名稱 (通常位於 Python 主目錄路徑)。對於 Windows (版本 <= 3.9)，留空。

# LibraryPathNameDisplayName
source: Library path (Linux or version>3.9)
de: Bibliothekspfad (Linux oder Version > 3.9)
es: Ruta de la biblioteca (solo Linux)
fr: Chemin de la bibliothèque (Linux ou version ultérieure à la 3.9)
ja: ライブラリ パス (Linux または 3.9 より後のバージョン)
ko: 라이브러리 경로(Linux 또는 버전> 3.9)
pt_br: Caminho da biblioteca (Linux ou versão > 3.9)
tr: Kitaplık yolu (Linux veya sürüm>3.9)
zh_cn: 库路径 (仅适用于 Linux)
zh_tw: 元件庫路徑 (適用於 Linux 或版本 > 3.9 的 Windows)
